<template>
<div id="main">

<div class="zhangs" v-for="(section, index) in state.fangyao" :key="index">
  <div class="zhang">{{section.zhang}}</div>
  <div class="jies" v-for="(zhang, index) in section.jies" :key="index">
    <div class="jie">{{zhang.jie}}</div>

    <div class="fangyaos" v-for="(fangyao, index) in zhang.fangyao" :key="index">
      <div class="fangyao">{{fangyao}}</div>
    </div>
  </div>
</div>

</div>
</template>
  
<script setup>
import "@/static/css/iconfont.css";
import { reactive, watch, ref, onMounted } from "vue";

const state = reactive({
  fangyao: [
    {
      "zhang": "第一章",
      "jies": [
        {
          "jie": "第一节调经方",
          "fangyao": [
            "【方药】当归10克，赤芍10克，川萼10克，生桃仁10克（捣碎），红花10克，炒香附子10克（捣碎），郁金10克，丹参15克，三棱10克，莪术10克，怀牛膝10克，益母草15克。",
            "【方药】当归10克，川尊10克，赤芍15克，红花10克,生桃仁10克（捣碎），三棱10克，莪术10克，生山药15克，党参10克，怀牛膝10克。",
            "【方药】当归10克，川萼10克，赤芍10克，炒香附子10克（捣碎），郁金10克，红花10克，莪术10克，生桃仁10克（捣碎），益母草20克，怀牛膝10克，泽兰10克，三棱10克,刘寄奴10克，路路通10克，生水蛭末6克（冲服），干姜6克。",
            "【方药】当归10克，川苓10克，赤芍10克，熟地黄15克，炒香附子10克（捣碎），红花10克，莪术10克，生桃仁10克（捣碎），怀牛膝10克，三棱10克，路路通10克，生水蛭末6克（冲服）。",
            "【方药】熟地黄30克，当归10克，赤芍10克，炒菟丝子15克（捣碎），巴戟天10克，覆盆子10克，蛇床子10克，生山药30克，路路通10克，红花10克，怀牛膝10克，生桃仁10克（捣碎），泽兰10克。",
            "【方药】当归15克，三棱10克，莪术10克，代赭石30克（轧细），赤芍10克，怀牛膝30克，路路通10克，炒王不留行子30克（捣碎），丹皮10克，生桃仁10克（捣碎），红花10克，炒香附子10克（捣碎），川萼6克。",
            "【方药】当归15克，三棱10克，莪术10克，赤芍10克,路路通io克，炒王不留行子30克（捣碎），炒香附子10克（捣碎），红花10克，生桃仁10克（捣碎），丹皮10克，怀牛膝15克，莞蔚子15克，覆盆子15克，熟地黄15克。",
            "【方药】熟地黄15克，莞蔚子10克，炒菟丝子15克（捣碎），生山药30克，怀牛膝10克，当归10克，炒香附子10克（捣碎），赤芍10克，炒白术10克。",
            "【方药】当归10克，川苓10克，赤芍10克，乌药10克，炒香附子10克（捣碎），怀牛膝10克，肉桂6克（捣碎），炒小",
            "【方药】当归10克，川萼10克，赤芍10克，炒香附子10克（捣碎），郁金10克，红花10克，莪术10克，乌药10克，丹参15克，土鳖虫10克（捣碎），玄胡10克（捣碎），生水蛭末6克（冲服）。",
            "【方药】熟地黄30克，炒菟丝子30克（捣碎），生山药30克，当归10克，炒香附子10克（捣碎），红花6克，生桃仁6克（捣碎），玄胡10克（捣碎）。",
            "【方药】当归10克，川苓10克，赤芍10克，红花10克，生桃仁10克（捣碎），炒香附子10克（捣碎），熟地黄15克，生山药15克，炒菟丝子15克（捣碎）。",
            "【方药】丹皮10克，丹参15克，败酱草30克，红藤30克，当归10克，赤芍15克，三棱10克，莪术10克，玄胡10克（捣碎），黄苓10克，意以仁30克，生乳香10克，生没药10克，甘草10克。",
            "【方药】生黄芷20克，党参15克，当归10克，白茯苓15克，生白芍20克，鸡内金10克（捣碎），败酱草30克，红藤30克，惹茵仁30克，三棱10克，莪术10克，玄胡10克（捣碎）。",
            "【方药】红蚤休10克，丹皮10克，丹参20克，败酱草30克，黄苓10克，当归10克，赤芍10克，三棱10克，莪术10克，玄胡10克（捣碎），意茵仁30克，生乳香10克，生没药10克，甘草10克。",
            "【方药】丹皮10克，丹参15克，败酱草30克，红蚤休10克，意以仁30克，当归10克，赤芍15克，椿根白皮10克，黄苓10克，三棱10克，莪术10克，玄胡10克（捣碎），甘草10克。"
          ]
        },
        {
          "jie": "第二节求嗣方",
          "fangyao": [
            "【方药】当归10克，赤芍10克，川萼10克，炒香附子10克（捣碎），红花10克，莪术10克，生桃仁10克（捣碎），怀牛膝10克，刘寄奴10克，生水蛭末6克（冲服），熟地黄15克，炒菟丝子30克（捣碎）。",
            "【方药】当归10克，川苓10克，赤芍10克，炒香附子10克（捣碎），郁金10克，红花10克，莪术10克，生桃仁10克（捣碎），益母草15克，怀牛膝10克，泽兰10克，路路通10克，三棱10克，刘寄奴10克，生水蛭末6克（冲服）。",
            "【方药】熟地黄15克，炒菟丝子30克（捣碎），生山药30克，当归10克，生桃仁10克（捣碎），红花10克，赤芍10克,土鳖虫10克（捣碎），生乳香10克，生没药10克，生水蛭末6克（冲服）。",
            "【方药】生山药50克，当归30克，赤芍30克，生桃仁30克，川苓20克，红花30克，郁金30克，炒香附子30克，三棱30克，莪术30克，路路通30克，生水蛭50克，土鳖虫30克。",
            "【方药】当归10克，熟地黄15克，覆盆子10克，枸杞子10克，生桃仁10克（捣碎），红花10克，路路通10克，泽兰10克，益母草15克，炒菟丝子15克（捣碎），炒香附子10克（捣碎）。",
            "【方药】当归20克，川苓20克，赤芍20克，炒香附子20克，郁金20克，红花20克，生桃仁20克，益母草30克，泽兰",
            "【方药】熟地黄30克，炒菟丝子15克（捣碎），枸杞子10克，蛇床子10克，覆盆子10克，车前子10克，生山药30克，巴戟天10克，当归10克，赤芍10克，丹参15克，党参10克。",
            "【方药】炒菟丝子15克，覆盆子10克，蛇床子10克，枸杞子10克，熟地黄15克，当归10克，生山药15克，巴戟天10克，益母草30克，炒香附子10克（捣碎）。",
            "【方药】熟地黄30克，生山药15克，炒菟丝子15克（捣碎），肉灰蓉10克，枸杞子10克，女贞子10克（捣碎），覆盆子10克，黄精10克，何首乌10克，当归10克，丹参10克,威灵仙15克。",
            "【方药】熟地黄15克，生山药15克，炒菟丝子15克（捣碎），枸杞子10克，当归10克，莞蔚子10克，覆盆子10克,丹参10克，丹皮10克，赤芍10克，路路通10克，红花10克。",
            "【方药】当归10克，赤芍10克，川萼10克，炒香附子10克（捣碎），郁金10克，红花10克，生桃仁10克（捣碎），莪术10克，三棱10克，益母草30克，怀牛膝10克。",
            "【方药】熟地黄15克，炒菟丝子15克（捣碎），覆盆子10克，枸杞子10克，蛇床子10克，五味子10克（捣碎），巴戟天10克，仙茅10克，仙灵脾10克，当归10克，川萼10克，赤芍10克，知母10克，黄柏10克。",
            "【方药】当归10克，川萼10克，赤芍10克，炒香附子10克（捣碎），生桃仁10克（捣碎），鸡内金10克（捣碎），熟地黄15克，枸杞子10克，炒菟丝子15克（捣碎），蛇床子10克,五味子10克（捣碎），巴戟天10克，生山药30克。",
            "【方药】当归10克，川苓10克，路路通10克，赤芍10克，红花10克，熟地黄15克，巴戟天10克，仙茅10克，仙灵脾10克，炒菟丝子15克（捣碎），枸杞子10克，覆盆子10克，蛇床子10克，莞蔚子10克，知母10克，黄柏10克。",
            "【方药】当归10克，赤芍10克，红花10克，丹皮10克，丹参15克，路路通10克，炒王不留行子30克（捣碎），炒香附子10克（捣碎），三棱10克，莪术10克，熟地黄15克，炒菟丝子15克（捣碎），覆盆子10克，枸杞子10克。",
            "【方药】熟地黄15克，炒菟丝子15克（捣碎），枸杞子10克，覆盆子10克，莞蔚子10克，巴戟天10克，仙茅10克，仙灵脾10克，生山药15克，知母10克，黄柏10克。",
            "【方药】当归10克，生桃仁10克（捣碎），红花10克，炒香附子10克（捣碎），赤芍10克，丹参10克，熟地黄15克，炒菟丝子15克（捣碎），枸杞子10克，蛇床子10克，生山药15克。",
            "【方药】当归15克，赤芍10克，生山药15克，车前子15克，生龙骨15克（捣碎），生牡蛎15克（捣碎），美实15克，白茯荟15克，益母草30克，茜草10克，梔子10克（捣碎）。",
            "【方药】当归10克，川萼10克，乌药10克，赤芍10克,红花10克，丹参10克，生桃仁10克（捣碎），益母草15克，",
            "【方药】熟地黄20克，炒菟丝子15克（捣碎），枸杞子10克，覆盆子10克，蛇床子10克，生山药20克，巴戟天10克，艾实15克，莞蔚子10克，丹参10克，炒香附子10克（捣碎）。",
            "【方药】当归10克，生桃仁10克（捣碎），红花10克，炒香附子10克（捣碎），路路通10克，赤芍10克，熟地黄20克，生山药15克，炒菟丝子15克（捣碎），巴戟夭10克，枸杞子10克，覆盆子10克。",
            "【方药】当归10克，生桃仁10克（捣碎），红花10克，路路通10克，泽兰10克，益母草15克，炒香附子10克（捣碎），熟地黄20克，炒菟丝子15克（捣碎），覆盆子10克，枸杞子10克。",
            "【方药】当归10克，川萼10克，赤芍10克，炒香附子10克（捣碎），郁金10克，红花10克，莪术10克，生桃仁10克（捣碎），益母草15克，怀牛膝10克，泽兰10克，三棱10克,",
            "【方药】熟地黄30克，炒菟丝子15克（捣碎），仙茅10克,仙灵脾10克，巴戟天10克，枸杞子10克，覆盆子10克，当归10克，生桃仁10克（捣碎）,红花10克，炒香附子10克（捣碎），路路通10克，赤芍10克。",
            "【方药】当归10克，生桃仁10克（捣碎），红花10克，路路通10克，赤芍10克，怀牛膝10克，炒香附子10克（捣碎），泽兰10克，炒王不留行子15克（捣碎），炒菟丝子15克（捣碎），枸杞子10克，莞蔚子10克。",
            "【方药】生地黄30克，炒菟丝子15克（捣碎），莞蔚子10克，枸杞子10克，炙龟板10克（捣碎），茜草炭10克，梔子10克（捣碎），生白芍15克，怀牛膝10克，藕节10克。",
            "【方药】熟地黄30克，炒菟丝子15克（捣碎），枸杞子10克，车前子10克，覆盆子10克，沙苑子10克，炙龟板10克（捣碎），当归10克，炒白术10克，鸡内金10克，生水蛭末6克（冲服）。",
            "【方药】熟地黄50克，炒菟丝子50克，枸杞子30克，车前子30克，覆盆子30克，生山药30克，生黄茂30克，人参30克，鹿茸15克，当归30克，肉灰蓉30克，梔子15克。",
            "【方药】大熟地50克，仙茅30克，仙灵脾30克，巴戟天30克，炒菟丝子50克，西洋参50克，紫河车50克，嫩鹿茸30克，黄牛鞭（焙焦）50克，生山药50克，肉灰蓉30克，炒白术30克，知母15克，黄柏15克。",
            "【方药】当归10克，川萼10克，赤芍10克，熟地黄20克,丹皮10克，丹参20克，生桃仁10克（捣碎），红花10克。",
            "【方药】熟地黄30克，生山药30克，当归15克，炒菟丝子30克（捣碎），枸杞子15克，炒破故纸10克（捣碎）,沙苑子10克，覆盆子10克，肉欢蓉10克，巴戟天10克，仙茅10克，仙灵脾10克，益母草15克。配黄牛鞭炖服，两天一具。上方连服6剂，后月经未至而受孕矣。",
            "【方药】当归10克，川尊10克，赤芍10克，炒香附子10克（捣碎），红花10克，生桃仁10克（捣碎），乌药10克，玄胡10克（捣碎），炒小茴10克（捣碎），肉桂6克（捣碎），路路通10克。",
            "【方药】当归10克，川萼10克，赤芍10克，炒香附子10克（捣碎），郁金10克，红花10克，莪术10克，生桃仁10克（捣碎），怀牛膝10克，泽兰10克，三棱10克，刘寄奴10克，"
          ]
        },
        {
          "jie": "第三节胎孕方",
          "fangyao": [
            "【方药】生黄芷30克，大红参15克（切小块吞服），爐龙骨30克（捣碎），爐牡蛎30克（捣碎），地榆炭30克，生地炭30克，荆芥炭15克，炒菟丝子30克（捣碎），桑寄生20克，川续断20克，阿胶15克（律化兑服），炒杜仲20克，炒艾叶10克。",
            "【方药】生黄芷30克，当归10克，燃龙骨20克（捣碎），爐牡蛎20克（捣碎），生地炭30克，荆芥炭10克，炒杜仲20克，炒菟丝子30克（捣碎），桑寄生15克，川续断15克，生山药30克，阿胶10克（律化兑服），大红…0克，鸡内金30克，建曲30克，郁金20克，炒香附子20克，白茯苓30克，生白芍30克，陈皮20克，茵陈30克，焦山楂60克，板蓝根60克，炒麦芽30克，金银花30克。",
            "【方药】川楝子10克，郁金10克，三棱10克，莪术10克,降香10克，丹参30克，玄胡10克（捣碎），五灵脂10克，炒香附子10克（捣碎），柴胡10克，炒蒲黄10克。",
            "【方药】川楝子10克，玄胡10克（捣碎），柴胡10克，百合30克，乌药10克，丹参30克，降香10克，砂仁10克（捣碎），良姜10克，炒香附子10克（捣碎），五灵脂10克，炒蒲黄10克，蒲公英30克。",
            "【方药】川楝子15克，郁金10克，生白芍30克，赤芍20克，柴胡10克，蒲公英30克，炒香附子10克（捣碎），丹参30克，五灵脂10克。",
            "【方药】川楝子10克，郁金10克，生白芍30克，赤芍10克，柴胡10克，蒲公英30克，炒香附子10克（捣碎），丹参30克，五灵脂10克，制乳香10克，制没药10克。",
            "【方药】百合30克，川楝子10克，蒲公英30克，炒香附子10克（捣碎），丹参30克，五灵脂10克，生白芍30克，良姜6",
            "【方药】川楝子20克，郁金10克，炒香附子10克（捣碎），三棱10克，莪术10克，鸡内金10克（捣碎）,百合30克，赤白芍各20克，蒲公英30克，玄胡10克（捣碎），乌药10克，制乳香10克，制没药10克，地骨皮30克，青蒿10克。",
            "【方药】百合60克，生白芍30克，乌药10克，丹参30克，降香10克，柴胡10克，蒲公英30克，炒香附子10克（捣碎），良姜10克，五灵脂10克，炒蒲黄10克，制乳香10克，制没药10克，甘草10克。",
            "【方药】百合60克，生白芍30克，乌药10克，蒲公英30克，五灵脂10克，良姜10克，炒香附子10克（捣碎）,降香10克，玄胡10克（捣碎），丹参30克，制乳香10克，制没药10克。",
            "【方药】川楝子15克，郁金10克，赤白芍各20克，蒲公英30克，炒蒲黄10克，五灵脂10克，良姜10克，炒香附子10克（捣碎），丹参30克，玄胡10克（捣碎），三棱10克，莪术10克，制乳香10克，制没药10克。",
            "【方药】炒白术15克，白茯苓15克，鸡内金15克（捣碎），板蓝根30克，生黄芷15克，地骨皮30克，炙鳖甲15克（捣碎），柴胡10克，青蒿10克，炒香附子10克（捣碎），郁金10克，炒麦芽15克，陈皮10克。",
            "【方药】炒白术15克，白茯苓15克，鸡内金15克，板蓝根30克，生黄芷15克，地骨皮30克，青蒿10克，柴胡10克，炒香附子10克（捣碎），郁金10克，炒麦芽15克，陈皮10克，川楝子10克，赤芍10克，生乳香10克，生没药10克。",
            "【方药】炒白术15克，白茯苓15克，鸡内金10克（捣碎），板蓝根20克，生黄芷20克，党参10克，地骨皮20克，柴胡10克，炒香附子10克（捣碎），川楝子10克，炒麦芽15克，当归10克，赤芍10克，生乳香10克，生没药10克。",
            "【方药】炒白术15克，生黄茂20克，党参20克，当归10克，板蓝根20克，地骨皮20克，柴胡10克，赤白芍各15克,炒香附子10克（捣碎），川棟子10克，生乳香10克，生没药10克。",
            "【方药】炒白术15克，白茯苓15克，党参15克，鸡内金15克（捣碎），焦山楂30克，青皮10克，炒香附子10克（捣碎），川楝子10克，柴胡10克，当归10克，赤芍15克，甘草10克。",
            "【方药】炒白术15克，白茯苓15克，鸡内金10克（捣碎），当归10克，板蓝根30克，柴胡10克，茵陈10克，焦山楂30克，川楝子10克，生白芍20克，蒲公英30克，连翘10克。",
            "【方药】炒白术15克，白茯苓15克，鸡内金10克（捣碎），",
            "【方药】炒白术15克，白茯苓15克，三棱10克，莪术10克，柴胡10克，焦山楂30克，炒香附子10克（捣碎），丹参15克，生白芍15克，梔子10克（捣碎），蒲公英30克，金银花20克，茵陈10克。",
            "【方药】炒白术15克，板蓝根30克，梔子10克（捣碎），三棱10克，莪术10克，柴胡6克，炒香附子10克（捣碎），生白芍30克，金银花20克，丹参15克，蒲公英30克，茵陈10克。",
            "【方药】炒白术15克，生黄芷15克，党参15克，当归10克，甘草10克，赤白芍各20克，鸡内金15克（捣碎），三棱10克，莪术10克，玄胡10克（捣碎），柴胡10克，川楝子20克，生乳香10克，生没药10克，茵陈10克。",
            "【方药】炒白术15克，鸡内金15克（捣碎），当归10克,生白芍15克，三棱10克，莪术10克，川楝子15克，茵陈10克，土鳖虫10克（捣碎），板蓝根30克。",
            "【方药】生黄茂30克，炒白术15克，当归15克，党参10克，柴胡10克，鸡内金15克（捣碎），连翘10克，土鳖虫10克（捣碎），生桃仁10克（捣碎），红花10克，三棱10克，莪术10克，生水蛭10克（轧细末冲服）。",
            "【方药】生黄芷30克，生白芍30克，当归10克，炒白术15克，鸡内金10克（捣碎），党参10克，三棱10克，莪术10克，生桃仁10克（捣碎），红花10克，土鳖虫10克（捣碎），生乳香10克，生没药10克，生水蛭10克（轧细末冲服）。",
            "【方药】生黄芷30克，当归30克，炒白术15克，川楝子10克，党参10克，沉香10克，三棱10克，莪术10克，土鳖虫10克（捣碎），生桃仁10克（捣碎），红花10克，生水蛭10克（轧细末冲服）。",
            "【方药】生黄芷15克，当归15克，生白芍30克，党参10克，板蓝根30克，炒白术10克，生桃仁10克（捣碎），川楝子10克，红花10克，土鳖虫10克（捣碎）,沉香10克，生水蛭10克（轧细末冲服）。",
            "【方药】生黄芷15克，当归15克，枳壳15克，鸡内金15克（捣碎），丹参30克，川楝子15克，玄胡10克（捣碎），三棱10克，莪术10克，赤芍10克，炒香附子10克（捣碎）。",
            "【方药】生黄芷20克，当归15克，炒白术15克，党参10克，鸡内金10克（捣碎），生桃仁10克（捣碎），红花10克，土鳖虫10克（捣碎），柴胡10克，连翘10克，生水蛭10克（轧细末冲服）。",
            "【方药】生黄芷20克，当归10克，炒白术15克，党参10克，鸡内金10克（捣碎），生白芍30克，川楝子10克，三棱10克，莪术10克，生桃仁10克（捣碎）,红花10克，生乳香10克，生没药10克。",
            "【方药】炒白术15克，白茯苓15克，柴胡10克，生白芍30克，当归10克，鸡内金10克（捣碎），三棱10克，莪术10克，川楝子10克，炒香附子10克（捣碎），生桃仁10克（捣碎），土鳖虫10克（捣碎）。",
            "【方药】生黄茂20克，炒白术15克，当归10克，鸡内金10克（捣碎），白茯苓15克，川楝子15克，三棱10克，莪术10克，土鳖虫10克（捣碎），沉香10克，生水蛭10克（轧细末冲服）。",
            "【方药】生黄芷30克，炒白术15克，白茯苓30克，鸡内金10克（捣碎），茵陈10克，丹参10克，生桃仁10克（捣碎），红花10克，莪术10克，土鳖虫10克（捣碎），生水蛭10克（轧细末冲服）。",
            "【方药】生黄茂30克，当归20克，白茯苓30克，党参15克，鸡内金30克，三棱30克，莪术30克，土鳖虫30克，生水蛭30克，炒白术30克，生桃仁20克，红花20克。",
            "【方药】当归15克，川楝子10克，生桃仁10克（捣碎），红花10克，丹皮10克，枳壳15克，炒香附子10克（捣碎），玄胡10克（捣碎），炒白术10克，鸡内金10克（捣碎）。",
            "【方药】当归10克，川楝子10克，生桃仁10克（捣碎），红花10克，丹皮10克，枳壳15克，乌药10克，赤芍10克,玄胡10克（捣碎），鸡内金10克（捣碎），生黄芷15克。",
            "【方药】生黄茂30克，当归20克，生桃仁20克，生地黄30克，红花20克，玄胡20克，炒香附子20克，赤芍20克,川楝子20克，甘草20克，鸡内金30克，炒白术30克。",
            "【方药】生黄芷15克，当归10克，枳壳15克，柴胡10克,五灵脂10克，炒香附子10克（捣碎），川楝子10克，生桃仁6克（捣碎），红花6克，生地黄15克，丹皮10克。",
            "【方药】生黄芷30克，当归15克，枳壳15克，赤芍10克,川楝子10克，玄胡10克（捣碎），炒香附子10克（捣碎），生桃仁10克（捣碎），红花10克，川苓6克，鸡内金10克（捣碎）。",
            "【方药】地骨皮30克，柴胡10克，青蒿10克，生白芍30克，连翘10克，板蓝根30克，鸡内金10克（捣碎），当归15克，白茯苓20克。",
            "【方药】生黄茂15克，党参15克，板蓝根30克，鸡内金15克（捣碎），生白芍30克，地骨皮30克，白茯苓15克，炒白术10克，建曲30克，陈皮10克，茵陈15克，甘草10克。",
            "【方药】生黄茂15克，党参15克，板蓝根30克，鸡内金10克（捣碎），生白芍30克，地骨皮30克，白茯苓15克，炒白术10克，建曲30克，陈皮10克，当归10克，柴胡10克，甘草10克，茵陈10克。",
            "【方药】生黄芷30克，党参15克，板蓝根30克，地骨皮30克，柴胡10克，生白芍20克，白茯苓15克，炒白术10克，鸡内金15克（捣碎），当归20克，建曲30克，陈皮10克，茵陈10克，甘草10克。",
            "【方药】生黄茂30克，当归15克，白茯苓15克，生白芍30克，板蓝根30克，柴胡10克，茵陈10克，鸡内金15克（捣碎），三棱10克，莪术10克，姜黄10克。",
            "【方药】生黄芷30克，当归20克，生白芍30克，板蓝根30克，鸡内金30克，炒白术20克，三棱20克，莪术20克，姜黄20克，甘草20克。",
            "【方药】板蓝根30克，当归10克，白茯苓30克，赤白芍各20克，柴胡10克，鸡内金15克（捣碎），蒲公英30克，炒香附子10克（捣碎），炒建曲30克，焦山楂30克，郁金10克,连翘10克。",
            "【方药】板蓝根30克，当归10克，白茯苓15克，赤白芍各20克，柴胡10克，鸡内金15克（捣碎）,蒲公英30克，炒香附子10克（捣碎），炒建曲30克，郁金10克，党参15克，炙鳖甲10克（捣碎），大黄10克（后下），皂角刺10克。",
            "【方药】板蓝根30克，当归10克，青蒿10克，川楝子15克，白茯苓15克，柴胡10克，赤白芍各20克，鸡内金15克（捣碎），炒香附子10克（捣碎），炙鳖甲10克（捣碎），大黄10克（后下），丹皮10克。",
            "【方药】板蓝根30克，当归10克，生黄芷30克，白茯苓15克，甘草10克，鸡内金10克（捣碎），垂盆草15克，平地木15克，炒白术15克。",
            "【方药】板蓝根30克，茵陈15克，梔子10克（捣碎），白英藜10克，连翘10克，鸡内金15克（捣碎），生白芍15克,平地木15竞，垂盆草15克，土鳖虫10克（捣碎），炙鳖甲10克（捣碎），丹皮10克。",
            "【方药】板蓝根30克，生黄芷30克，当归10克，赤芍10克，茵陈10克，连翘10克，鸡内金10克（捣碎），炙鳖甲10克（捣碎），垂盆草15克，平地木15克，丹皮10克，土鳖虫10克（捣碎）。",
            "【方药】生黄茂30克，当归15克，板蓝根30克，赤芍15克，连翘10克，茵陈10克，鸡内金15克，甘草10克，大黄10克，炙鳖甲15克，垂盆草15克，平地木15克，土鳖虫10克。",
            "【方药】生黄芷30克，当归10克，板蓝根30克，连翘10克，甘草10克，赤芍10克，鸡内金10克，大黄10克，炙鳖甲10克，垂盆草15克，平地木15克，土鳖虫10克，丹皮10克，芦荟10克。",
            "【方药】板蓝根30克，茵陈30克，大黄10克（后下），梔子10克（捣碎）,鸡内金10克（捣碎），白茯苓15克，滑石30克，车前子15克，炒白术10克，泽泻10克，蒲公英30克，甘草10克。",
            "【方药】板蓝根30克，茵陈30克，大黄10克（后下），梔子10克（捣碎），车前子15克，鸡内金10克（捣碎）,白茯苓15克，滑石30克，泽泻10克，柴胡10克，甘草10克。"
          ]
        }
      ]
    }
  ]
})

</script>
  
<style lang="less" scoped>
#main{
  .zhangs{
    padding: 20px 30px;
    .zhang{
      font-size: 30px;

    }
    .jies{
      padding: 10px 30px;
      .jie{
        font-size: 20px;
      }

      .fangyaos{
        padding: 10px 20px;
        .fangyao{
          font-size: 15px;
        }
      }
    }
  }
}
</style>
  