<template>

<div id="main">

  <div class="zhangs" v-for="(section, index) in state.fangjieData" :key="index">
    <div class="zhang">{{section.zhang}}</div>
    <div class="jies" v-for="(zhang, index) in section.jies" :key="index">
      <div class="jie">{{zhang.jie}}</div>

      <div class="fangjies" v-for="(fangjie, index) in zhang.fangjies" :key="index">
        <div class="fangjie">{{fangjie}}</div>
      </div>
    </div>
  </div>

</div>
</template>
  
<script setup>
import "@/static/css/iconfont.css";
import { reactive, watch, ref, onMounted } from "vue";

const state = reactive({
  fangjieData: [
    {
      "zhang": "第一章",
      "jies": [
        {
          "jie": "第一节调经方",
          "fangjies": [
            "【方解】女子月经落后伴腹痛，或三五月一行者，应责之气滞血瘀也。故方中多用理气活血之 品，气顺血瘀不阻，冲任调和，月事当以时下。方中用生桃仁者，桃仁皮红，善入血分，桃春天发芽最早，生发之机最强，取其生发之机，以活血散瘀通络，若炒熟用之， 生发之机消失，用之何用也？余临证凡用桃仁，皆取生者捣碎用之。水蛭轧末冲服，因水蛭本为食血之物,煎汤服之药力分解极少，若轧末冲服，一克可抵煎汤十克也。",
            "【方解】女子痛经大抵可分两类：若经期或来潮前腹痛者，多因气滞血瘀，阻滞胞络所致，本方是也。中医认为：血随气行，气滞则血瘀，故本方以理气，佐活血散瘀之  品，方中川萼、香附子、莪术、川楝子、玄胡均气中之血药，实理气以行血也。乌药、川萼散寒止痛；乳香、没药、红花活血散瘀止痛。",
            "【方解】女子见以上诸症者， 现代医学认为为“盆腔炎”。故本方重用红藤、败酱草、二丹、苓、芍以清热；没药、玄胡、棱、术理气止痛；惹茵仁利湿。瘀、湿、热祛，冲任调，宫安诸疾除矣。"
          ]
        },
        {
          "jie": "第二节求嗣方",
          "fangjies": [
            "【方解】此方实桃红二丹四物汤加补肾之剂。不孕之证，瘀阻者多，虑其散瘀之力不足，故加水蛭、路路通以助其散瘀之力。《  内经》云：“任脉通，太冲脉盛，月事以时下，故能有子。”任脉通畅，胞宫无瘀者，遇氤氯之时媾合自能受孕也。故女子不孕，冲任不足，肾气不盛者有之；瘀阻胞宫者更 甚也。尤其胎产之后复不受孕者，本方经期服用，效更显也。",
            "【方解】此方实五子衍宗丸加味，以大队温经补肾填冲任之剂组成。尤适于女子冲任未充，肾气未盛之不 育。现代医学认为受孕之时，在月经净后第七天之后。月经净后乃为卵泡发育之时，卵泡的发育与肾、冲任盛衰有关，故填精补肾即助卵泡发育，冲任未充服之多效验也。 二仙、熟地、山药壮阳补肾、填补冲任之精品；五子衍宗丸为种子之良方。故肾虚腰酸腿软之不孕者，服之多收捷效也。",
            "【方解】本方具有通任助孕之功效。女子月经 净后，为卵泡发育期，一般需5~7天，卵泡成熟后即由卵巢排出。本方补肾与通任并用，补肾进一步培补卵泡，使卵泡健壮无恙，菟丝、枸杞、熟地、巴戟之功也。通任乃  疏通输卵管之道，使卵泡、精子游历无阻，顺利结合，以达卵泡受精着床之目的，此乃路路通、红花、当归之功也。此时若热敷温暖小腹，管道温柔，胞宫温暖，犹如三春 万物生发，受孕之机更充也。",
            "【方解】本方为填精补肾所立，培补元阴元阳之底方。鹿茸、肉灰蓉、熟地黄补肾壮阳之要药，五子乃治男女不育之宗方；龟板补阴之至 品；人参、当归补气养血；乌药、益智仁温肾化气。诸药合用，温肾壮阳，填精益冲任，既填补先天之不足，又培补后天精血之衰微。女子身体未充，月经不潮；或冲任虚 损、子宫发育欠佳，久久服之，自能康复受孕也。"
          ]
        },
        {
          "jie": "第三节胎孕方",
          "fangjies": [
            "【方解】菟丝子、桑寄生、川续断、阿胶系张锡纯“寿胎丸”方。余非窃  张氏之方，而此方确系保胎良方。余临证多年，仅4味药确实不能顾及坠胎诸多之疾，故加当归、党参益气养血以摄胎；山药、熟地补肾以培补胎元；黄苓清热以安胎；砂  仁、白术益脾和胃，培补后天以资先天（陈修园谓：黄苓、白术为安胎圣药）。菟丝子、桑寄生乃寄于他物之上而生长；川续断有类人筋骨不易折之形状，故系胎不易坠而 茁壮成长也；阿胶补血养阴，伍当归、熟地滋血以养肝。肝、脾、肾、气血同治，肾精充，冲任固，气血旺，胎元坚实，胎儿发育强壮无恙，不仅无坠胎流产之忧，且育儿 壮实寿增，聪颖过人也。",
            "【方解】砂仁、半夏、白术温胃降逆止呕；茯苓、陈皮、当归、芍药理气、行滞、止痛；黄苓清热安胎；菟丝子、寄生、续断、阿胶补肾系胎 养胎。全方共奏健脾胃、止呕恶、安胎、降逆气、补肾固胎元之功，胎旺茁壮成长而无恙也。",
            "【方解】方中白术健脾渗湿；苏梗、陈皮、白芍和胃抑肝理气；黄连、黄 苓苦寒清热降胃；半夏豁痰降逆止呕；菟丝、川断、寄生、阿胶安胎、养胎、补肾系胎。诸药共奏抑肝降逆、止呕安胎之功也。",
            "【方解】方中阿胶、冬花、天冬、甘草 润肺止咳；杏仁、贝母、瓜萎皮、前胡、桔梗化痰止咳；茯苓、陈皮、苏子除湿化痰利气；桑寄生、阿胶、川贝止嗽安胎。全方共奏止嗽化痰安胎之效也。",
            "【方解】本 方具有理气、养血、顺产之功。即当归、川苓养血理气；枳壳、陈皮宽中理气；茯苓、泽泻健脾利湿以助行滞理气之功；甘草和中。药味虽少，却能使胎位安和而无恙也。 "
          ]
        },
        {
          "jie": "第四节崩漏方",
          "fangjies": [
            "【方解】方中熟地、山药、龙骨、牡蛎补肾固冲任；参、茂益气摄血；共奏培元扶正之功。乌贼骨、茜草、地榆、荆芥炭  塞流止血；三七参止血散瘀，使涩而不致留瘀。故大崩不止者，服一剂血可止，两剂可安也。下血过多，面色眺者，元气大亏，有虚脱之势，党参易人参，加山萸肉以防虚 脱也。乌贼骨、茜草并用，实窃《内经》之意，《内经》有四乌側鱼骨一茹芦丸，治伤肝时时前后血。临床加味用于治疗崩漏之疾，其效显矣。",
            "【方解】冲任亏虚，瘀 血阻滞胞宫，新血不生，故血下而不 "
          ]
        },
        {
          "jie": "第五节带下方",
          "fangjies": [
            "【方解】方中白术、党参、茯苓益气健脾；茵仁、山药、苍术健脾利湿；乌贼、茜草 、车前子收涩止带；白芍平肝清热，使肝不乘脾。脾健湿利，运化正常，不治带，带下可止也。",
            "【方解】方中山药、英实、车前子补肾填精固真元；龙骨、牡蛎固脱止 带；肾气盛，冲任固，此乃治本之法也。乌贼、茜草化滞并具收涩之力；泽泻、茵仁清热利湿；芍药平肝以清肝热。收涩清利并用，以治其标也。",
            "【方解】方中茯苓、 猪苓、车前子、泽泻、茵仁利水渗湿止带；土茯苓、黄柏、丹皮、椿根白皮、梔子清热泻火，解毒止带；乌贼、茜草收涩止带；怀牛膝引诸药下驱直达病所，共奏清热除湿 止带之功也。"
          ]
        },
        {
          "jie": "第六节产后方",
          "fangjies": [
            "【方解】胞宫虚而无新血滋养，故小腹空坠而微痛。重用参、芷、归、术益气摄血，培补正气，使血不妄行  ；佐龙骨、牡蛎镇冲任以固摄；艾叶、蒲黄止血并散瘀；王不留行子通乳以散结。瘀血祛，新血生，气血旺，胞宫安，恶露自止也。",
            "【方解】方中重用白术、茯苓、甘 草健脾以增脾胃运化之功能，促大肠传导之能力；当归、肉灰蓉濡润、养血补肾，以增润滑之力；生地清热养阴；赭石通大便而不伤脾胃。全方共奏健脾、润燥、清热、通 下之功也。",
            "【方解】方中重用归、芷、参、术益气养血，以补产后大亏之气血；鸡汤营养丰富以助补养之药力；山甲、王不留行子通络下乳；路路通、漏芦、通草利气 通络；黄酒具散之力；气旺血盛，乳络通利，乳汁自足也。",
            "【方解】方中当归、白芍补血养血，以增乳汁之源；白术、茯苓健脾，增气血生化之源；柴胡、芍药、王不 留行子，理气散结；路路通、炮山甲、漏芦、通草、王不留行子通络下乳。气血旺，乳汁之源充足，气结散，乳络通利，乳汁自足也。",
            "【方解】方中蒲公英、瓜萎善消 乳痈。《本草纲目》云：“妇人乳痈、水肿，蒲公英煮汁饮之，立消。”金银花、连翘、生地黄、甘草清热凉血解毒；赤芍散血；炮山甲、王不留行子、通草行滞通乳。故乳 汁稽留，乳腺不通者，可散，可下；腐败之乳汁可消，乳痈可除也。"
          ]
        },
        {
          "jie": "第七节妇科杂症方",
          "fangjies": [
            "【方解】此方乃《金匮•桂枝茯苓丸》加味是也。 “桂枝茯苓丸”为仲景治女子癥痕之底方。方中桂枝温中行气以散结；水蛭、桃仁、三棱、莪术攻坚散瘀；牡蛎咸寒软坚；赤芍、丹皮凉血行血中之滞；茯苓渗湿健脾。诸药 合用共奏软坚散瘀之功，子宫所聚之瘀阻赘结，自能徐徐消除也。至于水蛭消瘀散结之力，张锡纯谓：“水蛭味咸，色黑气腐，善入血分；因其为噬血之物,故善破血；因其 气腐，其气味与瘀血相感召，不与新血相感召。故善破瘀血而不伤新血也。其色黑，下趋，善破冲任之瘀。”故消子宫之瘀阻独一无二之良药也。牡蛎咸寒，软坚化痰结，  为消療第一良药，故借其软坚之力助诸药马到成功也。",
            "【方解】方中郁金、柴胡、川楝子、青皮、当归理气解郁;牡蛎、贝母化痰散结；炮山甲、王不留行子、瓜萎通  乳散血；路路通、漏芦善通乳腺。故诸药共奏理气解郁散结之功也。",
            "【方解】炮山甲、桃仁、土鳖虫活血化瘀；牡蛎、贝母软坚散结；乳香、没药散结止痛。诸药合剂 ，药膏固定，直达病所，渗透肌肤，逐散肿块，余屡试，较单内服“郁癖丹”效更捷也°",
            "【方解】方中重用百合、白芍、生地黄汁浆黏腻之品，以滋阴养阴安神；合欢皮  、茯神、石菖蒲宁志开窍；珍珠母以潜上浮之阳；当归养血；知母清热而除虚烦。阴液充足，心神得养，虚烦祛，神志安宁，诸疾可除矣。",
            "【方解】阴挺即“子宫下脱”，实气虚下陷也。多因产后胞宫虚未复其常，劳累行走，或蹲坐较久，胞宫韧带松弛，致胞宫下脱也。故重用黄芷、川萼、柴胡、知母益气升提；龙骨、牡蛎镇冲任以收敛 ；乳香、没药调肝、散瘀解郁。久久服之，伴卧床休息，均可得愈也。",
            "【方解】方中红藤、白花蛇舌草、败酱草、土茯苓、丹皮清热解毒；归、芍、棱、术、乳、没、 玄胡活血散瘀止痛；惹茵仁、土茯苓健脾利湿。诸药合用，共奏散瘀利湿，清胞宫热毒。胞宫得安,•腹痛带下自止也；素往月经不调者，月经自调也；因诸疾不孕者，自有 孕育也。,"
          ]
        }
      ]
    },
    {
      "zhang": "第二章内科",
      "jies": [
        {
          "jie": "第一节胃病方",
          "fangjies": [
            "【方解】蒲公英清热散结，《外科证治全生集》说：“蒲公英烧存性，善 治胃痛。”百合、白及汁浆黏腻，胃黏膜炎性糜烂者极易愈合；芍药酸敛止痛；丹参散瘀活血。诸药合用，于慢性胃胱痛，胃、十二指肠黏膜糜烂甚有效验。更助以“失效散 、金铃子散、良附丸”温经散寒，理气止痛；乳香、没药散瘀止痛，其效更捷。余临床屡试屡效也。",
            "【方解】胃脱疼痛，经久不愈，固定不移，或呕恶泛酸，多属现代  医学胃溃疡。",
            "【方解】本方含“苓桂术甘、四君子、理中”诸方之意。苓桂术甘温胃化饮，利湿健脾；四君子和胃益中；理中止呕、温中祛寒；厚朴除痞满而消呕胀。脾 胃虚寒，水湿停滞胃胱之疼痛，确能药到病除也。",
            "【方解】本方含“补中益气汤、黄芷建中汤”之意。重用黄芷佐升麻、桂枝补中益气；砂仁、枳壳、大枣和中健脾；芍 药、甘草酸甘止痛；桂技能升能降，与柴胡相伍，善疏肝和胃；便澹纳差者加白术，因白术具健脾温胃益气之功也。",
            "【方解】赭石、滑石强通腑气下行；牛膝引诸药下 行；升麻反佐，引诸药上升直达病所，同时升麻清热解毒，善清胃火，最治口疮、牙痛。诸药合用，胃浊降，腑气通，口舌无秽浊熏蒸，不止牙痛，牙痛自止，不除口臭， 口臭自除也。",
            "【方解】方中重用赭石、半夏、竹茹者，引药下行，降胃逆以止呕吐；重用白芍平肝降逆；天冬、山药汁浆稠黏，使开破降浊之药不致损伤其胃也；当归 、灰蓉甘润濡胃并润大便。诸药合用，降逆而不伤胃，润下而不滑利也。",
            "【方解】《珍珠囊药性赋》云：“砲砂有烂肉之功。”故用砲砂腐烂食道胃胱之肿结；水蛭、槟 榔破瘀散结；沉香理气降气。药力猛烈，故服药半小时后，速进食物将敷于肿结之药冲下，不致损伤食管及胃壁也；更得降逆止呕汤液之相辅，可使结散，肿消，病除而不 伤正也。"
          ]
        },
        {
          "jie": "第二节泄泻方",
          "fangjies": [
            "【方解】方中炒白术、大枣肉、鸡内金健脾以助运化；干姜温中散寒；石榴皮收涩以敛大肠之滑泻；山药补肾利  湿养胃；黄连、吴茱萸名“左金丸”，善治邪稽大肠、大便黏滞之腹痛。诸药合用补脾健脾，温中散寒，收涩止泻。中焦温暖，脾胃功能健壮，运化正常，传导有序，泄泻自 止也。",
            "【方解】《珍珠囊药性赋》云：“黄连厚肠胃而止泻。”余临床对心火炽盛、口舌生疮者喜用之，亦多用于肠胃功能失调之腹泻。热者能清，湿者能燥，随证加减 ，效验颇佳。金樱子、龙骨收敛固涩；白术、山楂炭健脾行滞；车前子、泽泻分清别浊、止泻利小便。诸药合用，健脾止泻，敛而不滞，涩而不固，久泻自止，泻止体自复 也。",
            "【方解】脾胃虚弱，运化无力，不能复受其邪也。故重用白术佐砂仁、茯苓以健脾，增其中焦运化之力；山楂炭、陈皮健脾行滞止泻；牵牛子导滞推陈出新。",
            "【方解】车前子汁浆稠黏，与龙、牡合用，具有收敛之功；芍药、甘草酸甘化阴，酸敛止痛；木香、黄连、焦山楂行气化滞,清热燥湿解毒。诸药合用，大有厚肠胃、敛溃  疡之功。淤久之湿热清，肠内溃疡愈合，传导正常，无滞留之邪，泻痢自止也。",
            "【方解】方中白头翁、地榆、马齿免清热解毒，为治赤痢之圣药；苓、连、柏、金银花 清热解毒，燥湿止痢；山楂、白芍化滞止痛；葛根解表退热。诸药合用，力专效宏，热痢初起，一剂可安矣。"
          ]
        },
        {
          "jie": "第三节肝胆方",
          "fangjies": [
            "【方解】本  方实“金铃子散”加味，适用于胆囊炎症。方中川楝子、郁金、柴胡疏肝解郁；茵陈、大黄、梔子、金钱草清热利胆，疏泄胆汁；枳实、玄胡理气止痛。郁解、胆汁疏泄有度 ，肿大之胆囊自然消除，胁痛胀满亦可解也。",
            "【方解】本方所主之证，乃中医之肝气郁结也。方中合欢皮、百合宁志安神，大有解郁止烦之功，重用能消除善思多虑之 恙，故用之以为君；佐疏肝解郁止痛诸药以止胁痛。肝郁胁痛甚者，故加蒲公英以清之，失笑散和之、散之。诸药合用，郁解胁痛止矣。",
            "【方解】方中川楝子、白芍、 三棱、莪术疏肝理气；郁金、",
            "【方解】方中川楝子、郁金、三棱、莪术疏肝解郁；良附丸、失笑散、丹参饮、百合汤和胃止痛，四方齐下，共奏和胃止痛之功也。",
            "【方解】方中重用参、术、苓健脾以益生化之源；鸡内金消食健胃，增进饮食；归、芍养血补肝；板蓝根清肝解毒；柴胡、因陈疏肝利胆，理气柔肝，利导肝胆之邪从小便 去。肝血旺，肝气盛不失疏泄之职，肝胆之邪得清、得利，肝病自愈也。",
            "【方解】肝病至此，病情重笃，正气衰微，邪毒日盛。故重用参、术、芷、归、芍、茯苓培元 扶正，养血益肝，以增驱邪之力；鸡内金健脾消食，善于化结，增加饮食以助正气，更有消瘀散结之功；水蛭、姜黄、桃仁、棱、术散瘀血，理气滞，破症结。诸药合用， 开胃进食，攻补相济，扶正而不滞，攻邪而不伤正气，故久服无恙，更何况肝病至此非一日之功，非久服、徐徐渐进，不能取其铲除根深蒂固之病痍也。",
            "【方解】方中 桃仁、归、芍活血祛瘀；生地、丹皮清血分瘀热；川楝子、香附子、乌药、枳壳、川苓疏肝行气；玄胡、五灵脂理气止痛。瘀祛结散，气调痛止，诸症自除矣。",
            "【方解 】方中重用归、芍、芷养肝阴，补肝血，益肝气，扶正以驱邪；板蓝根、柴胡清肝热，疏肝气；三棱、莪术、姜黄理气滞，破恶血以散瘀结；鸡内金健脾增进饮食，助归、 茂以扶正，其散结破瘀之力，又可助棱、术理气散结。全方补肝养肝，佐理气散结，消谷进食。肝气盛，厥阴功能可复矣。",
            "【方解】方中归、茂益肝气、养肝血，扶正 ，壮驱邪之力；赤芍、内金健脾益生化之源，以壮扶正之力；板蓝根、连翘、甘草护肝、清肝、柔肝；鳖甲、平地木、垂盆草、土鳖虫、丹皮清泻肝脏之毒邪；大黄引毒邪 从大便去。肝盛驱邪有力，邪毒无稽留之地，肝病自除矣。",
            "【方解】乙肝之疾，虽外观无大恙，然人人谈起“乙肝”之",
            "【方解】方中参、茂补益肝气（黄芷善补肝气 ，《医学衷中参西录》论之甚详）；归、芍、枸杞、萸肉、木瓜滋阴养肝以补肝体；柴胡、白芍疏肝理气。宗“陷者举之”，取升麻、枳壳、白术、柴胡以升举下垂之脏器。 肝脏阴血充，肝气盛，功能易于康复；众药升而举之，肝气疏，条达正常，肝脏之功能当复常矣。"
          ]
        },
        {
          "jie": "第四节心病方",
          "fangjies": [
            "【方解】方中丹参、归  、芍、桃、红活血散瘀止痛；降香、川芍、山楂、柴胡行滞止痛。全方共奏活血、行滞、止痛之功也。",
            "【方解】方中重用参、芷益气推动血脉运行；三七、丹参散瘀以 通血脉；焦楂、檀香理气滞以散胸结，冰片理气透窍；朱砂镇心安神；归、茂并用，益气养血。诸药合用，益气养血以扶正，散瘀通络以散结，理气化滞以蠲痹。血随气行 ，气盛络通，血旺瘀散，何痹之有也？",
            "【方解】方中用桃红四物活血散瘀；郁金、檀香、怀牛膝理气止痛；枳壳、柴胡、桔梗理气滞，并托扶诸药上升血府以达病所。 诸药共奏通血府之脉络，理血府之气滞，散血府之瘀阻也。",
            "【方解】方中重用参、芷益气以固本，佐归、芍养血宁心以安神；附子、干姜温中散寒益心阳；桂枝、炙甘 草通心阳并通血脉。诸药合用对心血不足、心阳不振、心动过缓、阳虚之证确收椁鼓之效也。",
            "【方解】方中重用当归、枣仁养心宁心安神；龙骨、牡蛎、茯神善治心悸 ，定魄安魂。心律不齐者，气滞血府，心血不足，心无所养，故用降香、焦楂、青皮、枳壳、丹参行气滞，以帅血行，血旺神安，以除心悸、怔忡、心律不齐也。",
            "【方 解】心悸心跳、心动过速者，阴血不足也。故遣滋润浆液之品，填补阴液以荣心体，百合、麦门冬、桂圆、生地是也；萸肉、芍药酸敛性平，敛心、宁心以制心动过速；枣 仁宁志安神；龟板为补阴之圣品；甘草和诸药而缓急（缓急可遏制心率）。多汗者，加龙、牡收敛止汗；热盛者，加石膏、知母清热凉润。心肌无损，心悸心跳、心动过速 者，随证加减，多收椁鼓之效也。",
            "【方解】方中重用生地黄、梔子入血分以清热凉血；石膏、金银花、板蓝根、蒲公英清气分热以解热毒；归、参益气补血以养心体； 龙骨、牡蛎、百合收敛定志以安心神。邪犯心宫，诸药合用，随证加减，多收良效也。然症状缓解，仍动则喘息，伴困倦乏力者，必继服“清心益气汤”方收全效也。",
            "【 方解】邪毒已去，急需荣本，故重用归、茂、参益气血，扶正固本；佐地黄、麦门冬凉血清润；焦山楂通血脉助消化，以增生化之源（山楂善通络、降血脂）；西洋参、玉 竹、黄精、五味子敛心阴并补肺气，气盛血旺，体自复也。"
          ]
        },
        {
          "jie": "第五节肾病方",
          "fangjies": [
            "【方解】“腰以上肿，当发汗。”故方中麻黄发散表邪，宣肺利  水，使水湿之邪从皮毛而去；石膏清宣肺热，宣降肺气；泽泻、车前子、石苇、瞿麦导湿利水，使水湿之邪从小便去；板蓝根、甘草清热以解水湿毒邪。诸药合用，疏风解 表，清热解毒,宣肺利水。中医谓之“风水”，现代医学谓之“急性肾炎”者,随证加减，多收捷效也。",
            "【方解】谓之慢性肾炎者，乃肾脏受损也，重用熟地黄、生山药、菟 丝子填精补肾以固本。肺为水之上源，重用黄芷补肺气以通调水道。脾主运化，白术、茯苓、炒白扁豆、惹仁健脾以运化水湿。车前子、泽泻走下焦，导湿利水，促潴留之 水湿速从小便去。肺、脾、肾三脏并治，水湿不能久稽，水肿自消矣。",
            "【方解】方中金银花、板蓝根、蒲公英、连翘清热解毒；石苇、瞿麦、篇蓄降火通淋；滑石、木 通、车前子清热利尿；甘草和诸药而缓急止痛。诸药合用，可清热解毒利尿也。",
            "【方解】方中黄芷、柴胡、升麻升举益气，以增强肺脏通调"
          ]
        },
        {
          "jie": "第六节身痛 方",
          "fangjies": [
            "【方解】寒邪凝滞，痰液痹阻，滞留血脉筋骨，或滞留关节，阻遏阳气，血脉不通，故疼痛难忍。重用熟地黄填精补血；佐鹿角胶血肉有情之品补血  助阳；肉桂、炮姜、麻黄温中散寒，和营调卫；白芥子能化皮里膜外筋骨之痰；痰瘀滞久化热，故加金银花以清热解毒；怀牛膝强肾补精，引诸药以达病所；加当归、乳、 没者，助散瘀活血止痛之功。诸药共奏温阳散寒，宣通血脉，相辅相成，如阳光一照，寒凝悉解，故谓之阳和也。",
            "【方解】方中川乌、桂枝温阳蠲寒；芍药、甘草甘酸 化阴以",
            "【方解】方中归、芍、芷补气益血扶正，以助驱邪之力；川乌、麻黄以蠲风寒湿邪；丹参、乳、没活血止痛。邪去正复，痛自止也。",
            "【方解】腰痛休息后转 侧不利，疼痛加重，乃腰肌损伤，肾虚也。故重用杜仲、山药、续断、牛膝补肾壮腰以利腰肌；佐活血散瘀止痛以利腰气。腰痛未久，少者两三剂，多者四五剂多能获愈。 即使腰痛日久不愈者，徐服数剂亦当获愈也。"
          ]
        },
        {
          "jie": "第七节外感方",
          "fangjies": [
            "【方解】石膏治外感热病，张锡纯集历代诸家本草及临床论之甚详，石膏之  应用，发挥淋漓尽致。然余临床多年，仿张锡纯运用石膏治外感热病，视病情之轻重，酌用其量，无不随手奏效。故取生石膏为君，清解外感热邪；金银花、连翘助石膏清 解热邪之力；荆、薄、蝉蜕透肺卫以逐邪外出；热邪稽留，必伤阴液，故取玄参、党参养阴生津，并佐石膏不致伤正而损胃也。",
            "【方解】风寒感冒，恶寒发热而不甚， 故遣荆、防、羌活辛温以透风寒之邪；蝉蜕解表助透邪外出；唯恐风寒之邪郁而化热，故加金银花、甘草以清解热毒。",
            "【方解】方中金银花、蒲公英、连翘、生地黄清 热解毒；生石膏、薄荷叶清热解肌，透邪外出；甘草和诸药并助诸药清热解毒。诸药合用，共奏清热解毒、透邪外出。凡外感风热，邪毒炽盛；或腮腺肿大，毒邪郁而不透 ，服此方多立竿见影，效果显也！",
            "【方解】方中重用黄茂，佐党参益气；芍药、山楂、玄参酸腻之味以实阴。气盛，阳气得布；阴盛，阳气有所伏；阴平阳秘，自无发 热之理也。"
          ]
        },
        {
          "jie": "第八节头痛方",
          "fangjies": [
            "【方解】本方适应于现代医学“高血压”头痛证。赭石、牛膝、白芍镇肝潜阳，可降清窍之浊气；钩藤、菊花升  清以荣清窍；夏枯草、茵陈清肝、柔肝、缓肝之急以制约赭石镇肝之猛烈；珍珠母有安神宁志之功；牛膝、芍药补肝肾，肝虽镇复得养之，腰酸腿软可除，肝亦无恙。诸药 合用，浊降巅清，大脑安康，头晕头痛自除也。",
            "【方解】参芷合用，补气力宏，气虚不能荣脑，而见头昏困倦乏力者，用之多见奇效。然参、茂补气之力虽宏，亦有升 腾之力，则至巅甚微，故佐升麻升提直至巅顶；葛根、菊花入太阳经善消头目之疾，更助参、茂以益巅，并解参、茂之偏温。四肢麻木者，血虚之征也，归、芷相济，气血 双补，力更雄也。大脑得其濡养，精力充沛，思路自然敏捷，诸症可除矣！",
            "【方解】头痛一证，临床常见，古今医家多有论述，有太阳、阳明、厥阴、少阳、太阴头痛 之分；又有久痛入络之说，我皆信矣。余拟“清巅活血汤”一方，对久痛入络之头痛，现代医学谓“血管神经性头痛”效果尤佳。方中归、萼、芍、红花乃通络活血之品，以达 活络止痛之功；荆子、细辛、白芷、川萼上行头部，为治头痛之要药；僵蚕、地龙散风解痉止痛；葛根、川萼引药归经入巅，直达病所；更得菊花轻清，以清清窍；牛膝、 珍珠母入巅以降浊阴。诸药合用，共奏清巅活血止痛之功也。",
            "【方解】方中半夏燥湿以化痰，天麻平肝熄风以止眩；茯苓、白术健脾祛湿以除生痰之源；泽泻利湿助燥 ，化痰；珍珠母、白芍平肝熄风；牛膝补肝肾，引风邪下行；赭石止呕吐并迫使肝风下降；生姜温中除湿。临床痰湿中阻之头昏目眩头痛者（西医谓：内耳眩晕症），随证 加减，多收椁鼓之效也。"
          ]
        },
        {
          "jie": "第九节精神病方",
          "fangjies": []
        },
        {
          "jie": "第十节虚劳方",
          "fangjies": [
            "【方解】方中百部、百合、甘草、沙参、贝母抗 痔、滋肺止咳；白及敛肺；女贞子、山药养阴补肾（肾为肺之子，肾水旺，阴精盛，亦可滋肺）；鸡内金健脾，培补生化之源。全方共奏滋肺、抗捞、止咳之功也。",
            "【 方解】五味子、干姜温肺、散寒；细辛敛肺；麻黄宣肺内痰涎。细辛、麻黄一敛一散，促肺内淤积之痰涎易于排出。地龙解痉止咳；半夏化寒湿之痰；杏仁、甘草润肺止咳 ；芍药酸寒解诸药之温热，使其归于平衡也。",
            "【方解】本方实麻杏石甘汤加黄苓助石膏以清肺热；加前胡、五味子化肺窍之痰实；加细辛敛肺牵制麻黄之宣散也。",
            "【方解】慢支，肺虚肾亦虚也。取山药、龙骨、牡蛎补肾敛冲以治本；苏子、五味子蠲逐肺中痰涎以治标；地龙解痉，助苏子、五味子化痰之力。药味虽少，可谓标本并治 、扶正驱邪相得益彰，肺中宿疾可得缓解或解除也。"
          ]
        },
        {
          "jie": "第十一节甲状腺方",
          "fangjies": []
        },
        {
          "jie": "第十二节消渴方",
          "fangjies": []
        },
        {
          "jie": "第 十三节鼻鈕方",
          "fangjies": []
        },
        {
          "jie": "第十四节咽喉方",
          "fangjies": []
        }
      ]
    },
    {
      "zhang": "第三章男科",
      "jies": [
        {
          "jie": "第十五节生精丸",
          "fangjies": [
            "【方解】方中重用熟地、鹿茸、紫河车、肉灰蓉填补精血；山药、菟丝子、肉桂补肾阴、肾阳；归、参益气补血，大补元气；螟蚣节节有脑（张锡纯谓：娱蚣节节有脑）， 壮阳补脑生髓。诸药共奏大补元气、益髓生精之功也。"
          ]
        },
        {
          "jie": "第十六节化精丸",
          "fangjies": [
            "【方解】本方即“六味地黄汤”加麦门冬、知母、玄参诸清热滋润  之剂。泽泻、茯苓有渗利泄精之功；地黄、萸肉、山药益阴补肾。诸药共济清热滋润、益肾泻精也。"
          ]
        },
        {
          "jie": "第十七节益气通溺汤",
          "fangjies": [
            "【方解】气虚  者，肺气虚也，肃降通调水道无力，故水液潴留而小便不利。重用黄芷、党参补肺气，佐升麻、柴胡以升举;山药、泽泻利小便兼补肾阴；车前子汁浆黏腻，利小便而不伤  阴；甘草和中缓急，清热、解水液潴留之邪毒。气机升降正常,病当除矣。"
          ]
        },
        {
          "jie": "第十八节前列康丸",
          "fangjies": []
        },
        {
          "jie": "第十九节阴阳分离散",
          "fangjies": [
            "【方解】方中白术、茯苓、内金、山楂炭健脾以促运化之力；山药、车前子、黄连、甘草厚肠胃而止泻；滑石、泽泻、木通利水湿从小便去。脾健，运化正常，  水湿不从谷道而下，泻自止也。"
          ]
        },
        {
          "jie": "第二十节止泻护阴汤",
          "fangjies": [
            "【方解】方中葛根、苓、连清热止泻；白术、茯苓、惹仁、车前子、鸡内金健脾止  泻；乌梅、山药、麦门冬、玄参、山楂生津护阴。"
          ]
        },
        {
          "jie": "第二十一节降逆止泻汤",
          "fangjies": [
            "【方解】代赭石、竹茹降逆止呕；白术、白茯苓、鸡内金健脾  和胃；葛根、苓、连清热止泻；车前子、山药、白茯苓利水止泻。诸药共济，降逆止呕，健脾止泻也。"
          ]
        },
        {
          "jie": "第二十二节温中止泻汤",
          "fangjies": []
        }
      ]
    },
    {
      "zhang": "第五章外科",
      "jies": [
        {
          "jie": "第二十三节阑尾得救一号方",
          "fangjies": [
            "【方解】方中金银花、蒲公英、败酱草、连翘、意以仁清热解毒，消阑尾之水肿  ；大黄、三棱、莪术通腑气以逐阑门之阻滞；桃仁、赤芍、当归散瘀止痛。腑气通，瘀阻散，水肿消，病当除矣。"
          ]
        },
        {
          "jie": "第二十四节阑尾得救二号方",
          "fangjies": []
        },
        {
          "jie": "第二十五节肤光净散",
          "fangjies": [
            "【方解】方中乌蜗蛇、连翘、苦参、甘草清热解毒；赤芍、丹参、紫草活血通络；白鲜皮、地肤子、浮萍、蝉蜕 消风，专除皮肤之疾，并引诸药外达皮肤。诸药合用，久久用之，年久之牛皮癣亦得痊愈也。"
          ]
        },
        {
          "jie": "第二十六节治传染性软疣方",
          "fangjies": []
        }
      ]
    }
  ]
})

</script>
  
<style lang="less" scoped>
#main{
  .zhangs{
    padding: 20px 30px;
    .zhang{
      font-size: 30px;

    }
    .jies{
      padding: 10px 30px;
      .jie{
        font-size: 20px;
      }

      .fangjies{
        padding: 10px 20px;
        .fangjie{
          font-size: 15px;
        }
      }
    }
  }
}
</style>
  