<template>
<div id="main">

<div class="zhangs" v-for="(section, index) in state.jiajian" :key="index">
  <div class="zhang">{{section.zhang}}</div>
  <div class="jies" v-for="(zhang, index) in section.jies" :key="index">
    <div class="jie">{{zhang.jie}}</div>

    <div class="jiajians" v-for="(fangjie, index) in zhang.fangyao" :key="index">
      <div class="jiajian">{{fangjie}}</div>
    </div>
  </div>
</div>

</div>

</template>
  
<script setup>
import "@/static/css/iconfont.css";
import { reactive, watch, ref, onMounted } from "vue";

const state = reactive({
  jiajian: [
    {
      "zhang": "第一章",
      "jies": [
        {
          "jie": "第一节调经方",
          "fangyao": [
            "【加减】小腹冷痛甚加干姜6克；纳差、食欲减退者，加鸡内金10克；室女伴腰酸腿软、头晕、耳鸣者，减桃仁、郁金、香附子，加生山药、大熟地、炒菟丝子各30克。",
            "【加减】小腹冷痛甚减丹皮、香附子，加干姜6克、炒小茴10克；伴腰腿酸痛者，减丹皮，加怀牛膝10克、生山药30克。若月经后期，小腹微微作痛者，肾虚也。减红花、赤芍、莪术、川楝子，加熟地黄、菟丝子、生山药、肉灰蓉以填补冲任。",
            "【加减】小腹冷痛者，减黄苓、丹皮，加乌药、炒小茴各10克，肉桂6克（捣碎）；小腹痛有硬结者，加土鳖虫10克、生水蛭末6克（冲服）；带下多加椿根白皮10克。"
          ]
        },
        {
          "jie": "第二节求嗣方",
          "fangyao": [
            "【加减】腹痛甚加生乳香10克、生没药10克；小腹冷痛者加炒小茴10克、肉桂6克。产后久不受孕，妇科检査“输卵管粘连不通或通而不畅”者，减熟地黄、枸杞子，加炒王不留行子30克（捣碎）、怀牛膝10克。",
            "【加减】腰酸而痛者，加怀牛膝10克、川续断10克；经期腹痛，经血紫暗者，加红花6克、赤芍10克；身体虚弱，冲任未充，经血量少，或月经三五月一行者，加鹿茸3克（轧碎冲服）；小腹冷痛者，加炒小茴10克（捣碎）、肉桂6克（捣碎）。",
            "【加减】经期伴身痛、头痛者，加川尊10克；腹痛、白带多者，加意以仁、乌贼骨各30克，茜草10克。",
            "【加减】面色觥白纳差者，加黄注30克、炒白术15克；伴低热者减乌药、五味子，加玄参30克，炙龟板加至15克；久婚不孕者，加重鹿茸、人参配丸药徐服。",
            "【加减】阳虚甚加肉桂10克、制附子10克；白带多加鹿角霜30克；性欲淡漠加鹿茸10克。"
          ]
        },
        {
          "jie": "第三节胎孕方",
          "fangyao": [
            "【加减】腰酸痛甚者，加炒杜仲30克；腹痛下坠者，加生黄芷30克、升麻6克；面色萎黄、神疲乏力者，党参易人参；阴道淋沥流血者，加炒艾叶10克；胎痿不长、屡孕屡坠者，上方轧细末为丸，徐服之。",
            "【加减】呕吐甚加代赭石30克；泛酸者加黄连10克、苏叶10克；小腹坠胀疼痛者，加生黄芷15克、党参10克。",
            "【加减】心烦易怒、心悸头晕者，加百合15克、当归10克；纳差呕吐甚，加砂仁10克；小腹微痛伴腰酸腰痛者，加炒杜仲15克、炒艾叶10克。",
            "【加减】腰酸乏力者，加炒杜仲15克；腹痛坠胀者，加升麻6克；反复多次流产者，加桑寄生15克、川续断15克。方中参、茂益气以安胎；当归、芍药、川萼养血以安胎；菟丝子补肾以系胎元；枳壳、厚朴、砂仁和胃以理气滞。气盛血旺，气机调顺，妊娠腹痛或胎动不安可除。屡孕易坠者，频频服之，可保胎儿无滑坠之忧也。",
            "【加减】干咳痰中夹血丝者，减茯苓、冬花、紫莞，加百合15克、白芍15克；五心烦热者，减茯苓，加地骨皮15克、南沙参15克；久咳声音嘶哑者，减前胡、茯苓、冬花，加麦门冬10克、石菖蒲10克。",
            "【加减】热盛口舌生疮甚者，加黄连10克、木通3克；小便涩痛短赤者，加车前子、石苇各10克，利湿亦通淋；鼻岫或咳嗽痰夹血丝者，加阿胶、藕节各10克。方中黄苓、梔子清热泻火安胎；生地、芍药凉血、养血、安胎；麦门冬、生地黄养阴宁心；寄生、当归补肾生血以系胎元。故妊娠期间，遇上述诸症服之胎可安也。"
          ]
        },
        {
          "jie": "第四节崩漏方",
          "fangyao": [
            "【加减】下血过多加血余炭、侧柏叶炭各10克；夹血块甚多者，加炒蒲黄10克；神疲乏力、面色觥白者，党参易人参15克（切小块吞服），加山萸肉15克；腰痛如折者，加炒杜仲30克，川续断15克。",
            "【加减】流血久而色淡，伴神疲乏力者，减桃仁、红花，加生黄芷30克、党参10克；流血量多，减桃仁、红花，加旱莲草、仙鹤草各15克。",
            "【加减】气虚甚党参易人参10克（切小块吞服）；流血量多加艘龙骨、燈牡蛎各30克。此方实归脾汤酌加固冲止血之剂。方中重用参、芷益气摄血；茯神、远志、枣仁、当归宁志安神养血以宁冲任；萸肉、杜仲固肾以补冲任；乌贼、茜草止血妄行;木香行诸药之滞。气血旺盛，冲任固摄，血不妄行，流血自止也。"
          ]
        },
        {
          "jie": "第五节带下方",
          "fangyao": [
            "【加减】带下清稀、小腹冷痛者，加鹿角霜15克、炮姜6克；两胁串痛者，加柴胡6克、炒香附子10克（捣碎）。",
            "【加减】带下量多加鹿角霜15克（捣碎）、椿根白皮10克；腰痛甚加炒杜仲15克；色黄腥臭者，加茵陈10克、黄柏6克。",
            "【加减】腰酸痛者，加生山药30克；发热，口干、口渴者，减茯苓、泽泻，加蒲公英、金银花各30克。"
          ]
        },
        {
          "jie": "第六节产后方",
          "fangyao": [
            "【加减】腹痛甚加乌药、木香各6克以理气止痛；恶露量少，",
            "【加减】伴大便干结者，白术加至30克，加肉灰蓉10克；小腹刺痛者，加益母草15克；恶露日久不止，伴低热者，加红蚤休10克、蒲公英30克。",
            "【加减】气虚者，加生黄茂30克，党参15克；乳汁不足者，加炒王不留行子30克（捣碎）。",
            "【加减】伴腰酸腿软者，加熟地黄30克；伴口干、口渴者，加瓜萎根30克、金银花30克；气血虚弱甚，党参易人参15克。",
            "【加减】乳房胀痛热硬者，加全瓜萎一个（捣碎）、蒲公英30克；大便干结者，当归、白术各加至30克。",
            "【加减】身热口渴者，加生石膏（捣碎）、瓜萎根各30克。"
          ]
        },
        {
          "jie": "第七节妇科杂症方",
          "fangyao": [
            "【加减】身体消瘦伴纳差者，加炒白术30克、鸡内金30克；伴乏力、动则喘息者，减桃仁、红花，加生黄芷50克、当归30克；流血多而不止者，可先服“引血宁宫汤”（崩漏方）加血余炭，血止宫宁再服“代刀化癥丸”。",
            "【加减】肿块痛甚者加乳香、没药各10克。",
            "【加减】怔忡、心悸者，加桂圆肉15克；失眠多梦者，加炒枣仁15克（捣碎）。",
            "【加减】心慌心悸者，加当归10克、桂圆肉15克；子宫下脱甚，加升麻10克；腰酸腿软者，加生山药30克。",
            "【加减】小腹痛有包块者，减土茯苓、败酱草、红藤，加生、桃仁、桂枝各10克，白茯苓15克，水蛭粉6克（冲服）；白带多而腥臭者，减当归、三棱、莪术、玄胡、丹参，加乌贼骨30"
          ]
        }
      ]
    },
    {
      "zhang": "第二章内科",
      "jies": [
        {
          "jie": "第一节胃病方",
          "fangyao": [
            "【加减】'泛酸甚，加乌贼骨30克；舌苔黄，脉弦，减良姜、乌药、砂仁，白芍加至60克；伴胀闷，右肋疼甚，加威灵仙",
            "【加减】胃踪呈刺痛者，加金铃子散；疼痛遇凉加重者，加良附丸。",
            "【加减】脉沉弱，自觉胃脫寒凉者，减半夏，加制附子、砂仁各6克（捣碎）；困倦痞满者，加蕾香10克；纳差者，加鸡内金10克（捣碎）；胃胱痛甚者，加乌药、良姜各10克。",
            "【加减】胃脱热胀者，减桂枝，加黄连10克（捣碎）、蒲公英30克；食凉物加重者，减升麻、白芍，加吴茱萸、干姜、厚朴各6克；便澹纳差者，加炒白术30克、陈皮10克。",
            "【加减】伴口渴者，加生石膏30克（捣碎）；大便干结甚者，加大黄10克；牙痛甚者，加细辛3克。’"
          ]
        },
        {
          "jie": "第二节泄泻方",
          "fangyao": [
            "【加减】前7味轧细末，和枣肉晒干，炒焦轧末为丸，每服6克，1日2次。",
            "【加减】因食物不洁伴呕吐者，加蕾香10克、滑石30克；因脾胃受其寒凉泄泻即作者，加良姜10克。",
            "【加减】血多者加地榆炭、白头翁各30克；腹痛甚白芍酒炒加至30克。",
            "【加减】高热不退者，加生石膏50克、连翘10克；大便血多脓少者，加槐花30克；里急后重、脓血便滞留难下者，加木香10克。"
          ]
        },
        {
          "jie": "第三节肝胆方",
          "fangyao": [
            "【加减】胁痛甚，加生白芍、威灵仙各30克，生乳香、生没药各10克；伴嗝气纳差者，加焦山楂30克；胃臆痛心烦不宁者，减大黄，加合欢皮30克、五灵脂10克。",
            "【加减】胁痛甚，加生乳香、生没药、降香各10克；胃胱痛甚，加蒲公英3。克，炒蒲黄、五灵脂各10克。",
            "【加减】胀满纳差甚，加焦山楂、炒建曲各30克。",
            "【加减】胃脫疼痛牵引两胁者，加柴胡以疏之；胃院疼痛固定不移者，加乳香、没药以散之；泛酸甚，加乌贼骨收敛制酸。",
            "【加减】胁痛甚，加川楝子10克；少气懒言者，加生黄茂30克。",
            "【加减】两胁痛甚，加生乳香、生没药、沉香各10克；右肋板硬者，加土鳖虫10克（捣碎）。",
            "【加减】两胁痛甚，加生乳香、生没药各6克；硬块坚硬者，加土鳖虫10克；短气乏力者，减香附子、红花，加黄芷、党参各15克；纳差食欲不振者，加炒白术15克、鸡内金10克。",
            "【加减】上药共轧细末，水泛为丸，每服6克，1日2次。身体虚浮、舌淡苔白腻者，加白茯苓30克；肝脏肿大者，加土鳖虫10克；纳差便澹者，加炒白术15克。",
            "【加减】纳差、大便澹薄者，加炒白术15克；邪毒炽盛，加",
            "【加减】前9味共轧细末，水泛为丸，朱砂为衣，勿令泄气，每服2克，壮人服3克，1日2次，米汤送下。忌饮酒及辛辣食物。",
            "【加减】大便干结甚，大黄加至15克；发热甚，加金银花30克、连翘10克；纳差、不思饮食，加炒白术15克、山楂炭30克。",
            "【加减】胁痛者，加生乳香、生没药各6克；恶心、舌苔白腻者，加白茯苓15克；纳差者，加鸡内金10克（捣碎）。'"
          ]
        },
        {
          "jie": "第四节心病方",
          "fangyao": [
            "【加减】胸痛甚，加生乳香、生没药各20克；气虚自汗者,加生黄茂30克；院腹胀痛者，加川楝子、玄胡各20克。",
            "【加减】胸痛甚，加生乳香、生没药各20克；倦怠乏力甚，黄茂加至50克；两胁胀痛者，加郁金、川楝子各20克。",
            "【加减】胸痛甚，加生乳香、生没药各10克；外伤所致发热疼痛者，减川苓、枳壳、檀香，加金银花30克；心电图提示：冠状动脉供血不足或传导阻滞者，减枳壳、柴胡、桔梗，加丹参30克、三七参10克（轧细末冲服）。",
            "【加减】心悸心跳、心慌气急者，加炒柏子仁10克、生龙骨30克（捣碎）、生牡蛎30克（捣碎）；动则喘息、咳嗽不已者，加阿胶10克、麦门冬15克。",
            "【加减】胸闷、胸痛串及两胁者，加川楝子、生乳香、生没药各10克，理气散瘀止痛；心悸怔忡者，加桂圆肉15克，阿胶、炙甘草各10克，增加阴液以宁心安神。",
            "【加减】心烦多汗者，加生龙骨、生牡蛎各30克（捣碎）；伴低热咳嗽者，加生石膏30克（捣碎），川贝母（捣碎）、知母各10克。",
            "【加减】发热甚，减龙骨、牡蛎，加连翘10克，生石膏加至60克；纳差者，加炒白术15克、鸡内金10克（捣碎）。"
          ]
        },
        {
          "jie": "第五节肾病方",
          "fangyao": [
            "【加减】浮肿甚，加大腹皮15克、猪苓10克，以增利水退肿之力；肺热甚，咽喉肿痛者，加金银花30克、连翘10克以清热解毒。",
            "【加减】伴畏寒肢冷者，加肉桂、制附子各6克以温补肾阳，助肾阳气化行水之功；腰痛甚，加山茱萸10克、怀牛膝15克以壮腰补肾；浮肿甚，加大腹皮、冬瓜皮各30克，利尿以增强肾脏气化之功。",
            "【加减】腰痛甚，加生山药30克；纳差乏力者，加炒白术15克、生黄茂30克、鸡内金10克（捣碎）。",
            "【加减】身体消瘦、体虚者，加党参15克以助黄芷益气排石之力；腰酸痛甚，加怀牛膝15克、玄胡10克。"
          ]
        },
        {
          "jie": "第六节身痛方",
          "fangyao": [
            "【加减】气虚者，加生黄芷30克、党参15克；寒甚者，加制附子6克。",
            "【加减】关节痛甚，川乌、桂枝加至20克，白芍、丹参加至60克；气虚多汗者，加生黄茂30克。",
            "【加减】腿痛甚，加川牛膝15克；上肢痛甚，加桂枝10克；湿盛，面色晦暗，苔白腻，加意菠仁30克、炒苍术10克。",
            "【加减】腰酸痛者，加炒菟丝子30克（捣碎）；小便短赤者，加盐黄柏、盐知母各6克。",
            "【加减】上肢痛甚加桂枝30克。"
          ]
        },
        {
          "jie": "第七节外感方",
          "fangyao": [
            "【加减】年老体弱者，加生山药30克。",
            "【加减】发热甚，加生石膏30克（捣碎），薄荷叶、连翘各10克；头痛甚，加葛根15克。",
            "【加减】大便干结不下者，加大黄10克；腮腺肿甚者，加瓜萎根30克。",
            "【加减】发热甚，体温超过38.01C者，加生石膏30克（捣碎）、连翘10克；口干、口渴者，加瓜萎根30克、知母10克；口干纳差者，加乌梅30克，焦山楂加至60克。"
          ]
        },
        {
          "jie": "第八节头痛方",
          "fangyao": [
            "【加减】伴头昏恶心呕吐者，合半夏天麻白术汤；头痛甚而热者，加生石膏30克（捣碎）以清入巅之热；伴胸闷头痛如锥刺者，加生桃仁、红花各6克。",
            "【加减】脚手麻木者，加当归10克以养血；头晕头痛者，加川萼、白芷、蔓荆子以止痛；伴纳差便澹者，加炒白术、陈皮健脾和胃。",
            "【加减】头痛甚、日久不愈者，加全蝎6克、大螟蚣3条；前额痛伴口干、口渴者，加生石膏30克（捣碎）。",
            "【加减】廣腹胀满者，加厚朴6克、陈皮10克；恶心甚，加生姜10克；呕吐甚，加代赭石30克（轧细）。"
          ]
        },
        {
          "jie": "第九节精神病方",
          "fangyao": []
        },
        {
          "jie": "第十节虚劳方",
          "fangyao": [
            "【加减】发热甚加金银花30克、连翘10克，石膏加至50克；咳甚加川贝母10克（捣碎）。",
            "【加减】纳差者，加炒白术15克、陈皮10克；痰涎壅肺者，加炒牛莠子10克（捣碎）、炙桑白皮10克。"
          ]
        },
        {
          "jie": "第十一节甲状腺方",
          "fangyao": []
        },
        {
          "jie": "第十二节消渴方",
          "fangyao": []
        },
        {
          "jie": "第十三节鼻鈕方",
          "fangyao": []
        },
        {
          "jie": "第十四节咽喉方",
          "fangyao": []
        }
      ]
    },
    {
      "zhang": "第三章男科",
      "jies": []
    }
  ]
})
</script>
  
<style lang="less" scoped>
#main{
  .zhangs{
    padding: 20px 30px;
    .zhang{
      font-size: 30px;

    }
    .jies{
      padding: 10px 30px;
      .jie{
        font-size: 20px;
      }

      .jiajians{
        padding: 10px 20px;
        .jiajian{
          font-size: 15px;
        }
      }
    }
  }
}
</style>
  