<template>

<b>
    第一章 

第一节调经方

例一 常某，18岁，1988年12月27日来诊。月经15岁初 潮，2~4月一行，3~4天净。经期腹痛下坠，色暗有血块，口 干口苦，伴午后潮热。平素小腹微微作痛，经期尤甚。刻下停经 4个月，食欲减退，面色萎黄，小腹部可触及一鸡蛋大小包块。 舌淡暗，苔薄白，脉沉细，取“通经散”加减。

例二 张某，29岁，1992年4月27日初诊。4年前正常分 娩，后未避孕而未孕。月经2〜3月一至，量少有血块，伴腹痛 乏力，经期尤甚。刻下停经两月余，舌红暗，苔薄白，脉沉弦。 予温经散寒，活血通经法调治，取“通经散”加减。

例三 单某，21岁，未婚，1987年5月31日初诊。月经 17岁初潮，2~3月一至，2~3天净，量多有血块，刻下停经3 个月，小腹隐痛，近20天反复鼻顔，舌红，苔薄，脉沉弦。

例一 刘某，19岁，未婚，月经14岁初潮，每于经期前两 天小腹微微作痛，经至疼痛加重，多处调治，疼痛时有减轻，终 未根除。半年来，经期小腹坠胀疼痛加重。昨天月经至，前来就 诊，面色萎黄，腹疼坠胀，伴恶心呕吐，舌淡有瘀点，脉弦，予 “痛经散”加减。

例二 代某，27岁，1年前受孕3月不慎流产，后月经过期 而至伴腹痛。

例三 王某，18岁，未婚，1997年10月18日来诊。据云： 月经初潮半年余，经期腹痛，经后小腹仍微微作痛，数日不止， 伴腰酸腿软。刻下值经后，舌淡，苔薄白，脉沉弱，患者冲任未 充也，予调经加补肾图治。

例一王某，25岁，1988年11月20日初诊。据云：产后  

例二 姚某，37岁，1987年12月29日初诊。自述患小腹 痛1年余，月经调，量多夹血块，腹痛下坠，右下腹尤甚，伴腰 酸痛，活动后加重。并反复发作尿急、尿频、尿痛，舌红，苔 薄黄，脉弦。此乃邪郁小腹，胞宫受累，气滞血瘀，邪瘀互结， 久而化热。予清热解毒、活血化瘀法调治。取“活血理冲汤”加 减。

例三 杨某，38岁，1987年12月18日初诊。据云：小腹 痛随经期而加重多年。月经错前落后，经色暗，夹血块，白带多 而腥臭，伴恶心呕吐，舌红苔少，脉沉弦。此乃邪郁胞宫，郁久 化热，湿热互结，白带乃成°胞宫受邪，扰乱月经。予清热利 湿、活血止痛法调治。

第二节求嗣方

例一 魏某，25岁，1995年12月18日初诊。据云：5年 前生一女婴，后月经基本正常，然未避孕而未孕。今天来月经, 舌红，苔薄白，脉沉弦。予“调经助孕汤”加减。

例二 饶某，22岁，1992年8月7日初诊。患者半年前受 孕3个月，不慎流产。后月经基本正常，但未受孕，小腹坠胀疼 痛，今天来月经，经色暗，有血块，小腹阵阵作痛，舌淡，苔 白，脉沉弦。

例三 李某，23岁，1992年7月30日初诊。自述：婚后2 年，夫妇同居未孕。曾多处求治未愈，反增纳差胀满，月经调， 量多、色暗，有血块，伴经期腹痛。刻下值经后，舌红，苔薄， 脉沉弦。（配偶精液常规检査：正常）

例一 蒋某，26岁，1987年12月29日来诊。据云：患者 5年前生一女婴，后未采取避孕措施而未孕。月经调和，小腹微 痛，腰酸腿软，伴头晕心悸。末次月经12月24日来潮，刻下值 经后,舌淡，脉弦。予调补冲任法调治，取“补肾助孕汤”加减。

例二 李某，22岁，1988年5月24日初诊。据云：婚后2 年夫妇同居未孕，月经：15岁初潮，30天一至，3〜5天净，量 一般，无血块。面黄纳差，伴腰膝酸痛，经期小腹坠痛，经后尤 甚。末次月经5月18日来潮，刻下值经后。舌淡苔白，脉沉弱。 （配偶精液常规检査：正常）

例三 韦某，25岁,1989年3月22日初诊。据云：婚后1 年余夫妇同居未孕。身体消瘦，面色萎黄，畏寒肢冷，关节疼 痛。末次月经3月12 0,色暗量少，刻下值经后。舌红尖甚, 脉沉弱。（配偶精液常规检查：正常）

例系一胎不育，于经后求治，一药而获效。5年未 育之沉府，先医必予产后瘀阻胞宫调治，而患者实与瘀阻无关 也。月经调和而腰酸腿软，实冲任亏虚之明征，故予填补冲任、 调补三阴而见奇效也。

例）； 经期腹痛，瘀血不下者，活之；经期乳房胀痛者，散之、理之。

例一 李某，26岁，1990年6月17日来诊。自述：3年前 产一女婴，至今未孕，月经调，量多，色暗有血块，无腹痛。刻 下月经净半月余，舌红，脉弦。

例二 万某，25岁，1989年11月1日来诊。据云：婚后2 年余，夫妇同居未孕（配偶精液常规检査：正常）。月经18岁初 潮，30天一至，有血块，小腹冷痛，带下多而腥臭，伴阴痛阴 痒，口渴，舌红，脉沉弦。

例三 李某，25岁，1992年7有30日来诊。据云：婚后2 年夫妇同居未孕（配偶精液常规检查：正常）。月经16岁初潮， 30-35天一至，4天净，量多，色暗有血块，伴小腹坠胀疼痛。 末次月经7月21日来潮。刻下值排卵期。舌红，苔薄，脉沉弦。 予“通任助孕汤”加减。

例一 单某，23岁，1989年5月31日来诊。据云：婚后2 年，夫妇同居未孕（配偶精液常规检査：正常）。月经：20岁初 潮，2~4月一至，2〜3天净，量少有血块。并反复发作鼻顔。 妇科检査：子宫发育不良，幼稚子宫。

例二 李某，28岁，1992年5月10日初诊。据云：婚后7 年夫妇同居未孕（配偶精液常规检查：正常）。月经半年或一年 一至，量极少，点滴而净；乳房扁平，性欲淡漠。妇科检查：幼 稚子宫o舌红，脉弦。

例一王某，27岁，1990年8月11日初诊。王氏婚后2 

例二 刘某，26岁，1991年9月25日初诊。刘氏夫妇一女 孩3岁，刻下值经期第二天。小腹冷痛下坠，经色暗，夹杂大小 不等血块，舌红，苔薄，脉沉。

例三 王某，30岁，1993年12月9日初诊。王氏婚后一女 孩6岁，后未避孕而未孕。月经调，经量少，色紫暗，有血块， 伴小腹坠胀疼痛，舌红暗，脉沉细。刻下值经期第三天。

第三节胎孕方

例一 李某，25岁，1988年8月10日初诊。患者受孕4个 月，于6天前出现腰酸腹痛，继而阴道流血，遂求治于西医某保 健医生，予输液止血安胎法治疗，症状未得控制，反而阴道流血 量骤增，8月10日下午求余会诊。患者面色統白，阴道流血不 止，腰酸、腹痛阵阵加剧，胎儿时刻有滑下之危。此乃气血虚弱 不能养胎，不慎胎动致流血也。塞流止血以治标，益气摄血、补 肾系胎以固本。

例二 朱某，27岁，1997年11月24日初诊。患者系姨兄 妹结婚，曾于1995年、1996年连续两次坠胎流产。刻下停经两 月余，恶心呕吐，舌淡红，脉弦滑。尿妊娠试验阳性。嘱：为确 保不再坠胎流产，应长期服用安胎之剂以系胎元，并服用补肾生 髓之剂以促胎儿发育。予“先天煎”加减，配丸药徐服。

例三 张某，27岁，1992年2月15日来诊。患者婚后均于 受孕3个月后，连续两次坠胎流产。刻下停经两月余，腰酸腹 痛，恐惧万分，经其姑母介绍来我处求治。患者身体尚可，腰酸 痛，纳差呕恶，舌红，苔少，脉沉滑。予健脾益气、补肾安胎法 调治。

例一 秦氏，23岁，1988年5月3日初诊。患者素往月经 调和，刻下停经50天，胃廣胀满疼痛，恶心呕吐十余天，加重 两天余，伴神志恍惚，经当地中西医治疗，其效不显。刻下胃胱 压痛，口干渴，纳差呕吐，舌淡，苔白，脉缓。此乃脾胃虚弱， 胎气夹中气上逆，故胃胱胀痛而呕恶也。

例二 张某，21岁，1987年8月5日初诊。患者停经40 天，恶心呕吐，时小腹微痛，舌红尖甚，苔少，脉滑。

例三 牛某，39岁，1989年5月6日来诊。据云：患者10 年前生一女婴，后屡孕屡坠。刻下停经45天，尿妊娠试验阳性。 呕吐泛酸剧烈，茶水难以下咽，伴心悸，神疲乏力，小腹微微作 痛，舌淡红，苔白，脉弦滑。	-

例一 吴某，24岁，1988年4月30日初诊。自述停经两月 余，尿妊娠试验阳性。刻下恶心呕吐，口干、口苦并时泛酸水， 

例二 杨某，22岁，1990年3月20日初诊。患者结婚半年 余，刻下停经40天，尿妊娠试验阳性。时小腹坠胀疼痛，纳差， 恶心呕吐，泛酸，两胁胀满，舌红，苔薄，脉弦滑。

例三 杨某，26岁，1989年11月18日初诊。患者婚后一 年余，月经调，刻下停经两月余。面色萎黄，恶心呕吐，口吐酸 水，纳差低热；伴腹痛下坠，腰膝酸软，尿妊娠试验阳性，舌淡 红而胖，脉沉滑。

例一闻某，31岁，1992年2月22日来诊。患者怀孕4月 余，妊娠后反复小腹微微作痛，服中西药腹痛未止，近日加重, 伴胀满下坠，舌红，苔薄，脉沉滑，此乃气血虚弱不能养胎之故 也。

例二 杨某，23岁，1990年3月31日来诊。据云：患者结 婚半年余，刻下受孕两月。纳差呕吐，伴神疲乏力，小腹时时坠 胀疼痛，舌淡红，苔薄白，脉沉弱。

例三 徐氏，26岁，1989年4月29日来诊。患者停经3月 余，恶心呕吐，口吐清涎，纳差乏力，小腹坠胀微痛，舌淡红, 脉滑。

例一 李某，25岁，受孕3月后，因感冒风寒，喉痒咳嗽。 刻下喉痒，咳痰不爽，伴胸胁胀满，舌红，苔薄白，脉滑。此乃 风寒袭肺，肺失宣发也。予“安胎子嗽饮”加减。

例二 秦氏，26岁。据云：受孕7个月，两月前因感冒未 愈，频发咳嗽，伴两胁胀满，大便干结，时发鼻峋，舌红，苔 少，脉滑有力。此乃胎孕煎熬阴津，阴虚肺失濡润，虚火内生， 上灼肺津，故发鼻顔与咳嗽不止。肺与大肠相表里，肺阴虚，清 肃无力，故大便干结也。予养阴润肺、止嗽安胎法调治。

例一李某，30岁，受孕8个月，咽喉肿痛，舌红、边起芒 刺，口干渴而少津，脉弦滑有力。此乃心火炽盛，阴津受损，火 热炎上。《内经》云：“火曰炎上。”取“清热安胎饮”加减服之。

例二 张氏，23岁，受孕9个月，即近临产，因感冒而发 咳嗽。近反复鼻顔，大便干结，舌红绛少苔，脉弦滑。

例三刘氏，43岁，因输卵管粘连多年不孕，反复多处求 治，幸受孕。

例一 我族侄媳，27岁，怀孕7月余。B超检查：胎儿横 位。妇产科医生用艾条灸双侧至阴穴，并施扒卧法1日2次，越 旬日，复B超探査：胎儿仍横位。服上方3剂，自觉胎儿动甚， 药尽胎安。复B超探査：胎位已正。

例二韦氏妇，怀孕7月余，B超探査:胎盘偏位，胎臀 位，忧恐甚。亦予转胎良方服3剂，复B超探查：胎位转正。

例不效，愿我同道可试用不 妨也。然当今之世，医遇产妇胎位不正者，剖腹产者多矣，不知 服药亦能矫正胎位，亦可免手术痛苦之忧也。

第四节崩漏方

例一 李某，47岁，1989年9月18日来诊。据云：月经素 往尚调，然近年来超前落后，经量时多时少。近阴道流血，淋沥 不净两月余，前医诊为“更年期宫血”，予输液治疗，其效不显。 近两天暴下不止，面色觥白，伴头晕心悸，舌淡，苔薄，脉沉 弱。予“固冲止崩汤”加减。

例二 郭某，25岁，1989年8月31日来诊。据云：产后月 余，恶露未净。近两天阴道流血大增，色淡，无血块，伴头晕心 悸，口干、口渴，舌淡苔白，脉沉弱无力。

例三牛氏，44岁，1991年1月29日来诊。自述：阴道不 规则流血20余天，伴头晕乏力，腰酸腿软。初则夹豆壳大小血 块；近两天流血色淡，大下不止。予输液止血法治之，症状未能 控制，舌淡，苔薄，脉沉弱。予“固冲止崩汤”加减。 

例二 张某，36岁，1988年元月25日初诊。据云：受孕两 月余，于元旦做人工流产，至今流血不止。质涩黏无血块，腹痛 不休。10天前曾一度大出血，经治疗好转，昨日流血增，舌淡， 脉沉细。

例三 朱某，25岁，1991年10月10日初诊。患者3月前 分娩，母子无恙。然产后恶露不多，淋沥不止，至今未净，小腹 微微作痛，伴神疲乏力，舌淡，脉沉细。此乃产后恶露下而不 畅，滞留胞宫，新血不生，故流血量少而不止也。

例一 王某，21岁，未婚。1987年5月27日初诊。据云: 月经16岁初潮，每次经期较长，经量多，曾发血崩服中药而愈。 近阴道流血时多时少两月余，反复就诊县医院而罔效。病情重 笃，束手待毙，检：红细胞135万/mn?,白细胞13 500/mm3, 血色素4.4克。面色觥白光亮，极度贫血面容：头重脚轻，声音 低微，神疲懒言，口干、口渴，不发热，下肢时现紫瘢；阴道流 鲜血而色淡，舌淡胖，脉细弱。此乃冲任虚弱，脾失统摄，拟益 气摄血、固涩止漏法，取“引血宁宫汤”加减，以观动静。

例二 饶某，26岁，1988年12月3日诊。自述：产后两月 

例三 柳某，48岁，1990年5月4日来诊。据云：近年来 月经不调，超前落后，经量多，时半月一至。上次月经十余天方 净，刻下值经期第二天，量特多，面色萎黄，伴头晕，体倦乏 力，舌淡，苔少，脉虚大无力。

第五节带下方

例一刘某，42岁，1990年3月13日初诊。据云：近2年 白带增多，稠黏而色白，伴纳差，胃胱胀满，面色萎黄，头晕乏 力，腰酸腿软，舌淡瘦，脉沉细。予“健脾止带汤”加减。

例二 李某，30岁。据云：平时畏寒，不能食凉物，稍食 凉物即呕吐，伴胃踪胀满疼痛。近半年来，白带增多，质地清 稀，伴腰酸腿软，面色萎黄，便澹、日二行，舌淡胖，脉沉缓。 予“健脾止带汤”加减。

例三 李某，48岁。据云：经断1年余，然仍带下甚多, 质清稀色白，面黄而虚浮，纳差胀满，神疲乏力。B超探査：子 宫未见异常。舌淡胖，脉沉缓。

例一 杨某，43岁，1988年3月20日初诊。患者近半年来 白带增多，质黏色白，腥臭，腰酸腿软，腰熊部疼痛；伴臆腹胀 满，两胁串痛，心烦易怒，稍食油腻必便澹，舌淡，苔薄白，脉 沉弦。此乃肾虚不能固摄，水亏不能涵木，故带下增多而胁痛。 予“固肾止带汤”加减。

例二 张某，23岁，1996年4月20日初诊。据云：婚后1 年余，夫妇同居未孕（配偶精液常规检查：正常）。月经基本正 常，唯经期腰痛如折，小腹冷痛，腰酸腿软，带下清稀，色白而 量多；纳差，面色觥白，神疲懒言，伴头昏耳鸣，舌淡，脉沉 弱。予“健脾止带汤”加减。

例三 姚某，30岁。据云：7年前产一女婴，后未孕。妇科 检査：输卵管通畅，白带多，子宫内膜炎症。刻下：面色萎黄， 带下清稀量多，腰酸痛，夜梦纷纭；伴头晕耳鸣，纳差，便澹， 舌淡，脉沉弱。

例一李某，42岁，1989年1月2日来诊。自述：白带多 而腥臭半年余，多处治疗，时轻时重，效果不显。近头晕乏力， 腰酸腿软，腹痛下坠；伴头痛，胃廣不适，舌红，苔少，脉沉 弦。予“清热止带汤”加减。

例二 李氏妇，70岁，1988年12月21日初诊。自述：近 半年来阴道不规则流脓血性分泌物，腥臭异常，时多时少，小腹 胀痛；伴低热，纳差，四肢乏力。近日带下增多。B超探査：子 宫未见肿块。提示：盆腔炎症。舌红，苔少，脉弦数。

例三 李某，19岁，未婚。据云：月经近半年来推后而至, 量少色淡；带下多，清稀而色黄；面色萎黄，纳差乏力；伴腰膝 酸软，舌淡，苔薄，脉沉弱。此乃冲任未充，脾胃虚弱，运化失 司，湿热内蕴，遂成带下。

第六节产后方

例二 刘某，43克，1996年6月10日来诊。患者原患输卵 管粘连，四旬后方得治愈而孕育。刻下产后6天，小腹胀痛，恶 露点滴而下，时有时无，伴呕吐、发热、口干渴、头痛；舌红 暗，苔白，脉弦涩稍数。

例三秦氏妇，23岁，新产一天余，小腹微微作痛，余无 不适。嘱予“新加生化汤”服之，以预防产后诸症。

例一 韦某，30岁，1991年12月2日来诊。据云：产后月 余，恶露不绝，小腹微痛，头晕，神疲乏力，大便干结；近午后 潮热，乳汁减少，舌淡红，苔少，脉沉弱。此乃产后伤血，气血 亏虚，运化无力，不能摄血，致妄行而恶露不绝也；失血过多， 津亏液损，乃大便于结；正气虚，外邪相袭，故发热也。

例二 王某，25岁，产后月余，恶露不绝，前医曾予止血 并输液治疗，其症不减。刻下面色萎黄，神疲乏力，恶露时多时 少，舌淡，脉沉弱。予“益气排恶汤”加减。

例三 张某,30岁，患者产后20天，恶露不绝，时夹鲜 血，曾服中西药而罔效，求治于余。刻下患者面色萎黄，神疲乏 力，恶露不绝，伴小腹压痛，舌红，苔薄，脉沉细。予“益气排 恶汤”加减。

例一 洪某，28岁，1988年9月2日就诊。患者于1988年 6月20日分娩。产前产后多食蛋肉膏粱细食；产后恶露月余方 

例二 张某，21岁，1989年8月16日初诊。患者产后40 天，产后多汗，口渴多饮，恶露至今未净。分娩后尽食蛋鱼细腻 之物，大便干结，三四日一行，并带鲜血。近纳食减少，身体虚 浮，舌红，苔少，脉沉弦。

例三 李某，25岁。据云：产后6月余，大便一直干结难 下，并时夹鲜血，常服“果导片”或外用“开塞露”以助大便通 下，痛苦不堪；伴口干、口渴，舌红，苔白，脉弦。予“健脾通 便汤”加减。

例一牛某，28岁，分娩后月余。乳汁初则尚可，稍佐奶 粉，婴儿可饱食，然近日乳汁渐少，双乳房松软，乳汁缺三分之 二；纳差，舌淡；脉沉弱。

例二 李某，29岁，1995年9月4日初诊。自述：产后20 天，乳汁渐少，两乳房松软，伴面色觥白无华，心悸气短，神疲 乏力，舌淡，苔薄白，脉细弱。

例一 王某，28岁，本院职工。产后20天，因琐事与人争 执，后乳汁渐少，乳房胀硬而痛，胁痛纳减，神情郁郁不乐，舌 暗，苔薄黄，脉弦数。

例二 牛某，女，26岁，1989年4月23日就诊。据云：分 娩时不顺，分娩后郁闷不乐。刻下产后4天余，乳房胀痛，乳汁 点滴而下，小腹坠胀阵阵作痛，两胁胀满，纳食少；恶露下之甚 少，舌暗，苔白，脉弦涩。

例一 张某，26岁，1998年6月27日来诊。据云：产后 40天，近两天发热，伴右侧乳房红肿胀痛，触之热甚。测体温：

例二 王某，23岁，产后20天，右侧乳房红肿热痛1天 余，乳汁下之甚少，恶寒发热，脉弦有力。嘱：用手从乳房根部 向乳头部缓慢挤压，渐流下黄稠乳汁半碗余，乳房变软，继服中 药。

第七节妇科杂症方

例一 李某之妻，48岁，月经量多，淋沥10余天方净，已 达1年之久。刻下月经刚至，予“引血宁宫汤”加血余炭，服3 剂血止。嘱B超探査，子宫内果然探及一如桃大小肿块。予 “代刀化癥丸”服之。越两月，月经来潮，经水正常。经后B超 再探：子宫大小正常，未见肌瘤肿块。

例二 李某，25岁，1993年3月5日初诊。据云：婚后2 年，1年前受孕3月堕胎，郁闷成疾，初月经量渐少，继月经二 三月一至。近半年月经未潮，食欲不振，身体羸弱。伴寒热往 来，小腹坠胀疼痛。舌淡暗，有瘀点，脉沉细无力。此乃气滞血 瘀，侵成虚劳。刻下予扶正，佐以理气散结化瘀法调治。

例三 韩某，女，36岁，1998年5月10日初诊。据云：半 年前生一女婴，产后恶露所下甚少，初未介意，弥月后渐觉小腹 胀痛，时值春节，未就诊服药。又迟月余，胀痛有增，当地医生 以消炎止痛处理。延至月余，腹痛处甚硬，触有包块。刻下产后 已半年，乳汁减少，月经未潮，面色觥白，精神萎靡，舌淡暗有 瘀点，脉沉弦。嘱：B超探查，子宫内探及一 8cm X 8cm肌瘤。 鉴于身体不佳，首予扶正，佐以驱邪法调治。

例一 杨某，27岁，1998年4月13日初诊。患者两乳房均 有柿饼大小肿块，触之痛甚；伴嗝气，两胁胀满，心烦易怒，舌 红，苔薄白，脉沉弦。

例二 赵某，45岁，两乳房均有核桃大小肿块，触之痛甚, 多次服药罔效。刻下乳房胀痛牵引腋下，伴两胁胀满疼痛，舌 红，苔薄，脉弦。

例三 王某，40岁，1993年4月12日初诊。患者两乳房结 节肿块半年余.多处求治，其症不减。刻下两乳房可触及杏核大 小不等硬结多枚，触之痛甚，舌淡暗，脉沉弦。

例一李某，教师，36岁，两侧乳房肿块如柿饼大，胀痛 牵引两胁，曾服“乳安片、逍遥丸”均未见明显好转。刻下内服 “郁癖丹”，外贴“乳腺增生膏”，月余双侧乳房肿块消无芥蒂。

例二 郭某，学生，18岁，双侧乳房硬结，可触及多个红 枣大小硬块，月经期胀痛加重。苦于服药，予“乳腺增生膏”外 贴，连贴两张（一张可贴10天左右），乳房肿块消无芥蒂，后月 经来潮，乳房亦无胀痛矣。

例一 张某，46岁，1995年7月1日初诊。自述：月经两 月未潮，心烦易怒，五心烦热，面红耳赤；测血压与体温，均属 正常；舌红，苔薄，脉弦。

例二 刘某，50岁，1992年4月1日初诊。据云：近两年 来，月经三个月或半年一至，量时多时少，伴腰酸腿软。近两月 夜梦纷纭，烘热汗出，自觉发热，测体温正常，伴头晕耳鸣，舌 红，苔薄，脉弦细。

例三 饶某，女，52岁，1991年1月8日初诊。患者身体 丰腴，月经至今仍按月来潮。近年来，心烦易怒，哭笑无常。多 方治疗其效不显。近因心情不舒，病情加重。自述：心烦易怒， 脱腹满闷，呕恶痰涎，伴头晕耳鸣，健忘失眠，舌红暗，脉 沉弦。

例一 王某，46岁，1990年5月9日来诊。患者小腹坠胀 疼痛，压痛明显，衣侧尤甚。B超检査：诊断为“左侧输卵管炎 症、盆腔炎”。反宣服药，疼痛可暂时缓解，停药疼痛复作。近 小腹坠胀疼痛，加重5天余，伴恶心呕吐，胃院疼痛，舌红，苔 薄，脉弦。

例二 刘某：31岁，1992年4月15日来诊。患者小腹坠胀 疼痛多日，反复务次求治，均未见明显好转。近日带下增多，色 黄腥臭，阴道灼痛，伴尿急、小便涩痛，舌红，苔薄黄，脉弦滑。

第二章内 科

第一节胃病方

例一 牛某，男，58岁，1991年10月12日初诊。据云： 胃腕牵引小腹痛两月余，曾多处求治，其效不显。刻下胃廣疼痛 伴两胁胀满，夜晚尤甚，舌红，苔白，脉沉弦。胃肠飢餐透视提 示：慢性胃炎，十二指肠炎。予“胃痛效灵丹”加减，水煎服。

例二 吕某，男，54岁，1987年7月3日初诊。自述：胃 胱痛多年，反复治疗，其效不显。刻下身体消瘦，面色萎黄，纳 谷不香，大便澹薄；每食凉物，胃胱疼痛加重。胃肠彻餐透视提 示：胃溃疡及十二指肠炎症。舌淡，苔白腻，脉沉弱。此乃脾胃 虚弱，寒邪犯胃。予温胃健脾、理气止痛法调治。

例三 蔡某，男，43岁，1988年7月2日初诊。据云：患 者胃胱痛10年余。刻下剑突下右侧压痛尤甚，固定不移，时呈 刺痛，伴纳差胀满，暖气，大便灰黑，每食凉物疼痛加重，舌淡 胖，脉沉弱。此乃虚寒胃痛，久痛入络。予温胃止痛、理气活血 法调治O

例一 常国友，男，49岁，1988年9月19日初诊。据云： 胃脱痛10余年，加重8天余。曾多次求中西医治疗，宿疾终未 得愈。疼痛常夜晚加重，不能食凉物，揉按或进食疼痛缓解。刻 下胃廣疼痛，口干、口苦，胀满嗝气。

例二 王某，男，59岁，1987年7月31日初诊。据云：胃 廣疼痛半年余。刻下胃席热胀疼痛，偏左尤甚，拒按，疼痛固定 不移；柏油样大便，纳差，口苦、口涩，舌淡暗，苔薄黄，脉沉 细。此乃脾胃郁热，久痛入络。予舒肝和胃、活血止痛法调治， 取“益胃效灵丹”加减。水煎服。

例三 陈宝法，男，44岁，1988年8月9日初诊。据云： 胃脱痛10年余，饿时尤甚，曾反复服中西药治疗，其效不显， 特来中医科求治。刻下面色萎黄，叹息，嗝气频作；胃廣压痛, 偏右尤甚；每食凉物，疼痛加重；多食则反胃吐出。刨餐透视提 示：十二指肠炎、十二指肠球部溃疡。舌淡，苔薄白，脉缓。

例一 张某，女，57岁，1988年9月5日初诊。自述：胃 廣痛伴泛酸呕吐、胃气上逆10年余，反复服中西药罔效。胃镜 检査提示：浅表性胃炎，胃小弯溃疡。刻下胃脫胀满，嗝气频 作，胃胱微微作痛，时呕吐清水或食物，口干涩乏味，舌淡苔 白，脉沉弦。此乃胃失和降，取“和胃降逆汤”加减。

例二 秦氏，女，41岁，1988年1月8日初诊。据云：胃 脱痛，恶心，呕吐，伴呕血反复发作，多年不愈。畏寒不能食凉 物。近日胃脱痛、恶心、呕吐加重，舌淡苔白，脉沉细。

例三秦某，男，56岁，1995年6月27日初诊。据云：胃 廣痛伴嗝气、呃逆半年余。胃镜提示浅表性胃炎，胃窦部憩室。 近呃逆、呕吐加重，不能进食，两胁胀满，大便干结，舌红，苔 白腻，脉弦滑。

例一 李某，女，39岁，1991年8月1日初诊。患者胃廣 痞满疼痛多年，常服西药终未得愈，特来中医科诊治。刻下面色 萎黄，胃胱胀满疼痛，伴恶心呕吐，纳差便澹，自觉胃廣凉甚， 稍进寒凉，即呕恶不止。舌淡苔白腻，脉沉弱。予“温胃理中 汤”加减。

例二 张某，男，44岁，1991年8月5日初诊。患者体质 素虚，稍受寒凉，或稍食生冷，即发胃脱疼痛。三伏炎夏，亦不 能食点滴寒凉之物。胃脱胀满，水饮停滞中焦不下。反复多次服 药，胃胱痛及饮邪终未得除。刻下胃胱胀满，触压痛甚，面黄而 晦暗，胃廣停饮，漉漉有声，纳谷欠佳，伴头重头昏，舌淡苔 白，脉沉弱。予“温胃理中汤”加减。

例三 郝某，男，37年，1987年7月1日来诊。据云：1 年前时值炎暑，劳累后暴饮冷水（连续约饮7碗之多），后即感 胃廣胀满，时隐隐作痛，伴恶心呕吐，头昏心悸；每食凉物加 重，曾多方求治，其效不显。刻下食欲减退，面色萎黄，胃院胀 满疼痛，恶心呕吐，头昏头重，困乏倦怠，口黏乏味，舌红，苔 黄腻，脉沉弱。此乃暴饮冷水，脾胃受损，运化失常，湿困中 焦，上损胸阳，宜温中化湿、健脾和胃法调治。

例一 顾某，男.54岁，1989年5月31日初诊。据云：患 者胃廣痛半年余。刻下胀闷疼痛，进食后尤甚，伴口黏、口苦， 大便澹薄，舌红，苔白腻，脉沉弱。倒餐透视提示：胃下垂。

例二 王某，男,34岁，1991年12月28日来诊。患者胃 腕胀满疼痛，自觉胃中发热，饭后胀痛加重，口干口苦，伴失眠 耳鸣，舌红，苔白，脉沉弱，刨餐透视：II度胃下垂。此乃中气 虚弱下陷，运化失司，予“益气和中汤”加减。

例三 陈氏，女，30岁，1995年8月10日来诊。患者颜面 及下肢轻度浮肿，面色萎黄，少气乏力，伴纳差，大便澹薄。心 电图及尿常规检査：均属正常。细寻病情：胃脱满闷而痛，稍进 寒凉，胃胱胀痛加重，舌淡苔白，脉沉弱。

例一李某，男，40岁，患牙痛病，反复发作，刻下牙痛 伴牙龈肿胀，牵引头痛；口臭，大便干结，小便短赤。曾服西药 并注射青霉素均无效验。舌红，苔黄腻，脉弦滑。

例二 张某，女，40岁，每于月经期必发头痛、牙龈肿胀。 鉴于经期，医多予活血止痛，佐以清热除风治之，未敢投过于寒 凉之剂，故病终未得除。刻下月经来潮，牙龈肿痛，艰于饮食, 舌红，苔黄腻，脉弦滑。

例一 陈某，男，71岁，1990年3月7日初诊。据云：胃 廣痛月余，加重10余天。刻下廣腹胀满，纳差呕吐，大便干结， 剑突下偏左可触及一鸡蛋大小包块；压痛明显。空腹刨餐透视： 胃窦部有一 3cmX 4cm肿块。提示：胃窦部恶性肿瘤。舌红，苔 黄腻，脉沉弦。予活血化瘀、和胃止痛、消肿散结法调治。

例二韩某，男，68岁，1987年12月18日初诊。据云： 胃廣痛反复发作10年余，曾多次服药，虽暂时缓解，宿疾终未 根除。刻下面色萎黄，身体消瘦，胃胱疼痛无明显规律。口干少 津，并反复呕吐黏涎；大便干结，三四日一行，胃胱剑突下左旁 可触及一鸡蛋大小包块，胃廣脐上亦可触及一包块。B超探査： 胃窦部约3cmX3cmXlcm大小肿块，働餐透视提示：胃窦部占 位，胃下垂。舌红，苔白腻，脉弦。

例三 李某，男，55岁，1988年4月10日初诊。患者于3 月前自觉咽中不利，渐感吞咽受阻；1月后不能吞咽硬食，赴省 肿瘤医院检查：诊断为“食道中段占位”。收住院治疗。医院给 予放疗月余后，自觉症状缓解，遂出院。近十天感吞咽困难，每 日只进流汁饮食。经介绍求余诊治。刻下身体消瘦，午后潮热， 大便干结，舌红绛无苔，脉虚大无力。

第二节泄泻方

例一 杨某，女，31岁，1995年10月6日来诊。据云：大 便澹薄伴腹痛，一日二行或三四行3年余，曾反复服中西药并行 中药煎汤灌肠术，时轻时重，终未痊愈。刻下腹泻伴腹痛加重 10余天，一日三四行。自觉小腹凉甚。即时值炎暑，稍食寒凉， 腹泻加重。舌淡胖，苔薄白，脉沉缓。

例二杨某，男，37岁，1992年8月25日初诊。患者腹泻 半年余，一日二行或三四行，伴肠鸣腹痛；大便夹风沫及不消化

例三 饶某，女，60岁。据云：患慢性腹泻近40年，恙起 于I960年产后，因灾荒年贱，食不果腹，新产之妇，气血空虚, 寒邪相袭，遂发泄泻，积年累月，身体消瘦，大便日三四行，常 完谷不化，稍食凉物，泄泻加重，多处求治，宿疾未除。刻下身 体消瘦，大便澹薄，日三四行，舌淡有齿印，苔薄白，脉 沉弱。

例一 张某，男，30岁，1996年10月13日初诊。患者腹泻 伴腹痛10年余。虽在壮年，面色觥白，稍食寒凉，胃廣闷痛，呕 恶不止，腹泻加重，即使炎暑，瓜果生冷亦难近尝。反复服中西 药，旋愈旋复。刻下小腹伴胃臆疼痛，大便澹薄夹黏液及风沫, 日三四行。大便常规检査“无异常”。舌淡红，苔白，脉沉弱。

例二 吴某，女，38岁，1987年7月26日初诊。患者腹泻 10年余，反复服中西药，其效不显，刻下体弱面黄，大便澹薄, 日三四行，每天早晨腹痛必便，伴灼肛，廣腹满闷，纳谷不香, 时有完谷不化，舌淡苔白，脉缓。

例三李某，女，50岁，患慢性腹泻1年余。多次求治县 及地方医院，时轻时重，终未痊愈。刻下身体消瘦，畏寒肢冷， 面色萎黄；大便日三四行，时夹不消化完谷；小腹冷痛，热敷则 舒，舌淡苔白腻，脉沉弱。

例一 袁某，女，29岁，1992年8月10日初诊。患者腹痛 伴腹泻半年余，大便一日二三行或四五行，纳差胀满，腹痛便 急，进冷食及油腻均加重，舌淡苔白，脉沉弱。

例二 朱某，女，44岁，1993年2月25日初诊。患者腹痛 腹泻多年，反复多处求治，效果不佳，近日加重，一日三四行， 便急有时不能入厕，伴腹痛下坠，舌红，苔白，脉沉弦。

例三 柳某，女，53岁，1993年8月28日初诊。患者面色 萎黄，体质消瘦。患腹泻20余年，日二三行，重时五六行，夹 黏液白冻，小腹疼痛，绕脐压痛尤甚，舌淡苔白，脉沉弱。

例一 '张某，“男，62岁。1990年8月18日诊。患者大便澹 薄，继则夹杂水便4天余，日四五行，腹痛下坠，服西药兼输液 症状不见缓解，前来中医科诊治。患者素有慢性支气管炎、肺结 核病，身体羸弱，纳差，腹痛，舌淡，脉缓。

例二李某，男，60岁，患腹泻两天余，一日五六行，伴 恶心、呕吐，舌淡，脉缓。

例三郝某，男，40岁，患者呕吐伴腹泻两天余。据云：3 天前食生冷食物较多，继而胀满呕吐，伴肠鸣腹泻。曾输液，呕 吐止，仍便清，日三四行，伴腹痛下坠，舌淡，脉缓。予“健脾 止泻汤”加减。

例一韦某，男，69岁，1987年5月19日诊。患者素有 “慢支”病史，近两天大便夹脓血，日数行，纳差，腹痛，舌淡 红，苔白腻，脉滑。

例二 张某，男，17岁。1991年2月22日诊。患者大便夹 黏液及血丝一月余，伴小腹疼痛，多次服药并输液治疗，终未得 愈。刻下脓血便，一日三四行，小腹坠痛，舌红，苔薄黄, 脉弦。

例三秦某，女，45岁，1987年7月22日初诊。患者红白 痢疾一周余。当地诊所予输液等法治疗，脓血减少，大便仍日十 余行，夹杂少量脓血。刻下不发热，纳差，腹痛，舌淡苔白，脉 沉缓。此乃邪毒渐退，肠胃不实，余邪未尽，予厚肠止痢、健脾 止泻法。

例一 李某，男，56岁,1995年12月19日诊。患者红白 痢疾两天余，日十余行，腹痛下坠，里急后重，伴尿血。输液及 服西药治疗无效。舌红，苔白，脉弦。

例二郭某，男，48岁，1994年9月20日诊。患者红、白 痢疾3天余，日七八行，发热，测体温38X3,纳呆，腹痛下坠， 里急后重，舌红，苔薄黄，脉弦滑。 

例三 杜某，女，35岁，1990年10月2日初诊。据云：脓 血大便4天余，日20余行，曾输液治疗，其效不显。刻下发热， 测体温37.51,大便灼肛，腹痛下坠，里急后重，口干、口渴， 舌红暗，苔薄黄，脉细数。

第三节肝胆方

例一 杨某，女，41岁，1995年2月24日初诊。自述：素 有“慢性胆囊炎”症，近胁痛加重，伴胃脱胀满疼痛，嗝气，大 便干结，头晕目眩，舌红，苔薄，脉弦。予“疏肝利胆汤” 加减。

例二 姚某，女，30岁，1997年5月19日初诊。患者素有 胃廣痛病史，近因情志不遂，发两胁胀痛，呕恶泛酸，纳谷不 香，大便澹薄，舌红，苔白，脉弦。肝胆B超提示：慢性胆囊 炎症。

例三 郭某，女，39岁，1989年5月18日初诊。据云：患 者胁痛多年，反复服中西药其效不显，经介绍来诊。刻下两胁胀 痛，随劳累及情绪波动而加重，伴心烦易怒，嗝气叹息，厌油 腻，小便短赤，大便干结，舌淡红，苔薄白，脉沉细。肝胆B 超探査：慢性胆囊炎症。

例一 刘某，女，35岁，1991年10月15日初诊。患者胃 胱痛伴两胁胀痛3月余。纳差叹息，心烦不寐，大便干结，厌油 腻，舌红，苔少，脉沉弦。' 此乃气滞肝郁也。予“疏肝解郁汤” 加减。

例二 李某，女，47岁，1990年2月16日初诊。患者上腹 串痛及两胁痛半年余，加重7天。刻下胃踪胀闷，两胁献痛，嗝 气叹息，口干涩而苦，纳差，大便干结，小便短赤，舌红暗，脉 沉弦。

例三 饶某，男，37岁，1990年1月10日初诊。患者两胁 胀满疼痛伴纳差1年余。刻下身体消瘦，面色萎黄，两胁胀满； 右肋下肝脏可触及约3cm,压痛明显；心烦乏力，午后潮热，小 便短赤，舌红暗，苔白，脉沉弦。B超探査：肝脏肿大。检肝功 能：正常。

例一 高某，男，58岁，1993年5月25日初诊。患者两胁 胀满，胃廣压痛半年余，曾多次服疏肝理气之药，其效不显，刻 下胃胱伴两胁胀满，纳差乏力，嗝气，舌红暗，苔白腻，脉弦 滑。肝胆B超探査：未见异常。

例二 王某，男，42岁，1987年12月19日初诊。据云： 廣腹胀满，午后尤甚，伴发热、口干、口渴，纳差，小便短赤； 右肋压痛明显，并可触及肿大肝脏。舌淡红，苔黄腻，脉弦。

例三 韦某，男，49岁，1987年3月15日初诊。据云：患 者腹胀伴胁痛3年余。B超提示：肝脏肿大。肝功能提示：慢性 迁延性肝炎。经多方调治，其效不显，近日加重，来我院求治。 刻下面色晦暗，全身微浮，巩膜黄染；口苦咽干，纳差便清，腹 胀暖气；四肢乏力，午后潮热，夜不安寐；舌淡，苔黄腻，脉 缓。此乃肝气郁结，肝脾不和，治疗失误，脾胃受损，运化失 常，水湿停滞，故现诸症。宜疏肝理气、健脾和胃、运化水湿之 法调治。

例一姜某，女，35岁，1992年9月3日来诊。患者胃腕 痛伴两胁胀痛两月余，多次服中西药其效不佳，遂来我院中医科 诊治。患者胃脏疼痛牵引两胁，压之尤甚，胀满暖气，舌红，苔 白，脉弦缓O

例二 朱某，男，26岁，1990年4月1日初诊。据云：胃 胱胀闷疼痛串及两胁一月余。刻下胃廣压痛，两胁胀满，心烦嗝 气，口干口苦，舌红，苔薄黄，脉沉弦。

例三 韩某，男，24岁，1988年1月29日初诊。据云：胃 廣胀痛多年，半年来逐渐加重。刻下胃廣牵引两胁胀满而痛，右 侧叩痛明显，剑肋下可扪及肿大肝脏。纳差，大便干结，午后潮 热，心烦，口干、口苦，胃廣饿时痛甚，食后稍舒，舌红，苔 薄，脉弦细。肝功能正常。肝胆B超提示：肝脏肿大。飢餐胃 肠透视：胃小弯处溃疡，十二指肠炎症。此乃肝胃不和，肝胃同 病，取“疏肝和胃汤”加减。

例一 杨某，男，47岁,1987年3月31日初诊。患者于 10年前因长期发热不退，伴胀满胁痛，检查发现“慢性迁延性 肝炎”。后多方调治，症状时轻时重，终未得愈。近因过度劳累， 病情加重，两胁胀满，低热不退，遂来我科诊治，患者面色晦 暗，微浮，腹大青筋显露，纳差，肝区压痛；口苦咽干，小便短 赤，大便澹薄，身热乏力，测体温38.0X3,脉率90次/分，舌 红，苔白腻，脉弦数。B超探查：肝脏肿大。此乃肝木抑郁，脾 土失疏。予“健脾保肝汤”加减。

例二 陈某，男，38岁，1989年3月13日初诊。患者两月 前患“肠梗阻”，曾手术治疗。近因感冒伴胁痛复入院诊治，用 药一周，其效不佳，遂来中医科诊治。患者面色萎黄，体质较 差，两胁胀满，纳谷不香，伴神疲乏力，腰酸头昏。自一月前感 冒至今，低热不退，舌红，苔白腻，脉沉弦。B超探査：肝脏肿 大。肝功能提示：慢性肝炎。脾为后天之本、生化之源。首予健 脾培本法图治。取“健脾保肝汤”加减。

例三牛某，女，72岁，患者胃廣串痛及两胁疼痛多年； 伴胀满，纳差乏力；体质稍瘦，午后潮热，小便短赤，大便干 结；右肋下可触及肿大肝脏。舌淡红，苔薄，脉弦。B超提示： 肝脏肿大，肝硬化。肝功能提示：慢性肝炎。此乃肝木疏泄失 常，血瘀于肝，互为因果，致成重疾。因其年高，攻邪尤恐体弱 不支。拟健脾保肝、扶正攻邪法调治。

例一谢氏妇，60岁。据云：素有肝疾，多处求治未愈。 因年高孀居，孤独悲哀，改嫁谢某，儿媳不欢，常争执吵打，郁 闷不乐，加重病情。日晡潮热，两胁雑痛，饮食渐减，身体消 瘦。B超提示：肝脏占位病变。CT扫描提示：肝癌。西医拒予 收治。复求余诊治：刻下纳差，身体消瘦，午后潮热，小便短 赤，两胁胀痛，右肋下可触及坚硬肿大硬块。舌红暗，有瘀点， 脉沉弦。

例二 张加科，男，48岁，1990年12月3日初诊。患者有 “慢支”病史，近半年来，纳差，两胁胀满疼痛，伴午后潮热。 刻下两胁胀满疼痛，右肋下可触及肿大肝脏。纳谷不香，小便短 赤，舌红暗，脉沉弦。B超探查：早期肝硬化。

例三 常某，女，70岁。患者长期胃廣痛，时轻时重，未 作重视。近月余胱腹胀满、疼痛加重，反复服药，效果不显，求 诊于余。患者面色晦暗，微浮肿，纳差，午后潮热，两胁胀满疼 痛，右肋下可触及肿大肝脏，小便短赤，大便干结，舌淡暗，苔 白腻，脉沉弦。B超探査：肝脏肿大伴胆囊炎。

例一杨某，女，55岁，患两胁胀痛半年余，多处求治， 其效不显。遂来我科诊治。刻下纳差，两胁胀满,右肋下可触肿 大肝脏，质软，压痛不明显，舌红暗，脉弦细。B超探査：肝脏 肿大。肝功能：正常。

例二 常某，•女，60岁，患者两胁胀满、纳差月余，前来 我科诊治。刻下午后潮热，两胁胀满，右肋下可触及约4cm肿 大肝脏，压痛不明显；肝功能正常，B超探査：肝脏肿大下垂。 舌红，苔白，脉沉弦。

例一蒋某之妻，31岁，1988年1月27日初诊。患者患 “慢性肝炎”半年余，多方调治，终未康复，前来求治。患者面 色萎黄，纳差，少气懒言，动则喘息；两胁胀满，下午潮热，小 便短赤，测体温37.5X3 o肝功能提示：谷丙转氨酶与黄疸指数 

例二 常某，男，42岁，患慢性肝炎1年余，多方治疗， 病情不见好转，前来我科诊治。刻下纳差，两胁胀满，肝区胀 痛，上腹部青筋显露；午后潮热，大便澹薄，小便短赤，面色晦

例一李某，男，43岁，1988年1月4日初诊。患者脱腹 满闷，伴两胁胀痛两月余。两月前在县医院检査：患“乙型肝 炎”，即求治于中西医，未见好转，遂来我科诊治。刻下患者精 神萎靡，面微浮肿，色眺白，廣腹满闷，两胁胀痛；口苦纳差, 午后潮热；大便干结，小便短赤，舌红暗，苔白，脉沉弦。此乃 邪郁厥阴，阳明受累，邪灼肝胆，阳明失和。

例二 韦某，男，25岁，患“乙肝大三阳”，前来就诊。患 

例一 李某，女，16岁，1995年12月3日初诊。患者发热 两天余，医以感冒治之，症状未减，来我院中医科就诊。刻下发 热，测体温38.4X3,皮肤、巩膜黄染，小便黄赤染地；呕吐, 纳差，便澹，舌淡苔白腻，脉弦数。

例二 牛某，女，3岁。1989年12月21日初诊：其母代 诉：发热10余天，服药热不退。近5天眼球黄染，小便黄赤染 地，大便干结，纳差，腹胀，伴呕吐。西医以“急性黄疸型肝 炎”收住院治疗，疗效不佳。刻下检小便胆红素强阳性。肝功 能：黄疸指数15单位。

例三 牛某，女，57岁，1989年7月21日初诊。患者发 热、眼球及全身皮肤黄染伴胁痛月余，多处诊治，发热身黄未 除。刻下两胁胀满疼痛，眼球及皮肤黄染，口苦纳差，恶心呕 吐，小便黄赤，大便干结，发热，测体温38.0X3,尿检：胆红 

例一 徐某，男，49岁，1990年11月29日初诊。患者 “慢支”多年。近年来廣腹胀满，两胁串痛，餐后尤甚，动则喘 息，夜卧不安，不能劳动。面色萎黄，身体消瘦。医仍按“慢 支”治之，效果不显。刻下两肺可闻及哮鸣音；右肋下可触及约 4cm肿大肝脏。舌红，苔薄白，脉沉弱。B超探査：肝脏大小正 常，整个脏器下垂。予“益气补肝汤”加减。

例二 周某，男，59岁，1987年10月23日初诊。患者面 色晦暗，脱腹胀痛；短气，动则喘息，心烦易怒，口干口苦，恶 心，厌油腻。舌淡红，苔黄腻，脉沉弱。B超探査：肝脏下垂。 予“益气补肝汤”加减。

例三 赵某，男，61岁，1998年4月25日初诊。患者眼黏 眼雾，伴眼睑浮肿，腰酸腿软；纳差，廣腹胀满，两胁疼痛。舌 淡红，苔薄白，脉沉弱。B超探査：肝脏下垂。

第四节心病方

例一刘某，男，58岁，1992年7月31日来诊。患者胸中 憋闷，心悸、心跳，伴短气，困倦乏力。心电图提示“冠状动脉

例二 顾某，男,37岁,1990年8月7日初诊。据云：心 悸、胸闷10余年。近年来，常头晕，血压升高，伴胃胱不适。 近因事不遂心，胸闷加重。刻下心跳缓慢，心率46次/分，胃脱 轻度压痛，测血压130/96mmHg,舌红，苔薄白，脉沉迟。心电 图提示：冠状动脉供血不足。

例三 李某，男，60岁，1996年10月17日来诊。据云： 胸中憋闷伴心慌气急多年。县医院诊断为：冠心病。常服“复方 丹参片、地奥心血康”，症状不能控制。近心情不舒，情绪波动， 病情加重。刻下心慌胸闷，动则喘息，两胁胀满，胃胱疼痛，纳 谷不香，舌红暗，苔白腻，脉沉弦。

例一 曹氏，女，63岁，1997年6月27日初诊。患者素有 胸闷心慌气急之恙。昨夜突发心悸、胸中憋闷，幸家备有“速效 救心丸”，急含服，得缓解，遂来院就诊。刻下仍心慌气急，胸 中憋闷，口唇紫紺，心率快，心率114次/分，舌紫暗，苔白腻， 脉细数。心电图提示：H、脏冠状动脉供血不足，符合冠心病。予 “大胸痹丸”加减水煎服。

例二 田某，男，51岁，1993年11月14日初诊。胸闷伴 阵发性胸中刺痛多年，经县医院诊断为“冠心病”。长期服西药, 症状不能控制。常随身携带“速效救心丸”以应急抢救。近胸 闷，两胁胀满，郁闷不乐，伴阵发性胸前区疼痛，心悸少气，倦 怠乏力，动则喘息。心电图提示：冠状动脉供血不足。舌红暗， 苔白腻，脉弦涩。予“大胸痹丸”加减水煎服。

例三 魏某，男，67岁，1997年4月18日初诊。患者面色 红润，身体丰腴，血压偏高，素有胸中憋闷，头昏、头晕史，1 年前经县医院确诊为：“高血压、冠心病。”刻下头昏、头痛，夜 不安寐，心慌，少气乏力，动则喘息；两胁胀满，纳谷不香，胸 中憋闷。舌红，苔白腻，脉弦硬。予“大胸痹丸”加减水煎服。

例一 刘某，男，55岁，1988年10月2日初诊。患者胸闷 1年余。1年前因劳累感胸闷、胸痛，甚时痛引肩背。心电图提 示：冠状动脉供血不足。

例二王某，男，30岁，半年前不慎胸部外伤，服消炎镇 痛药，症状缓解，遂停药。继后常感胸闷、胸中隐痛。近月余疼 痛加重，伴纳差，乏力，午后潮热，阵发性咳嗽。摄胸片：未见 异常。舌红暗，苔白，脉弦涩。此乃外伤胸中，脉络受损，久 之，外溢之血瘀滞脉络，阻滞气机，故胸闷、胸痛加重。瘀血作 祟，午后潮热；胸腔受损，影响肺窍，故发咳嗽。予“加味血府 逐瘀汤”加减。

例三 李某，女，70岁，患胸闷伴阵发性胸痛多年。县医 院诊断为：冠心病。常服“复方丹参片、速效救心丸”，症状始 终未能控制。刻下胸闷、胸痛加重3天，服“速效救心丸”暂时 •缓解，过后仍胸痛，胸中憋闷，面色萎黄，少气懒言，舌淡暗, 苔薄白，脉沉缓。

例一徐某，男，46岁，1992年8月25日初诊。患者心悸 心跳两月余。刻下面色萎黄，畏寒肢冷，动则心慌气急，伴纳 差，困倦乏力，时大便澹薄，心率50次/分，舌淡苔白，脉沉 迟。予“温通宁心汤”加减。

例二 常某，男，65岁，1995年10月11日初诊。患者体 丰，近发胸闷心悸，动则心慌气急，心率50次/分，舌红，苔薄 黄，脉迟缓。

例三姜某，男，37岁，1990年6月27日初诊。据云：患 者寒热往来，低热不退半年余。曾多方求治，中西药并用，终不 见明显好转。刻下发热，测体温37.51,伴纳差乏力，心悸心 跳，心率42次/分，舌红，苔薄，脉迟缓。

例一 陈某，女，49岁，1990年6月27日初诊。自述：心 悸、心跳伴头晕乏力多年。刻下心悸心跳，动则喘息，心率明显 不齐。舌红暗，脉结代。心电图提示：窦性心律，频发室性早搏。

例二 张某，女，50岁，1991年10月10日初诊°自述： 近半年来心慌气急，动则喘息。胸透示：两肺纹理增粗，心脏增 大。心电图提示：室性早搏。舌红暗，苔白，脉结代。此乃心血 虚，不能养心。予补心血，佐理气活血法治之。

例三 屈某，男，67岁，1991年8月22日初诊。患者系理 发师，“慢支病”。近发心悸心跳，动则喘息。刻下心慌气急，稍 动作，似不能支持，伴廣腹胀满，胸中憋闷，口唇紫紺，四肢厥 冷。心电图提示：频发室性早搏，左心室肥大伴心肌劳损。舌淡 暗稍胖，苔白腻，脉结代。

例一 姚某，女，37岁，1990年5月14日初诊。患者心悸 心跳半年余，加重10余天。刻下自觉心慌、气急，倦怠乏力， 心烦易怒，多汗，心音亢进，心率120次/分；测血压140/ 80mmHg；检T3、T4均属正常；心电图示：心动过速。舌红， 苔白，脉弦数。

例二 王某，女，20岁，1990年3月4日初诊。自述：半 月前因惊恐过度而患心悸、心跳。刻下心悸心慌，夜梦纷纭，惶 惶如人将捕之，心率96次/分；心电图提示：心动过速。舌淡 红，苔薄，脉细数。

例三 李某妻，55岁，1991年11月10日初诊。患者心悸 心跳，伴纳差，乏力，夜不安寐，阵阵咳嗽，动则喘息3月余。 胸透：双肺纹理增粗；心电图提示：心动过速，冠状动脉供血不 足。肺失肃降，首予降肺平喘、宁心安神图治。

例一杨某，女，11岁，1989年2月14日初诊。据云：半 年前因感冒未及时治愈，遂发心悸、心跳。经县医院诊断为病毒 性心肌炎。反复经中西医治疗，病情时轻时重，终未得愈。刻下 发热两天余，测体温38.1*0,血检：白细胞22 400/mm3,心悸， 心跳，动者喘息，心率136次/分，舌红，苔白，脉细数。予清 热解毒，佐益气养阴法，宗“清心解毒汤”加减。

例二 高某，女，34岁，1988年1月20日初诊。自述：发 热两月余，近发心悸心跳，动则喘息，伴困倦乏力，头晕，多 汗；纳差，口干、口渴，心率120次/分，测体温37.51，心电 图提示：窦性心动过速，心肌损害。舌淡，苔薄，脉细数。此乃 邪毒侵犯肌体，串入心胞，君主受累。予清热解毒敛阴法图治。

例三 相某，男，56岁，1997年12月28日初诊。患者心 悸心跳，胸闷，纳谷不香，动则喘息，四肢乏力。心电图提示: 心动过速，心肌损害。心率110次/分，舌质红，苔薄黄，脉 弦数。

第五节肾病方

例一 何某，男，37岁，1988年12月29日初诊。自述: 感冒10余天，近3天突发腰痛，颜面浮肿，伴纳差、呕吐胀满; 四肢乏力，咽喉肿痛，测体温37.5X3;尿检：蛋白（+ + +）, 舌质红，苔黄白，脉弦。

例二 张某，男，50岁，1993年2月15日初诊。患者近日 发热，困倦乏力，伴腰膝酸痛，面目浮肿。尿检：蛋白（+ + +）, 舌红暗，苔白，脉弦数。

例一 袁某，男，50岁，1988年7月7日初诊。据云：患 者半月前突发全身浮肿，曾服消炎利尿药罔效。刻下全身浮肿， 下肢尤甚，按之凹陷如烂泥；不发热，纳差乏力，腰酸痛如折， 测体温36.7X3,检小便：蛋白（+ + +）,管型（+ ）。舌质淡， 苔薄白，脉沉缓。予清热解毒，佐以补肾利尿法图治。

例二 闪某，男，37岁，1988年7月4日初诊。据云：1 年前曾患“急性肾炎”。经中西医治疗，浮肿消失，然腰痛及蛋 白尿始终未除。近因感冒致眼睑浮肿，小便短赤，腰酸痛乏力， 不发热，纳谷可，尿检：蛋白“阳性”，并见“红细胞”及“管 型”，舌质红，苔薄黄，脉弦。予清热利尿，佐滋阴补肾法图治。

例三 徐某，女，37岁，1987年8月7日初诊。患者因腰 痛伴全身浮肿来诊。刻下全身浮肿，面部尤甚；腰痛不能俯仰； 小便短赤涩痛；白带量多，发热，测体温37.4X3, 口干，纳差 乏力；尿检：蛋白（+ + +）,舌红，苔白腻，脉弦。

例一 张某，男，59岁，1993年4月19日初诊。患者尿 频，日十余行，伴腰酸痛，眼睑浮肿，纳差乏力。反复治疗三月 余，诸症不见好转。刻下：诸症悉具，尿检：蛋白“阳性”，并 见少量“红细胞”。舌质红，苔薄白，脉弦。予“加减八正散” 加减。

例二 刘某，女，43岁，1988年5月18日初诊。患者慢性 肾炎史，刻下腰痛，眼睑浮肿，伴小便热痛，肌肉酸痛乏力。尿 检：蛋白（ + ）,舌红，苔白，脉弦O

例三 李氏，女，60岁，1989年10月2日初诊。患者尿 急、尿频、尿痛两天余。刻下发热，测体温38.0*0,小便涩痛, 日十余行，舌红，苔白，脉弦数。

例— 李某，男，42岁，1988年4月28日初诊。患者既往 患“胆囊炎”病史。刻下面黄体弱，小便不利，尿道涩痛，腰痛 腹痛，痛苦,不堪，并伴脓血大便。B超探査：尿道结石。舌质 红，苔薄黄，脉弦，尺部有力。予益气通淋法调治，取“益气排 石汤”加减。

例二 李某，男，63岁，1990年12月7日初诊。据云：患 者尿频、尿痛4天余，曾输液并服西药治疗，症未减，前来我科 诊治。刻下腰腹部阵发性剧烈疼痛，小腹压痛明显；小便涩痛 时，肉眼可见血尿。尿检：蛋白（ + ）,红细胞（+ + +）; B超 探査提示：左肾结石。舌质红，苔白，脉弦。予“益气排石汤” 加减。

例三 陈某，男，50岁，1991年4月16日初诊。患者近三 月腰腹反复牵引作痛，时伴小便淋沥涩痛。B超提示：右侧输尿 管结石。舌红，苔白腻，脉弦。

例，均系年老体弱之人，若大剂利尿排石之剂，有 碍虚弱之体，故重用升、茂扶正益气以助驱邪排石之力，若无 升、芷升提益气，结石不会迅速排出也。

例一赵某，女，24岁，1998年2月25日初诊。患者2年 前曾因右肾结石手术治疗，手术1年后腰痛复发，B超提示：左 肾1.3cmX 1.1cm结石，右肾0.8cm x 0.6cm结石。因畏惧再手 术，遂服“消石素、排石冲剂”等药物治疗，腰痛不减，遂来我 科诊治。复B超探査：左肾1.7cmX 1.0cm结石，右肾0.8cmX 0.7cm结石。遂服“金桃化石丹”。

例二钟某，男，42岁，1997年7月7日初诊。患者腰痛 反复发作多日，多处治疗，时轻时重，终未根除。B超提示：左 肾多枚结石，分别为：0.8cm, 0.7cm, 0.5cm;左侧输尿管 0.7cm结石。服“金桃化石丹”第三天，腹痛甚，肉眼血尿。服 药两月余，腰、腹痛均缓解，小便利。复查B超：左肾及输尿 管未见结石显影。

例三王某，男，36岁，1997年5月23日初诊。患者2年 前因患左肾结石曾手术治疗。近半年反复腰痛，时轻时重，B超 探查：左肾1.4cmX 1.1cm结石。前来我处诊治，予“金桃化石 丹”服用以观动静。	.

第六节身痛方

例一 牛某，男，25岁，1988年9月25日初诊。据云：右 肘关节肿痛20余天，曾予输液等法治疗，肿胀疼痛加重。刻下 上肿至肩，下至手腕，不能弯曲，亦不能伸直。摄片提示：化脓 性关节炎。舌淡苔白，脉缓。予“变通阳活汤”加减。

例二 李某，男，20岁，1989年10月1日初诊。患者厂脚 踝肿痛1月余，皮肤灰黑，行走艰难，不发热。摄片示：骨髓 炎。血检：白细胞13 000/mm3,舌质红，苔薄，脉细数，脉率 100次/分。予“变通阳活汤”加减。

例三 张某，女，16岁，1992年10月14日初诊。患者左 髓关节疼痛半月余，无红肿，不能行走，压痛明显，舌质红，苔 薄，脉沉弦。予“变通阳活汤”加减。

例一 杨某，男，44岁，1988年1月27日初诊。据云：患 者双下肢自环跳穴至膝关节疼痛半年余，时轻时重，随天气变化 而加重，曾多次延医诊治，西医诊断为“坐骨神经痛”；中医投 以驱风逐寒之剂，均未见明显好转。今来诊扶杖入室，舌质红, 苔薄白，脉迟。此乃风、寒、湿邪侵入肌体，滞留关节，痹阻经 络，故关节疼痛，屈伸不利，不能行走也。予“蠲寒利节汤” 加减。

例二李某，男，46岁， 年前，曾因腰腿疼摄片检查：

例三 颖侠，女，11岁，1997年12月21日初诊。患儿全 身关节疼痛1年余，行走艰难，随天气变化加重。前医均按“风 湿性关节炎”调治，病魔终未铲除。刻下面色萎黄，行步艰难, 血沉35mm/h,抗"O" 1 250/h,舌淡苔白，脉弱。

例一常某，女，35岁，患腿痛月余。刻下身痛，下肢尤 甚，屈伸不利，不能行走；下肢多处风湿结节，服西药可暂时痛 止，停药疼痛即加重，舌质淡，苔白腻，脉弦。

例二 齐某，男，15岁，1994年1月6日初诊。患者双膝 关节肿痛3月余。曾给予大剂量“青霉素”等抗炎药物治疗1月 余，疼痛未减，并有加重趋势，遂来我科求治。刻下发热，身体 消瘦，痛苦面容，双膝关节肿甚，不能步履，测体温37.81, 舌红暗，苔白腻，脉弦数。 

例一 张某，男，47岁，1991年12月1日初诊。患者腰 酸、沉痛月余，并向下肢放射。服中西药旋即见效，停药后疼痛 复作。近日疼痛加重，遂来我科诊治。患者腰痛不能俯仰，夜卧 难以转侧，舌红暗，脉沉弦。予“补肾活血汤”加减。

例二 赵某妻，37岁，1990年5月5日初诊。患者素有腰 痛之疾，反复多处求治，终未得愈。近加重3月余，夜卧不能转 侧，白天稍感舒适，伴纳差，头晕乏力，舌红暗，苔薄白， 脉沉。

例三 姚某，男，33岁，1988年5月8日初诊。患者夜卧 腰痛如折，右侧尤甚，舌红，苔薄白，脉弦。予“补肾活血物” 加减。

例一 张某，男，40岁，1990年9月7日初诊。患者腰痛 1年余，多处求治，并予针灸等法治疗，终未得愈。刻下腰痛， 右侧尤甚，俯仰不能，转侧不利。摄腰椎片：未见异常。舌质 红，苔薄白，脉沉弦。予“活血补肾汤”加减。

例二 王某，男，40岁，1989年12月14日初诊。据云： 反复腰痛1年余，加重10余天。腰痛不能转侧，夜卧腰痛如折， 近日小便涩痛。B超示：泌尿系未见明显异常；摄腰片：腰椎无 异常。舌红暗，脉尺盛寸弱。

例三 张某，女，50岁，1998年11月1日初诊。患者腰痛 1年余，多处求治，终未得愈。刻下腰痛，向下肢放射，夜卧不 能转侧，痛甚需持杖行走。摄腰片提示：腰椎骨质增生。舌红， 苔白，脉沉弦。

第七节外感方

例一尹某，男，18岁，1988年7月4日诊。患者发热4 天余，当地医生予西药并输液治疗，高热旋退旋复，遂来我科求 治。刻下发热头痛，眼球疼之欲出，口渴引饮，大便干结，小便 短赤，肌肤灼手，测体温39.31,舌红，苔薄黄，脉洪数。此 乃盛夏之时，感受暑邪，搏于媵理，不得速解。《内经》云：“因 于暑，体若燔炭，得汗乃散。”予“清热解肌散”加减。

例二 李某，女，40岁，1995年8月26日初诊。患者素有 “慢肝”史，近感受暑邪，高热3天余。曾在当地服西药并输液 治疗，高热不退，前来中医科诊治。刻下高热，测体温39.or, 肌肤灼手，呼吸急促，口干、口渴，大便干结，小便黄赤，两胁 胀痛，舌红，苔薄黄、燥裂，脉数。患者素体虚弱，复感暑邪, 邪正相搏，耗气伤津，故高热，暑热之邪迟迟不去也。

例三 郭某，男，44岁，1996年7月7日初诊。患者两月 前因胁痛即确诊为“肝癌”，低热不退。近半月反复鼻飢，时呕 鲜血，持续高热，每天输液约2000毫升，体温徘徊在39.0*0左 右。时值盛夏，身体急骤消瘦，家属忧恐万分，前来中医科 询方：

例均于盛暑，或感受外感暑邪而高热不退；或内 伤，邪正相搏而高热不退，均重用生石膏而收捷效。然非盛夏, 若遇外感之邪侵犯人体，高热不退者，亦可斟酌而用也。

例四 万某，女，27岁，1991年2月2日初诊。患者发热 3天，服西药热未退，自觉症状加重。刻下恶寒发热，头痛身 痛；咽喉肿痛，扁桃体充血肿大；咳嗽，两肺呼吸音粗糙，测体 温39.6X3,舌红，苔白，脉弦数。予“清热解肌散”加减。

例五 柳某，男，26岁，1993年3月24日初诊。患者发热 头痛两天余。

例六 赵某，女，39岁，1989年3月3日初诊。患者既往 患有“尿路感染”，近反复发热月余，伴头痛呕吐，口干、口渴， 心慌心悸，纳呆，乏力。曾反复服中西药，并予输液治疗，其热 不解。刻下诸症悉具，测体温39.41C,舌质红，苔薄黄，脉细 数。予“清热解肌散”加减。

例一曹某，女，57岁。发热头痛、流清鼻涕一周余。医 以感冒投以西药治之，头痛恶寒未解，前来中医科诊治。刻下发

例二 焦某，女，42岁，1992年6月7日初诊。患者素有 风湿热病，刻下发热10余天，恶寒头痛，身痛乏力。连续输液 一周，证未解，测体温37.3P,舌质红，苔薄白，脉弦。

例乃西医反复治疗不愈者而录之。

例一 朋朋，男，5岁，1990年5月28日来诊。患者发热 3天余，输液并服西药热未退，前来我科诊治。刻下双侧腮腺肿 大，恶寒发热，测体温38.7X3；头痛，呕吐，口干、口渴，脉 细数。血检：白细胞：36 200/mm3,中性粒细胞：96%。

例二 赵某，女，24岁，1997年5月17日初诊。患者发热 两天余。刻下高热，头痛，咽喉肿痛；扁桃体肿大，碍于饮食； 测体温：39.21； 口干、口渴，大便干结，小便短赤；舌红，苔 白，脉洪大。

例一 李某，男，30岁，教师，1991年7月12日初诊。患 者发热10余天，体温波动在37.5~38.01C之间，服西药并输液 治疗，低热不退。余诊时，纳差乏力，体倦少气，发热上午尤 甚，测体温37.51,舌质淡，苔薄白，脉缓。予“益气养阴汤” 加减。

例二 张某，女，69岁，1992年6月31日初诊。患者身体 瘦弱，发热一周余。刻下面色无华，口干少津，低热，伴头晕耳 鸣，困倦乏力，舌质红，少苔，脉沉弱。予“益气养阴汤”加 减。

例三 张某，男，36岁，1988年8月30日初诊。据云：低 热伴倦怠乏力两月余，纳差，体渐弱，服药无效，查无异常，初 以为夏季炎热之故。刻下面色萎黄，四肢酸懒，困倦乏力，舌 红，少苔，脉弦。此乃天气炎热，劳累过度，耗气伤阴，致气阴 两虚也。

第八节头痛方

例一 李某，女，65岁，1997年8月30日初诊。患者头晕 头痛多年，加重10余天，伴头重脚轻，失眠耳鸣，口干口苦， 大便干结，右上肢活动不灵。测血压170/100mmHg,舌质红， 苔薄白，脉弦。予“清巅降浊汤”加减。

例二 张某，女，53岁，1988年4月21日初诊。据云：患 头痛头晕、血压偏高多年。刻下头痛加重，伴心悸耳鸣，腰酸腿 软；两胁胀痛，嗝气；带下色黄量多；心率明显不齐。测血压 180/1 lOmmHg,舌质红，苔黄腻，脉结代。此乃肝胆郁热上亢， 故头晕头痛；肝胆湿热下注，故带下色黄量多。予滋阴清肝，以 制上亢之阳，佐疏肝利胆化湿，以止带下。

例三 李某，女，62岁，1987年5月9日初诊。据云：患 者头晕、头痛，血压偏高多年。刻下头晕、头痛加重，头重脚 轻，如踩棉絮；体丰面红，左侧肢体麻木疼痛有热感；腰酸腿 软，下肢浮肿；时大便干结，小便短赤，测血压160/IOOmmHg, 舌淡红，苔白腻，脉沉弦。此乃肝肾阴虚，肝阳上亢，浊阴不 降；治宜滋阴潜阳，降浊化湿，散瘀止痛法。

例一 李某，女，19岁，1991年3月20日初诊。据云：患 者头昏、头痛两年余。刻下头昏、头痛，前额尤甚，虽在青年, 少气乏力，舌质淡，苔薄白，脉弱。予“益气清巅汤”加减图治。

例二 杨某，女，22岁，1990年3月8•日初诊。自述：产后 8个月，自产后头昏、头痛，前额尤甚，午前发作，午后减轻，伴 短气乏力，二目昏花，乳汁不足，舌质淡，苔薄白，脉沉弱。

例三 廖某，女，29岁，1991年6月2日初诊。患者素患 头晕、头昏症，数日来天气炎热，头晕、头昏加重，并伴头痛， 面色萎黄，动则心慌气急，测血压80/60mmHg,舌红，苔薄白， 脉虚大无力。

例一 柳某，攻，30岁，1996年8月31日初诊。患者反复 发作头痛半年余，多次服中西药效果不显，前来我科诊治。据 云：半年前于产后患头痛症，初未慎重治疗，后渐加重，呈阵发 

例二 韦某，男，26岁，1996年8月3日初诊。患者患头 痛4年余。经某市医院拟诊为“血管神经性头痛”。曾反复住院 治疗，时轻时重，经人介绍，求治于余。据云：阵发性头痛多 年。日发作十余次，头痛如裂。观素往病历，皆“活血化瘀，除 风止痛，镇静安神”诸法，效果均不明显。患者身体强壮，非痛 时无任何症状，舌红暗，脉弦。仍拟活血除风，加搜刮之剂图 治，以观动静。

例三 柳某，女，28岁，1997年4月15日初诊。据云：患 者阵发性头痛4年余，痛如锥刺，两侧尤甚，反复治疗，终未得 愈。舌红暗，有瘀点，苔薄白，脉沉弦。

例一 郭某，女，41岁，1991年11月10日初诊。患者头 昏伴恶心呕吐，头阵发性刺痛10天余，当地予输液治疗，效果 不显，来我科求治。刻下头昏头痛，恶心呕吐，舌质红，苔白， 脉弦。

例二 郭某，女，49岁，1990年12月10日初诊。自述: 患头晕、头痛伴恶心、呕吐两月余。曾服中西药，效果不显，近 日加重，来我科诊治。刻下：面色萎黄而虚浮，头晕伴昏沉疼 痛；胱腹满闷，头稍摇动，即恶心、呕吐。舌质红，苔白腻，脉 沉弱。

第九节精神病方

例一张某，女，29岁，1995年10月6日初诊。患者患精 神病多年，时轻时重，反复发作，多次往地、县精神病医院治 疗，终未治愈。刻下加重10余天，神志痴呆，哭笑无常，家人

例三 邓某，男，40岁，1996年4月15日初诊。患者沉默 寡言，闭门不出也，时神情痴呆，言语颠倒，舌质淡，苔白，脉 沉弱。

例一 刘某，女，21岁，1991年6月2日初诊。其父代诉: 两月前因事不顺心，突发神情痴呆，愁眉不展，默默不语，呼之 不应，所问非所答。遂延中西医诊治，病未见好转，反日趋加 重，遂去地区精神病医院治疗。越两月，病情略有好转，遂带药 返家。近两天病情加重，神情痴呆，不识亲疏，默默不语，心烦 欲哭，舌红苔少，脉弦数，脉率100次/分，予“益智宁宫汤” 加减。

例二 袁某，女，20岁，1992年3月29日初诊。患者10 天前因生气致心烦不寐，近三天彻夜不眠，神志恍惚，时沉默不 语，哭笑无常，心悸心慌，心率快，舌红，苔薄白，脉弦数。

例三郭某，男，32岁，1987年9月10日初诊。患者憔悴 面容，心烦易怒，健忘多虑，惶惶不安，喜僻静，舌红，苔少， 脉弦细。此乃忧思损伤心脾也，予“益智宁宫汤”加减。

例一 郭某，女，30岁，1994年3月14日初诊。患者因施 绝育手术郁闷不乐，神志恍惚，夜不入寐，有时彻夜不眠。刻下 面容憔悴，惶惶不安，伴头晕耳鸣，舌质红，苔黄腻，脉弦。

例二 牛某，女，41岁，1988年5月12日初诊。患者患失 眠多年，有时彻夜不眠，心悸、心跳、心烦不宁，口干口苦。近 年来月经期眼睑浮肿，失眠加重，舌红，苔少，脉弦数。

第十节虚劳方

例一 姜某，男，21岁，1993年5月29日初诊。患者素有 咳嗽、低热、盗汗史。近咳血3天余，今日突然咯血约50毫升， 发热伴五心烦热，纳差，大便干结，测体温37.8X3,舌红，苔 少，脉细数。胸透提示：浸润型肺结核。

例二 郭某，女，60岁，1987年9月5日初诊。患者体质 消瘦，反复咳嗽多年。近三月反复发热盗汗，伴纳差，口干、口 黏乏味，大便干结，四肢乏力，右上胸叩诊呈鼓音，胸透提示： 右上肺空洞型肺结核。舌质红，苔少，脉沉弱。

例三 王某，女，51岁，1987年4月28日初诊。据云：20 年前因感冒多日未致，经县医院摄胸片提示：肺结核，常年服 “抗腐药”终未痊愈。'刻下面黄体弱，发热，午后尤甚，干咳， 痰中夹血丝；口苦、咽干，纳差，倦怠乏力，头痛、头昏，大便 干结，三四日一行，舌质红暗，苔白腻，脉弦数。 

例一 秦某，女，44岁，1990年2月18日初诊。患者患慢 支20年，平素易感冒，动则喘息。刻下面色晦暗，咳嗽不止， 四肢厥冷，下肢浮肿，口唇微紫紺，两肺满布哮鸣音，口干口黏 而不渴；舌红有瘀点，苔白，脉沉细。心电图提示：右心房 肥大。

例二 孙某，女，55岁，1988年2月13日初诊。据云：20 年前因患感冒咳嗽，初未根治，后反复发作，冬季尤甚，近年来 病情加重，冬夏亦然。刻下面黄体弱，动则喘息，低热不退，测 体温37.2X3,大便干结，小便短赤，两肺满布哮鸣音；心音扩 大，可闻2级以上收缩期吹风样杂音。舌淡暗，边有齿印，苔薄 白，脉沉细、稍数。

例一杨某，男，60岁，1997年2月14日初诊。据云：患 者慢支史，近感冒20余天，发热咳嗽，颜面潮红，胸中隐隐作 痛，动则嶋息，测体温37.3X3；血检：白细胞17 100/mm3,胸 透：慢性支气管炎，右下支气管肺炎。舌质红，苔白黄，脉弦。

例二 张某，54岁，1988年7月5日初诊。自述：患慢支 多年，易感冒，初则冬春易发作；近年四季稍感风寒，咳喘不 已。近因感冒，咳喘发热，下午尤甚，两肺可闻哮鸣音，舌质 红，苔白，脉弦。

例一 张某，男，33岁，1988年1月18日初诊。患者素有 慢支宿疾。近因感冒，咳嗽加重10余天。初则痰中带血，继则 大口吐血。曾求中西医治疗，血未止，咳嗽加重。刻下面色晦 暗，呼吸急促，满头大汗，两肺呼吸音粗糙，舌淡暗，苔薄白, 脉弦滑。根据急则治其标之原则，首予降逆、清热止血法。

例二 王某，男，60岁，患慢支多年，冬春尤甚，平时靠 “喘息定、氨茶碱”临时缓解症状。近因感冒，咳喘加重，动则 喘息，咳吐白稠痰，不能平卧，纳差，舌淡胖，苔白腻，脉 沉弱。

第十一节甲状腺方

例一张某，男，50岁，1997年5月13日初诊。患者左颈 下喉旁一肿块，如核桃大小，质硬，随吞咽上下移动。彩超探 査：甲状腺混合性包块。予“代刀消瘤丸”徐服两月余，肿块消 无芥蒂。

例二 柳某，女，23岁，1996年10月6日初诊。患者颈下 左侧喉旁一鸡蛋大小肿块。县医院诊断为“甲状腺瘤”，劝予手 术治疗，因产后月余，加之手术费用过高，患者未予手术治疗。 经介绍来我科诊治，遂予“代刀消瘤丸”徐服20天，肿块消无 芥蒂，其夫欢喜若狂，喜曰：“若手术治疗，刀口至今尚未痊 愈矣。”

例三 韦某，女，35岁。颈下左侧喉旁一鸡蛋大小肿块， 质硬，医予消肿散结药物治疗，越月余，肿块未见缩小，遂来我 科诊治，予“代刀消瘤丸”徐服月余。肿块尽消矣。

例一 宋某，女，30岁，1991年9月3日初诊。患者半年 来常感心悸、心跳，多汗，烦躁易怒，继发现脖子稍粗，遂去当 地医院检查，诊断为“甲状腺肿大”。服西药及中药，效果甚微， 遂来我科求治。

例二王某，女，36岁，1998年4月4日初诊。患者感冒 两月余，近心悸、心跳，伴全身不自主颤动，困倦乏力，心烦多 汗，心率快，测心率123次/分，颈粗，甲状腺明显肿大，舌红 苔薄，脉细数。

第十二节消渴方

例一 扬某，男，43岁，1989年6月14日初诊。自述：口 干口渴，伴尿频月余。刻下尿如膏脂，伴疲倦乏力，测尿糖（十 + +）,舌质红，苔白腻，脉弦。

例二 刘某，女，62岁，1997年5月3日初诊。患者近日 口干、口渴伴尿频，疲倦乏力，关节疼痛。尿蛋白阳性，尿糖 (+ +)。舌质红，苔薄白，脉弦。

第十三节鼻鈕方

第十四节咽喉方

例一 李某，女，46岁。患者自觉咽中不利，阻塞梗滞多 年，每于失眠或心情不舒而加重。近月余，咽干少津，似有物阻 滞咽喉；咽壁有多枚滤泡，精神异常紧张。舌红，苔薄，脉弦。

例二 张某，男，36岁。据云：患慢性咽炎多年，多处求 治，终未得愈。刻下咽中不利，似有物阻滞，吞咽疼痛，咽喉壁 有多枚滤泡，舌红，脉弦。

第三章男 科

例一 王某，25岁，1989年7月28日初诊。患者婚后夫妇 同居2年，其妻未孕（配偶妇检：无异常）。反复多次调治，无 效验。精液常规检査：量2.5ml,计数0.3亿/mn?,活动率 50%,活动不良。（刻下其妻月经净5天）舌红，苔白，脉弦。

例二 杨某，24岁，1997年5月9日初诊。据云：婚后夫 妇同居2年，其妻未孕（配偶妇检：正常）。精液常规检査：量 lml,计数1 500万/mn?,活动率65%。舌质红，苔少，脉沉细， 予“乾造丸”加减。

例三 张某，22岁，1987年8月3日初诊。患者1986年8 月结婚，婚后夫妇同居未孕（配偶妇检：正常）。平素腰酸腿软， 性欲淡漠。精液常规检查：量2ml,计数0.13亿/mn?,活动率 60%,舌红，苔薄，脉弦。

第十五节生精丸

例一杨某，25岁，1996年3月8日初诊。患者婚后2年 余，夫妇同居其妻未孕（配偶妇检：正常）。自述：腰酸腿软， 头晕耳鸣，性欲淡漠。精液常规检查：量1ml,计数0.3亿/ 

例二 韦某，26岁，1994年10月22日初诊。患者婚后8 个月，夫妇同居其妻未孕。据云：性欲极差，新婚之夜，即无性 欲要求，伴阳痿早泄，腰酸腿软，头晕耳鸣。精液常规检査：量 0.5ml,计数0.6亿/mn?,活动率50%,舌红，苔薄，脉沉弦。

例三 王某，28岁，1996岁9月13日初诊。患者婚后夫妇 同居3年未育，无性欲要求，精液常规检查：无精虫。予“生精 丸”治疗3月余。复精液常规检査：量2ml,计数400万/mn?。 继服3月，其妻停经40天，恶心呕吐，尿妊娠试验阳性。

第十六节化精丸

例一 韦某，25岁,1993年11月30日初诊。患者婚后1 年余，夫妇同居未育（配偶检查：正常）。性欲正常，无不适， 精液常规检查：量3ml,计数1.5亿/mn?,活动率80%, 3小 时未液化。予"化精丸"加味调治。

例二 杨某，25岁，教师，1989年3月27日初诊。患者婚 后3年，夫妇同居未育（配偶妇科检查：正常）。性欲正常，自 感腰酸乏力。精液常规检査：量4ml,计数0.7亿/mn?,活动 力差，液化时间1小时。舌红，苔少，脉沉。

第十七节益气通溺汤

例一秦某，68岁，1989年2月10日初诊。患者于3月前 患感冒，求治于当地医院，因发热收住院治疗，年老气化功能较 差，输液过多致热未退，旋即全身浮肿，遂转县医院治疗。越两 月，肿未消，病势日重。近二十天，小便点滴而下，借导尿管排 溺；大便三五日一行，燥如羊矢，医院诊断为“前列腺肥大”。 春节来临，返家待毙，春节过后，求余诊治。刻下面色萎黄，极 度消瘦；两眼凹陷，额骨高凸；腹大如鼓，青筋显露；四肢浮肿 异常，声音低微，半卧病榻。导尿管于尿道未取，溺便不住流 出。两肺未闻干湿性罗音；心率齐，亦未闻异常。两手寸口重按 凹陷方得其脉，均虚缓无力；测体温偏低，多日未进饮食，故便 干，自觉胀满难支。观全病程及病情，断为可治。始于感冒，想 当初解肌透表当愈。然输液过多，大量水液潴留体内；肺本为外 感之邪所束，宣发无权，肃降失司；脾失运化，胃失摄纳；肾脏 无力开合，几成不治。予大补肺气，强宣发、肃降之力；佐健脾 以培补后天生化之源调治。

例二 陆某，70岁，20C1年11月20日初诊。患者近半年 尿频、尿急，夜晚尤甚，加重月余，一夜小便七八次。县医院泌 尿科诊断为“前列腺增生肥大”。予抗生素类治疗，症状不见好 转。刻下纳差，少气乏力，面色萎黄，动则喘息；尿急、尿频， 小腹坠胀，小便日十余行；舌淡，脉沉弱。

例三周某，48岁，2000年4月10日初诊。据云：近日小 便不利，尿频，夜尿增多。B超检査：前列腺肥大。舌淡苔白， 脉沉弱。

第十八节前列康丸

例一 王某，19岁，患尿频、尿急，小便涩痛，尿道口红 肿，伴低热不退。县医院诊断为“前列腺炎”，收住院治疗，越 旬日，症状未减，经介绍来我处诊治。上述症状依然，舌红，苔 薄黄，脉弦。

例二 秦某，68岁，患尿急、尿频、尿痛1月余，曾于县 医院诊断为“前列腺增生伴前列腺炎”，予输液等法治疗，其效 不显。刻下小便日十余行，尿道口红肿，便时涩痛，痛苦万分， 舌红，苔薄黄，脉弦数。

例三 辛某，22岁。患者外出打工，患尿频、尿急、尿痛， 尿道口红肿，小腹坠胀，诊断为“前列腺炎症”。曾反复服西药 并输液治疗，耗资药费五千余元，症状未减，前来我处寻治。予 “前列康丸”每服6克，1日2次，服药月余，小腹坠痛止，小 便正常，继服1月余，诸症悉除O

第十九节阴阳分离散

例一 珍珍，女，两岁，1990年8月14日诊。患儿于10 天前吃病死驴肉即呕吐、腹泻，遂入我院治疗。予输液等法治 之，呕吐止，仍腹泻频作，日十余行，求中医科会诊。査患儿身 体消瘦，哭闹不休，口渴唇干，时泻出黄水夹不消化食物，，不 发热。

例二 元元，男，两岁，1989年12月28日诊。患儿腹泻4 天余，日十余行；色黄，水便相杂，并夹杂不消化食物，胀满， 不思饮食，不发热。

例三 翠翠，女，8个月。其母代诉：自生来常便演，夹不 消化乳汁，加重两月余，日数行，黄绿相杂，并夹白冻样不消化 乳汁，伴腹胀呕吐。

第二十节止泻护阴汤

例一 平平，男，9个月，1991年8月30日诊。其母云： 患儿发热、腹泻伴呕吐十余天。先前患儿脓血便多日，经当地医 生输液等法治疗，痢止泻不休。刻下便黄水，夹杂不消化乳汁， 发热，呕吐，哭闹不止，测体温37.6*0 o

例二 路标，男，两岁，1990年7月31日初诊。患儿原系 抱养，因饮食不当，身体消瘦，常患消化不良。10天前食病死 驴肉患呕吐、腹泻，遂入我院治疗，以食物中毒收住院。刻下呕 吐止，而腹泻如故，遂邀我科会诊。患儿身体消瘦，腹大青筋显 露，唇干，哭闹不止，大便呈黄绿色夹杂不消化食物，日十余 行，食之则呕，发热，测体温38.01。

例三 毛毛，男，一周岁，1990年9月16日诊。3天前患 儿因发热伴腹泻收住院治疗，予输液并西药调治，热稍退，腹泻 未止，遂邀中医会诊。刻下仍发热，测体温38.2C。泻下黄水 夹不消化乳汁，日十余行，伴腹胀，哭闹不止。

第二十一节降逆止泻汤

第二十二节温中止泻汤

例一 亚北，两周岁，1994年1月18日诊。其母代诉：患 儿腹泻3天余，当地医生予输液治疗，效果不显。刻下患儿腹 胀、腹泻，日四五行，色绿，夹不消化食物及黏液白冻，哭闹不 休。

例二 金凤，女，10个月，1988年7月10日诊。其母代 诉：患儿素无疾患，近十天泄泻频作，日十余次，色绿，夹不消 化乳汁，腹部微胀，曾予输液及西药治疗，其效不显。不发热, 哭闹不休。

第五章外 科

第二十三节阑尾得救一号方

第二十四节阑尾得救二号方

例一 牛某，男，20岁，1991年3月18日初诊。患者身体 素健壮，近两天右下腹疼痛伴呕吐，来我院诊治。刻下发热，测 体温38.0P,右下腹痛，压痛、反跳痛明显，伴大便干结，恶 心呕吐。血检：白细胞21 400/mm3,中性92%,舌红，苔白， 脉弦。予“阑尾得救一号方”加减。

例二 杨某，男，50岁，1990年11月21日初诊。患者小 腹微微作痛3天余，今夜晚突发剧痛，遂用车送我院急诊。据 云：腹胀痛，不能直立，右下腹可触及鸡蛋大小包块，大便干 结，高热39.0*0,诊断为“急性阑尾炎”。遂予输液治疗，并准 

例三 郭某，女，23岁，1990年11月3日初诊。自述：右 下腹疼痛一周余，当地医生诊断为“急性阑尾炎”，予输液等法 治疗，效果不显。经荐来我科诊治。

例四 李某，女，39岁，1996年6月17日初诊。据云：患 者发热伴小腹疼痛3天余。当地医生治疗效果不显'特来我院求 中医诊治。刻下发热，测体温38.0*0,小腹疼痛，右侧尤甚, 伴腹胀，大便干结。血检：白细胞20 600/mm3,中性90%,舌 质红，苔薄黄，脉弦数。予“阑尾得救一号方”加减。

第二十五节肤光净散

例一 平新，男，13岁，1988年2月7日初诊。患者全身 满布大小不规则银屑样皮损，微瘙痒，抓之角皮脱落。经皮肤科 医生诊断为牛皮癣，并多处求治，其效不显，前来我科求中医 诊治。

例二张某，男，20岁，患银屑病，多处求治未愈，亦服 “肤光净散” 3月余，皮屑脱落，皮肤恢复正常，永未复发。

第二十六节治传染性软疣方


</b>
</template>
  
  <script setup>
  import "@/static/css/iconfont.css";
  import { reactive, watch, ref, onMounted } from "vue";

  
  </script>
  
  <style lang="less" scoped>

  </style>
  