<template>
<div id="main">

<div class="zhangs" v-for="(section, index) in state.lizi" :key="index">
  <div class="zhang">{{section.zhang}}</div>
  <div class="jies" v-for="(zhang, index) in section.jies" :key="index">
    <div class="jie">{{zhang.jie}}</div>

    <div class="lizis" v-for="(lizi, index) in zhang.lizi" :key="index">
      <div class="lizi">{{lizi}}</div>
    </div>
  </div>
</div>

</div>
</template>
  
<script setup>
import "@/static/css/iconfont.css";
import { reactive, watch, ref, onMounted } from "vue";

const state = reactive({
  lizi: [
    {
      "zhang": "第一章",
      "jies": [
        {
          "jie": "第一节调经方",
          "lizi": [
            "例一常某，18岁，1988年12月27日来诊。月经15岁初潮，2~4月一行，3~4天净。经期腹痛下坠，色暗有血块，口干口苦，伴午后潮热。平素小腹微微作痛，经期尤甚。刻下停经4个月，食欲减退，面色萎黄，小腹部可触及一鸡蛋大小包块。舌淡暗，苔薄白，脉沉细，取“通经散”加减。",
            "例二张某，29岁，1992年4月27日初诊。4年前正常分娩，后未避孕而未孕。月经2〜3月一至，量少有血块，伴腹痛乏力，经期尤甚。刻下停经两月余，舌红暗，苔薄白，脉沉弦。予温经散寒，活血通经法调治，取“通经散”加减。",
            "例三单某，21岁，未婚，1987年5月31日初诊。月经17岁初潮，2~3月一至，2~3天净，量多有血块，刻下停经3个月，小腹隐痛，近20天反复鼻顔，舌红，苔薄，脉沉弦。",
            "例一刘某，19岁，未婚，月经14岁初潮，每于经期前两天小腹微微作痛，经至疼痛加重，多处调治，疼痛时有减轻，终未根除。半年来，经期小腹坠胀疼痛加重。昨天月经至，前来就诊，面色萎黄，腹疼坠胀，伴恶心呕吐，舌淡有瘀点，脉弦，予“痛经散”加减。",
            "例二代某，27岁，1年前受孕3月不慎流产，后月经过期而至伴腹痛。",
            "例三王某，18岁，未婚，1997年10月18日来诊。据云：月经初潮半年余，经期腹痛，经后小腹仍微微作痛，数日不止，伴腰酸腿软。刻下值经后，舌淡，苔薄白，脉沉弱，患者冲任未充也，予调经加补肾图治。",
            "例一王某，25岁，1988年11月20日初诊。据云：产后",
            "例二姚某，37岁，1987年12月29日初诊。自述患小腹痛1年余，月经调，量多夹血块，腹痛下坠，右下腹尤甚，伴腰酸痛，活动后加重。并反复发作尿急、尿频、尿痛，舌红，苔薄黄，脉弦。此乃邪郁小腹，胞宫受累，气滞血瘀，邪瘀互结，久而化热。予清热解毒、活血化瘀法调治。取“活血理冲汤”加减。",
            "例三杨某，38岁，1987年12月18日初诊。据云：小腹痛随经期而加重多年。月经错前落后，经色暗，夹血块，白带多而腥臭，伴恶心呕吐，舌红苔少，脉沉弦。此乃邪郁胞宫，郁久化热，湿热互结，白带乃成°胞宫受邪，扰乱月经。予清热利湿、活血止痛法调治。"
          ]
        },
        {
          "jie": "第二节求嗣方",
          "lizi": [
            "例一魏某，25岁，1995年12月18日初诊。据云：5年前生一女婴，后月经基本正常，然未避孕而未孕。今天来月经,舌红，苔薄白，脉沉弦。予“调经助孕汤”加减。",
            "例二饶某，22岁，1992年8月7日初诊。患者半年前受孕3个月，不慎流产。后月经基本正常，但未受孕，小腹坠胀疼痛，今天来月经，经色暗，有血块，小腹阵阵作痛，舌淡，苔白，脉沉弦。",
            "例三李某，23岁，1992年7月30日初诊。自述：婚后2年，夫妇同居未孕。曾多处求治未愈，反增纳差胀满，月经调，量多、色暗，有血块，伴经期腹痛。刻下值经后，舌红，苔薄，脉沉弦。（配偶精液常规检査：正常）",
            "例一蒋某，26岁，1987年12月29日来诊。据云：患者5年前生一女婴，后未采取避孕措施而未孕。月经调和，小腹微痛，腰酸腿软，伴头晕心悸。末次月经12月24日来潮，刻下值经后,舌淡，脉弦。予调补冲任法调治，取“补肾助孕汤”加减。",
            "例二李某，22岁，1988年5月24日初诊。据云：婚后2年夫妇同居未孕，月经：15岁初潮，30天一至，3〜5天净，量一般，无血块。面黄纳差，伴腰膝酸痛，经期小腹坠痛，经后尤甚。末次月经5月18日来潮，刻下值经后。舌淡苔白，脉沉弱。（配偶精液常规检査：正常）",
            "例三韦某，25岁,1989年3月22日初诊。据云：婚后1年余夫妇同居未孕。身体消瘦，面色萎黄，畏寒肢冷，关节疼痛。末次月经3月120,色暗量少，刻下值经后。舌红尖甚,脉沉弱。（配偶精液常规检查：正常）",
            "例系一胎不育，于经后求治，一药而获效。5年未育之沉府，先医必予产后瘀阻胞宫调治，而患者实与瘀阻无关也。月经调和而腰酸腿软，实冲任亏虚之明征，故予填补冲任、调补三阴而见奇效也。",
            "例）；经期腹痛，瘀血不下者，活之；经期乳房胀痛者，散之、理之。",
            "例一李某，26岁，1990年6月17日来诊。自述：3年前产一女婴，至今未孕，月经调，量多，色暗有血块，无腹痛。刻下月经净半月余，舌红，脉弦。",
            "例二万某，25岁，1989年11月1日来诊。据云：婚后2年余，夫妇同居未孕（配偶精液常规检査：正常）。月经18岁初潮，30天一至，有血块，小腹冷痛，带下多而腥臭，伴阴痛阴痒，口渴，舌红，脉沉弦。",
            "例三李某，25岁，1992年7有30日来诊。据云：婚后2年夫妇同居未孕（配偶精液常规检查：正常）。月经16岁初潮，30-35天一至，4天净，量多，色暗有血块，伴小腹坠胀疼痛。末次月经7月21日来潮。刻下值排卵期。舌红，苔薄，脉沉弦。予“通任助孕汤”加减。",
            "例一单某，23岁，1989年5月31日来诊。据云：婚后2年，夫妇同居未孕（配偶精液常规检査：正常）。月经：20岁初潮，2~4月一至，2〜3天净，量少有血块。并反复发作鼻顔。妇科检査：子宫发育不良，幼稚子宫。",
            "例二李某，28岁，1992年5月10日初诊。据云：婚后7年夫妇同居未孕（配偶精液常规检查：正常）。月经半年或一年一至，量极少，点滴而净；乳房扁平，性欲淡漠。妇科检查：幼稚子宫o舌红，脉弦。",
            "例一王某，27岁，1990年8月11日初诊。王氏婚后2",
            "例二刘某，26岁，1991年9月25日初诊。刘氏夫妇一女孩3岁，刻下值经期第二天。小腹冷痛下坠，经色暗，夹杂大小不等血块，舌红，苔薄，脉沉。",
            "例三王某，30岁，1993年12月9日初诊。王氏婚后一女孩6岁，后未避孕而未孕。月经调，经量少，色紫暗，有血块，伴小腹坠胀疼痛，舌红暗，脉沉细。刻下值经期第三天。"
          ]
        },
        {
          "jie": "第三节胎孕方",
          "lizi": [
            "例一李某，25岁，1988年8月10日初诊。患者受孕4个月，于6天前出现腰酸腹痛，继而阴道流血，遂求治于西医某保健医生，予输液止血安胎法治疗，症状未得控制，反而阴道流血量骤增，8月10日下午求余会诊。患者面色統白，阴道流血不止，腰酸、腹痛阵阵加剧，胎儿时刻有滑下之危。此乃气血虚弱不能养胎，不慎胎动致流血也。塞流止血以治标，益气摄血、补肾系胎以固本。",
            "例二朱某，27岁，1997年11月24日初诊。患者系姨兄妹结婚，曾于1995年、1996年连续两次坠胎流产。刻下停经两月余，恶心呕吐，舌淡红，脉弦滑。尿妊娠试验阳性。嘱：为确保不再坠胎流产，应长期服用安胎之剂以系胎元，并服用补肾生髓之剂以促胎儿发育。予“先天煎”加减，配丸药徐服。",
            "例三张某，27岁，1992年2月15日来诊。患者婚后均于受孕3个月后，连续两次坠胎流产。刻下停经两月余，腰酸腹痛，恐惧万分，经其姑母介绍来我处求治。患者身体尚可，腰酸痛，纳差呕恶，舌红，苔少，脉沉滑。予健脾益气、补肾安胎法调治。",
            "例一秦氏，23岁，1988年5月3日初诊。患者素往月经调和，刻下停经50天，胃廣胀满疼痛，恶心呕吐十余天，加重两天余，伴神志恍惚，经当地中西医治疗，其效不显。刻下胃胱压痛，口干渴，纳差呕吐，舌淡，苔白，脉缓。此乃脾胃虚弱，胎气夹中气上逆，故胃胱胀痛而呕恶也。",
            "例二张某，21岁，1987年8月5日初诊。患者停经40天，恶心呕吐，时小腹微痛，舌红尖甚，苔少，脉滑。",
            "例三牛某，39岁，1989年5月6日来诊。据云：患者10年前生一女婴，后屡孕屡坠。刻下停经45天，尿妊娠试验阳性。呕吐泛酸剧烈，茶水难以下咽，伴心悸，神疲乏力，小腹微微作痛，舌淡红，苔白，脉弦滑。-",
            "例一吴某，24岁，1988年4月30日初诊。自述停经两月余，尿妊娠试验阳性。刻下恶心呕吐，口干、口苦并时泛酸水，",
            "例二杨某，22岁，1990年3月20日初诊。患者结婚半年余，刻下停经40天，尿妊娠试验阳性。时小腹坠胀疼痛，纳差，恶心呕吐，泛酸，两胁胀满，舌红，苔薄，脉弦滑。",
            "例三杨某，26岁，1989年11月18日初诊。患者婚后一年余，月经调，刻下停经两月余。面色萎黄，恶心呕吐，口吐酸水，纳差低热；伴腹痛下坠，腰膝酸软，尿妊娠试验阳性，舌淡红而胖，脉沉滑。",
            "例一闻某，31岁，1992年2月22日来诊。患者怀孕4月余，妊娠后反复小腹微微作痛，服中西药腹痛未止，近日加重,伴胀满下坠，舌红，苔薄，脉沉滑，此乃气血虚弱不能养胎之故也。",
            "例二杨某，23岁，1990年3月31日来诊。据云：患者结婚半年余，刻下受孕两月。纳差呕吐，伴神疲乏力，小腹时时坠胀疼痛，舌淡红，苔薄白，脉沉弱。",
            "例三徐氏，26岁，1989年4月29日来诊。患者停经3月余，恶心呕吐，口吐清涎，纳差乏力，小腹坠胀微痛，舌淡红,脉滑。",
            "例一李某，25岁，受孕3月后，因感冒风寒，喉痒咳嗽。刻下喉痒，咳痰不爽，伴胸胁胀满，舌红，苔薄白，脉滑。此乃风寒袭肺，肺失宣发也。予“安胎子嗽饮”加减。",
            "例二秦氏，26岁。据云：受孕7个月，两月前因感冒未愈，频发咳嗽，伴两胁胀满，大便干结，时发鼻峋，舌红，苔少，脉滑有力。此乃胎孕煎熬阴津，阴虚肺失濡润，虚火内生，上灼肺津，故发鼻顔与咳嗽不止。肺与大肠相表里，肺阴虚，清肃无力，故大便干结也。予养阴润肺、止嗽安胎法调治。",
            "例一李某，30岁，受孕8个月，咽喉肿痛，舌红、边起芒刺，口干渴而少津，脉弦滑有力。此乃心火炽盛，阴津受损，火热炎上。《内经》云：“火曰炎上。”取“清热安胎饮”加减服之。",
            "例二张氏，23岁，受孕9个月，即近临产，因感冒而发咳嗽。近反复鼻顔，大便干结，舌红绛少苔，脉弦滑。",
            "例三刘氏，43岁，因输卵管粘连多年不孕，反复多处求治，幸受孕。",
            "例一我族侄媳，27岁，怀孕7月余。B超检查：胎儿横位。妇产科医生用艾条灸双侧至阴穴，并施扒卧法1日2次，越旬日，复B超探査：胎儿仍横位。服上方3剂，自觉胎儿动甚，药尽胎安。复B超探査：胎位已正。",
            "例二韦氏妇，怀孕7月余，B超探査:胎盘偏位，胎臀位，忧恐甚。亦予转胎良方服3剂，复B超探查：胎位转正。",
            "例不效，愿我同道可试用不妨也。然当今之世，医遇产妇胎位不正者，剖腹产者多矣，不知服药亦能矫正胎位，亦可免手术痛苦之忧也。"
          ]
        },
        {
          "jie": "第四节崩漏方",
          "lizi": [
            "例一李某，47岁，1989年9月18日来诊。据云：月经素往尚调，然近年来超前落后，经量时多时少。近阴道流血，淋沥不净两月余，前医诊为“更年期宫血”，予输液治疗，其效不显。近两天暴下不止，面色觥白，伴头晕心悸，舌淡，苔薄，脉沉弱。予“固冲止崩汤”加减。",
            "例二郭某，25岁，1989年8月31日来诊。据云：产后月余，恶露未净。近两天阴道流血大增，色淡，无血块，伴头晕心悸，口干、口渴，舌淡苔白，脉沉弱无力。",
            "例三牛氏，44岁，1991年1月29日来诊。自述：阴道不规则流血20余天，伴头晕乏力，腰酸腿软。初则夹豆壳大小血块；近两天流血色淡，大下不止。予输液止血法治之，症状未能控制，舌淡，苔薄，脉沉弱。予“固冲止崩汤”加减。",
            "例二张某，36岁，1988年元月25日初诊。据云：受孕两月余，于元旦做人工流产，至今流血不止。质涩黏无血块，腹痛不休。10天前曾一度大出血，经治疗好转，昨日流血增，舌淡，脉沉细。",
            "例三朱某，25岁，1991年10月10日初诊。患者3月前分娩，母子无恙。然产后恶露不多，淋沥不止，至今未净，小腹微微作痛，伴神疲乏力，舌淡，脉沉细。此乃产后恶露下而不畅，滞留胞宫，新血不生，故流血量少而不止也。",
            "例一王某，21岁，未婚。1987年5月27日初诊。据云:月经16岁初潮，每次经期较长，经量多，曾发血崩服中药而愈。近阴道流血时多时少两月余，反复就诊县医院而罔效。病情重笃，束手待毙，检：红细胞135万/mn?,白细胞13500/mm3,血色素4.4克。面色觥白光亮，极度贫血面容：头重脚轻，声音低微，神疲懒言，口干、口渴，不发热，下肢时现紫瘢；阴道流鲜血而色淡，舌淡胖，脉细弱。此乃冲任虚弱，脾失统摄，拟益气摄血、固涩止漏法，取“引血宁宫汤”加减，以观动…厥冷，下肢浮肿，口唇微紫紺，两肺满布哮鸣音，口干口黏而不渴；舌红有瘀点，苔白，脉沉细。心电图提示：右心房肥大。",
            "例二孙某，女，55岁，1988年2月13日初诊。据云：20年前因患感冒咳嗽，初未根治，后反复发作，冬季尤甚，近年来病情加重，冬夏亦然。刻下面黄体弱，动则喘息，低热不退，测体温37.2X3,大便干结，小便短赤，两肺满布哮鸣音；心音扩大，可闻2级以上收缩期吹风样杂音。舌淡暗，边有齿印，苔薄白，脉沉细、稍数。",
            "例一杨某，男，60岁，1997年2月14日初诊。据云：患者慢支史，近感冒20余天，发热咳嗽，颜面潮红，胸中隐隐作痛，动则嶋息，测体温37.3X3；血检：白细胞17100/mm3,胸透：慢性支气管炎，右下支气管肺炎。舌质红，苔白黄，脉弦。",
            "例二张某，54岁，1988年7月5日初诊。自述：患慢支多年，易感冒，初则冬春易发作；近年四季稍感风寒，咳喘不已。近因感冒，咳喘发热，下午尤甚，两肺可闻哮鸣音，舌质红，苔白，脉弦。",
            "例一张某，男，33岁，1988年1月18日初诊。患者素有慢支宿疾。近因感冒，咳嗽加重10余天。初则痰中带血，继则大口吐血。曾求中西医治疗，血未止，咳嗽加重。刻下面色晦暗，呼吸急促，满头大汗，两肺呼吸音粗糙，舌淡暗，苔薄白,脉弦滑。根据急则治其标之原则，首予降逆、清热止血法。",
            "例二王某，男，60岁，患慢支多年，冬春尤甚，平时靠“喘息定、氨茶碱”临时缓解症状。近因感冒，咳喘加重，动则喘息，咳吐白稠痰，不能平卧，纳差，舌淡胖，苔白腻，脉沉弱。"
          ]
        },
        {
          "jie": "第十一节甲状腺方",
          "lizi": [
            "例一张某，男，50岁，1997年5月13日初诊。患者左颈下喉旁一肿块，如核桃大小，质硬，随吞咽上下移动。彩超探査：甲状腺混合性包块。予“代刀消瘤丸”徐服两月余，肿块消无芥蒂。",
            "例二柳某，女，23岁，1996年10月6日初诊。患者颈下左侧喉旁一鸡蛋大小肿块。县医院诊断为“甲状腺瘤”，劝予手术治疗，因产后月余，加之手术费用过高，患者未予手术治疗。经介绍来我科诊治，遂予“代刀消瘤丸”徐服20天，肿块消无芥蒂，其夫欢喜若狂，喜曰：“若手术治疗，刀口至今尚未痊愈矣。”",
            "例三韦某，女，35岁。颈下左侧喉旁一鸡蛋大小肿块，质硬，医予消肿散结药物治疗，越月余，肿块未见缩小，遂来我科诊治，予“代刀消瘤丸”徐服月余。肿块尽消矣。",
            "例一宋某，女，30岁，1991年9月3日初诊。患者半年来常感心悸、心跳，多汗，烦躁易怒，继发现脖子稍粗，遂去当地医院检查，诊断为“甲状腺肿大”。服西药及中药，效果甚微，遂来我科求治。",
            "例二王某，女，36岁，1998年4月4日初诊。患者感冒两月余，近心悸、心跳，伴全身不自主颤动，困倦乏力，心烦多汗，心率快，测心率123次/分，颈粗，甲状腺明显肿大，舌红苔薄，脉细数。"
          ]
        },
        {
          "jie": "第十二节消渴方",
          "lizi": [
            "例一扬某，男，43岁，1989年6月14日初诊。自述：口干口渴，伴尿频月余。刻下尿如膏脂，伴疲倦乏力，测尿糖（十++）,舌质红，苔白腻，脉弦。",
            "例二刘某，女，62岁，1997年5月3日初诊。患者近日口干、口渴伴尿频，疲倦乏力，关节疼痛。尿蛋白阳性，尿糖(++)。舌质红，苔薄白，脉弦。"
          ]
        },
        {
          "jie": "第十三节鼻鈕方",
          "lizi": []
        },
        {
          "jie": "第十四节咽喉方",
          "lizi": [
            "例一李某，女，46岁。患者自觉咽中不利，阻塞梗滞多年，每于失眠或心情不舒而加重。近月余，咽干少津，似有物阻滞咽喉；咽壁有多枚滤泡，精神异常紧张。舌红，苔薄，脉弦。",
            "例二张某，男，36岁。据云：患慢性咽炎多年，多处求治，终未得愈。刻下咽中不利，似有物阻滞，吞咽疼痛，咽喉壁有多枚滤泡，舌红，脉弦。"
          ]
        }
      ]
    },
    {
      "zhang": "第三章男科",
      "jies": [
        {
          "jie": "第十五节",
          "lizi": [
            "例一王某，25岁，1989年7月28日初诊。患者婚后夫妇同居2年，其妻未孕（配偶妇检：无异常）。反复多次调治，无效验。精液常规检査：量2.5ml,计数0.3亿/mn?,活动率50%,活动不良。（刻下其妻月经净5天）舌红，苔白，脉弦。",
            "例二杨某，24岁，1997年5月9日初诊。据云：婚后夫妇同居2年，其妻未孕（配偶妇检：正常）。精液常规检査：量lml,计数1500万/mn?,活动率65%。舌质红，苔少，脉沉细，予“乾造丸”加减。",
            "例三张某，22岁，1987年8月3日初诊。患者1986年8月结婚，婚后夫妇同居未孕（配偶妇检：正常）。平素腰酸腿软，性欲淡漠。精液常规检查：量2ml,计数0.13亿/mn?,活动率60%,舌红，苔薄，脉弦。"
          ]
        },
        {
          "jie": "第十六节生精丸",
          "lizi": [
            "例一杨某，25岁，1996年3月8日初诊。患者婚后2年余，夫妇同居其妻未孕（配偶妇检：正常）。自述：腰酸腿软，头晕耳鸣，性欲淡漠。精液常规检查：量1ml,计数0.3亿/",
            "例二韦某，26岁，1994年10月22日初诊。患者婚后8个月，夫妇同居其妻未孕。据云：性欲极差，新婚之夜，即无性欲要求，伴阳痿早泄，腰酸腿软，头晕耳鸣。精液常规检査：量0.5ml,计数0.6亿/mn?,活动率50%,舌红，苔薄，脉沉弦。",
            "例三王某，28岁，1996岁9月13日初诊。患者婚后夫妇同居3年未育，无性欲要求，精液常规检查：无精虫。予“生精丸”治疗3月余。复精液常规检査：量2ml,计数400万/mn?。继服3月，其妻停经40天，恶心呕吐，尿妊娠试验阳性。"
          ]
        },
        {
          "jie": "第十七节化精丸",
          "lizi": [
            "例一韦某，25岁,1993年11月30日初诊。患者婚后1年余，夫妇同居未育（配偶检查：正常）。性欲正常，无不适，精液常规检查：量3ml,计数1.5亿/mn?,活动率80%,3小时未液化。予\"化精丸\"加味调治。",
            "例二杨某，25岁，教师，1989年3月27日初诊。患者婚后3年，夫妇同居未育（配偶妇科检查：正常）。性欲正常，自感腰酸乏力。精液常规检査：量4ml,计数0.7亿/mn?,活动力差，液化时间1小时。舌红，苔少，脉沉。"
          ]
        },
        {
          "jie": "第十八节益气通溺汤",
          "lizi": [
            "例一秦某，68岁，1989年2月10日初诊。患者于3月前患感冒，求治于当地医院，因发热收住院治疗，年老气化功能较差，输液过多致热未退，旋即全身浮肿，遂转县医院治疗。越两月，肿未消，病势日重。近二十天，小便点滴而下，借导尿管排溺；大便三五日一行，燥如羊矢，医院诊断为“前列腺肥大”。春节来临，返家待毙，春节过后，求余诊治。刻下面色萎黄，极度消瘦；两眼凹陷，额骨高凸；腹大如鼓，青筋显露；四肢浮肿异常，声音低微，半卧病榻。导尿管于尿道未取，溺便不住流出。两肺未闻干湿性罗音；心率齐，亦未闻异常。两手寸口重按凹陷方得其脉，均虚缓无力；测体温偏低，多日未进饮食，故便干，自觉胀满难支。观全病程及病情，断为可治。始于感冒，想当初解肌透表当愈。然输液过多，大量水液潴留体内；肺本为外感之邪所束，宣发无权，肃降失司；脾失运化，胃失摄纳；肾脏无力开合，几成不治。予大补肺气，强宣发、肃降之力；佐健脾以培补后天生化之源调治。",
            "例二陆某，70岁，20C1年11月20日初诊。患者近半年尿频、尿急，夜晚尤甚，加重月余，一夜小便七八次。县医院泌尿科诊断为“前列腺增生肥大”。予抗生素类治疗，症状不见好转。刻下纳差，少气乏力，面色萎黄，动则喘息；尿急、尿频，小腹坠胀，小便日十余行；舌淡，脉沉弱。",
            "例三周某，48岁，2000年4月10日初诊。据云：近日小便不利，尿频，夜尿增多。B超检査：前列腺肥大。舌淡苔白，脉沉弱。"
          ]
        },
        {
          "jie": "第十九节前列康丸",
          "lizi": [
            "例一王某，19岁，患尿频、尿急，小便涩痛，尿道口红肿，伴低热不退。县医院诊断为“前列腺炎”，收住院治疗，越旬日，症状未减，经介绍来我处诊治。上述症状依然，舌红，苔薄黄，脉弦。",
            "例二秦某，68岁，患尿急、尿频、尿痛1月余，曾于县医院诊断为“前列腺增生伴前列腺炎”，予输液等法治疗，其效不显。刻下小便日十余行，尿道口红肿，便时涩痛，痛苦万分，舌红，苔薄黄，脉弦数。",
            "例三辛某，22岁。患者外出打工，患尿频、尿急、尿痛，尿道口红肿，小腹坠胀，诊断为“前列腺炎症”。曾反复服西药并输液治疗，耗资药费五千余元，症状未减，前来我处寻治。予“前列康丸”每服6克，1日2次，服药月余，小腹坠痛止，小便正常，继服1月余，诸症悉除O"
          ]
        },
        {
          "jie": "第二十节阴阳分离散",
          "lizi": [
            "例一珍珍，女，两岁，1990年8月14日诊。患儿于10天前吃病死驴肉即呕吐、腹泻，遂入我院治疗。予输液等法治之，呕吐止，仍腹泻频作，日十余行，求中医科会诊。査患儿身体消瘦，哭闹不休，口渴唇干，时泻出黄水夹不消化食物，，不发热。",
            "例二元元，男，两岁，1989年12月28日诊。患儿腹泻4天余，日十余行；色黄，水便相杂，并夹杂不消化食物，胀满，不思饮食，不发热。",
            "例三翠翠，女，8个月。其母代诉：自生来常便演，夹不消化乳汁，加重两月余，日数行，黄绿相杂，并夹白冻样不消化乳汁，伴腹胀呕吐。"
          ]
        },
        {
          "jie": "第二十一节止泻护阴汤",
          "lizi": [
            "例一平平，男，9个月，1991年8月30日诊。其母云：患儿发热、腹泻伴呕吐十余天。先前患儿脓血便多日，经当地医生输液等法治疗，痢止泻不休。刻下便黄水，夹杂不消化乳汁，发热，呕吐，哭闹不止，测体温37.6*0o",
            "例二路标，男，两岁，1990年7月31日初诊。患儿原系抱养，因饮食不当，身体消瘦，常患消化不良。10天前食病死驴肉患呕吐、腹泻，遂入我院治疗，以食物中毒收住院。刻下呕吐止，而腹泻如故，遂邀我科会诊。患儿身体消瘦，腹大青筋显露，唇干，哭闹不止，大便呈黄绿色夹杂不消化食物，日十余行，食之则呕，发热，测体温38.01。",
            "例三毛毛，男，一周岁，1990年9月16日诊。3天前患儿因发热伴腹泻收住院治疗，予输液并西药调治，热稍退，腹泻未止，遂邀中医会诊。刻下仍发热，测体温38.2C。泻下黄水夹不消化乳汁，日十余行，伴腹胀，哭闹不止。"
          ]
        },
        {
          "jie": "第二十二节温中止泻汤",
          "lizi": [
            "例一亚北，两周岁，1994年1月18日诊。其母代诉：患儿腹泻3天余，当地医生予输液治疗，效果不显。刻下患儿腹胀、腹泻，日四五行，色绿，夹不消化食物及黏液白冻，哭闹不休。",
            "例二金凤，女，10个月，1988年7月10日诊。其母代诉：患儿素无疾患，近十天泄泻频作，日十余次，色绿，夹不消化乳汁，腹部微胀，曾予输液及西药治疗，其效不显。不发热,哭闹不休。"
          ]
        }
      ]
    },
    {
      "zhang": "第五章外科",
      "jies": [
        {
          "jie": "第二十三节阑尾得救一号方",
          "lizi": []
        },
        {
          "jie": "第二十四节阑尾得救二号方",
          "lizi": [
            "例一牛某，男，20岁，1991年3月18日初诊。患者身体素健壮，近两天右下腹疼痛伴呕吐，来我院诊治。刻下发热，测体温38.0P,右下腹痛，压痛、反跳痛明显，伴大便干结，恶心呕吐。血检：白细胞21400/mm3,中性92%,舌红，苔白，脉弦。予“阑尾得救一号方”加减。",
            "例二杨某，男，50岁，1990年11月21日初诊。患者小腹微微作痛3天余，今夜晚突发剧痛，遂用车送我院急诊。据云：腹胀痛，不能直立，右下腹可触及鸡蛋大小包块，大便干结，高热39.0*0,诊断为“急性阑尾炎”。遂予输液治疗，并准",
            "例三郭某，女，23岁，1990年11月3日初诊。自述：右下腹疼痛一周余，当地医生诊断为“急性阑尾炎”，予输液等法治疗，效果不显。经荐来我科诊治。",
            "例四李某，女，39岁，1996年6月17日初诊。据云：患者发热伴小腹疼痛3天余。当地医生治疗效果不显'特来我院求中医诊治。刻下发热，测体温38.0*0,小腹疼痛，右侧尤甚,伴腹胀，大便干结。血检：白细胞20600/mm3,中性90%,舌质红，苔薄黄，脉弦数。予“阑尾得救一号方”加减。"
          ]
        },
        {
          "jie": "第二十五节肤光净散",
          "lizi": []
        }
      ]
    }
  ]
})
</script>
  
<style lang="less" scoped>
#main{
  .zhangs{
    padding: 20px 30px;
    .zhang{
      font-size: 30px;

    }
    .jies{
      padding: 10px 30px;
      .jie{
        font-size: 20px;
      }

      .lizis{
        padding: 10px 20px;
        .lizi{
          font-size: 15px;
        }
      }
    }
  }
}
</style>
  