<template>
<div id="main">

<div class="zhangs" v-for="(section, index) in state.zucheng" :key="index">
  <div class="zhang">{{section.zhang}}</div>
  <div class="jies" v-for="(zhang, index) in section.jies" :key="index">
    <div class="jie">{{zhang.jie}}</div>

    <div class="zuchengs" v-for="(zucheng, index) in zhang.zucheng" :key="index">
      <div class="zucheng">{{zucheng}}</div>
    </div>
  </div>
</div>

</div>
</template>
  
<script setup>
import "@/static/css/iconfont.css";
import { reactive, watch, ref, onMounted } from "vue";

const state = reactive({
  zucheng: [
    {
      "zhang": "第一章",
      "jies": [
        {
          "jie": "第一节调经方",
          "zucheng": [
            "【组成】当归10克，川萼10克，炒香附子10克（捣碎），郁金10克，红花10克，莪术10克，生桃仁10克（捣碎），益母草15克，怀牛膝10克，泽兰10克，三棱10克，路路通10克，生水蛭末6克（冲服）。",
            "【组成】当归10克，川萼10克，赤芍10克，炒香附子10克（捣碎），郁金10克，红花10克，莪术10克，丹皮10克,乌药10克，玄胡10克（捣碎），川楝子10克，生乳香10克,生没药10克。",
            "【组成】丹皮10克，丹参15克，当归10克，生白芍15克，三棱10克，莪术10克，玄胡10克（捣碎），黄苓10克，败酱草15克，惹茵仁30克，生没药10克，红藤15克，甘草10克。",
            "【组成】熟地黄30克，生山药30克，炒菟丝子30克（捣碎），枸杞子10克，当归10克，白茯荟15克，益母草15克。",
            "【组成】生地黄30克，生白芍15克，梔子10克（捣碎），丹皮10克，红蚤休10克，生地榆30克，茜草10克，炒侧柏叶10克，乌贼骨30克（捣碎）。"
          ]
        },
        {
          "jie": "第二节求嗣方",
          "zucheng": [
            "【组成】丹皮10克，丹参15克，当归10克，赤芍10克，红花10克，川萼10克，路路通10克，生桃仁10克（捣碎），生水蛭末6克（冲服），熟地黄15克，炒香附子10克（捣碎），莞蔚子10克，枸杞子10克，炒菟丝子15克（捣碎）。",
            "【组成】熟地黄30克，当归10克，炒菟丝子15克（捣碎），枸杞子10克，生山药30克，覆盆子10克，仙茅10克，仙灵脾10克，沙苑子10克，巴戟天10克，莞蔚子10克，黄牛鞭10克（焙焦轧末冲服），路路通10克。",
            "【组成】炒菟丝子30克（捣碎），枸杞子10克，五味子10克（捣碎），覆盆子10克，车前子10克，肉灰蓉10克，熟地黄30克，炙龟板10克（捣碎），鹿茸3克（轧碎冲服），当归10克，乌药10克，益智仁10克，大红参10克（切小块吞服）。",
            "【组成】熟地黄30克，生山药30克，当归15克，炒菟丝子30克，枸杞子15克，覆盆子15克，肉灰蓉15克，巴戟天15克，仙茅15克，仙灵脾15克，锁阳15克，炒破故纸15克，沙苑子15克，益母草15克，黄牛鞭（焙焦）50克。"
          ]
        },
        {
          "jie": "第三节胎孕方",
          "zucheng": [
            "【组成】炒菟丝子30克（捣碎），桑寄生30克，川续断15克，阿胶10克（样化兑服），当归10克，黄苓10克，党参10克，生山药30克，熟地黄15克，炒白术10克，砂仁10克（捣碎）。",
            "【组成】制半夏10克，白茯苓10克，炒白术10克，陈皮10克，砂仁10克（捣碎），黄苓10克，炒白芍10克，当归10克，炒菟丝子15克（捣碎），桑寄生15克，川续断15克，阿胶1。克（洋化兑服）。",
            "【组成】炒白术10克，白茯苓10克，陈皮10克，白芍10克，黄苓10克，黄连10克（捣碎），苏梗10克，制半夏10克，炒菟丝子15克（捣碎），桑寄生15克，川续断15克，阿胶10克（洋化兑服）。",
            "【组成】党参10克，生黄芷15克，当归10克，生白芍10克，川苓6克，炒菟丝子15克（捣碎），枳壳10克，厚朴6克，川贝母10克（捣碎），砂仁10克（捣碎），艾叶6克，甘草10克。",
            "【组成】桑寄生15克，阿胶10克（律化兑服），炙杏仁10克，炒苏子10克（捣碎），陈皮10克，白茯苓10克，炙甘草10克，川贝母10克（捣碎），桔梗10克，前胡10克，冬花10克，紫莞10克，瓜萎皮10克，麦门冬10克。",
            "【组成】梔子10克（捣碎），黄苓10克，生地黄30克，当归10克，生白芍10再，甘草10克，桑寄生15克，麦门冬10克。■",
            "【组成】当归10克，川苓6克，枳壳6克，陈皮10克，白茯苓10克，泽泻10克，甘草10克。"
          ]
        },
        {
          "jie": "第四节崩漏方",
          "zucheng": [
            "【组成】熟地黄30克，生山药30克，党参15克，烟龙骨30克（捣碎），斌牡蛎30克（捣碎），乌贼骨30克（捣碎），茜草炭10克，生黄芷15克，地榆炭30克，荆芥炭10克，三七参10克（轧细末冲服）。",
            "【组成】生桃仁6克（捣碎），红花6克，丹皮10克，丹参10克，生地黄30克，当归10克，生白芍10克，炒蒲黄10克，益母草15克，乌贼骨30克（捣碎），茜草10克，血余炭6克。"
          ]
        },
        {
          "jie": "第五节带下方",
          "zucheng": [
            "【组成】生山药30克，英实30克，生龙骨30克（捣碎），生牡蛎30克（捣碎），车前子15克，惹以仁30克，乌贼骨30克（捣碎），茜草10克，生白芍15克，泽泻10克。",
            "【组成】白茯苓15克，猪苓10克，土茯苓30克，泽泻10克，赤芍10克，丹皮10克，茵陈10克，黄柏6克，梔子10克（捣碎），怀牛膝10克，车前子15克，椿根白皮10克，乌贼骨30克（捣碎），意茵仁30克，茜草10克。"
          ]
        },
        {
          "jie": "第六节产后方",
          "zucheng": [
            "【组成】当归30克，红花6克，生桃仁6克（捣碎），益母草15克，炒蒲黄10克，丹参10克，川萼6克，炮姜6克，肉桂6克（捣碎），炙甘草10克，炒王不留行子30克（捣碎）。",
            "【组成】生黄芷30克，当归20克，党参10克，炒艾叶10克，炒蒲黄10克，炒白术15克，生龙骨30克（捣碎），生牡蛎30克（捣碎），甘草10克，炒王不留行子30克（捣碎）。",
            "【组成】炒白术60克，当归30克，白茯苓15克，代赭石30克（捣碎）,生地黄30克，肉灰蓉15克，甘草10克。",
            "【组成】生黄芷30克，党参30克，当归30克，白茯苓15克，炒王不留行子30克，漏芦10克，路路通10克，川尊10克，通草10克，炮山甲10克。",
            "【组成】当归15克，白茯苓15克，炒白术10克,’柴胡10克，炒白芍10克，炮山甲10克（捣碎），漏芦10克，路路通10克，通草6克，瓜萎根15克，炒王不留行子30克（捣碎），",
            "【组成】蒲公英30克，全瓜萎30克（捣碎），金银花30克，连翘10克，赤芍10克，生地黄30克，通草10克.炮山甲10克（捣碎），炒王不留行子30克（捣碎），甘草10克。"
          ]
        },
        {
          "jie": "第七节妇科杂症方",
          "zucheng": [
            "【组成】丹皮30克，桂枝30克，赤芍30克，白茯苓30克，三棱30克,莪术30克，生桃仁30克，红花30克，生水蛭50克，生牡蛎50克。",
            "【组成】郁金15克，炮山甲15克，全瓜萎30克，大贝母30克，生牡蛎50克，炒王不留行子30克，柴胡10克，川楝子15克，当归15克，青皮10克，路路通10克，漏芦10克。",
            "【组成】炮山甲、生桃仁、红花、当归、大贝母、生乳香、生没药各10克，牡蛎、土鳖虫各30克。",
            "【组成】百合30克，合欢皮30克，生白芍30克，甘草10克，珍珠母30克（捣碎），知母10克，茯神10克，生地黄15克，当归10克，石菖蒲10克。",
            "【组成】生黄茂50克，川萼10克，知母15克，柴胡15克，生乳香6克，生没药6克，甘草10克，生龙骨30克（捣碎），生牡蛎30克（捣碎）。",
            "【组成】土茯苓30克，败酱草30克，红藤30克，白花蛇舌草15克，丹参15克，丹皮10克，当归10克，赤芍10克，三棱10克，莪术10克，玄胡10克（捣碎），惹茵仁30克，甘草10克，生乳香10克，生没药10克。"
          ]
        }
      ]
    },
    {
      "zhang": "第二章内科",
      "jies": [
        {
          "jie": "第一节胃病方",
          "zucheng": [
            "【组成】蒲公英30克，百合30克，生白芍30克，丹参30克，乌药10克，砂仁10克，良姜10克，炒香附子10克，炒蒲黄10克，玄胡10克，川楝子10克，制乳香10克，制没药10克，降香6克，五灵脂10克，白及10克。",
            "【组成】生白芍30克，百合30克，甘草10克，炒蒲黄10克，五灵脂10克，生山药30克，制乳香10克，制没药10克,乌药10克，白及10克。",
            "【组成】制半夏15克，柴胡6克，代赭石50克（轧细），生龙骨30克（捣碎），生牡蛎30克（捣碎），生山药30克，甘草10克。",
            "【组成】白茯苓30克，炒白术15克，桂枝10克，干姜10克，甘草10克，白蔻仁6克（捣碎），制半夏10克，厚朴10克，党参10克。",
            "【组成】生黄茂30克，桂枝10克，枳壳30克，升麻6克,柴胡6克，甘草10克，砂仁6克（捣碎），生白芍30克，大枣6枚。",
            "【组成】代赭石50克（轧碎），滑石30克，怀牛膝30克,升麻10克，甘草10克。",
            "【组成】代赭石50克（轧碎），生白芍30克，竹茹10克,天门冬15克，制半夏15克，生山药30克，当归15克，肉灰蓉10克，甘草10克，水煎服。",
            "【组成】醋制紫砲砂10克，沉香6克，槟榔10克，生水蛭10克。"
          ]
        },
        {
          "jie": "第二节泄泻方",
          "zucheng": [
            "【组成】炒白术50克，生山药30克，鸡内金15克，干姜15克，石榴皮15克，黄连10克，吴茱萸6克，熟枣肉100克。",
            "【组成】黄连10克（捣碎），金樱子30克（捣碎）,生龙骨30克（捣碎），炒白术30克，山楂炭30克，车前子15克，生白芍10克，泽泻10克，甘草10克，大枣6枚。",
            "【组成】炒白术30克，白茯苓15克，砂仁10克（捣碎）,陈皮10克，甘草10克，山楂炭30克，炒牵牛子10克（捣碎），大枣6枚。",
            "【组成】黄连10克（捣碎），生白芍15克，车前子15克,甘草10克，山楂炭30克，生龙骨30克（捣碎），生牡蛎30克（捣碎），煨木香6克。",
            "【组成】白头翁30克，黄连10克（捣碎），金银花30克，黄苓10克，黄柏10克，葛根30克，马齿范30克，山楂炭30克，地榆30克』生白芍30克，甘草10克。"
          ]
        },
        {
          "jie": "第三节肝胆方",
          "zucheng": [
            "【组成】川楝子15克，郁金10克，茵陈10克，柴胡10克，梔子10克（捣碎），金钱草30克，玄胡10克（捣碎），枳实10克，大黄10克（后下）。",
            "【组成】川楝子10克，郁金10克，玄胡10克（捣碎），生白芍30克，柴胡10克，当归10克，炒香附子10克（捣碎），三棱10克，莪术10克，合欢皮30克，百合30克。",
            "【组成】川楝子15克，郁金10克，三棱10克，莪术10克,玄胡10克（捣迁），生白芍30克，炒白术15克，鸡内金10克",
            "【组成】川楝子15克，郁金10克，三棱10克，莪术10克,百合30克，炒香附子10克（捣碎），良姜10克，丹参15克,五灵脂10克，乌药10克，降香10克，蒲公英30克，生白芍30克，炒蒲黄10克。",
            "【组成】炒白术30克，白茯苓30克，党参15克，鸡内金10克（捣碎），当归10克，生白芍30克，板蓝根30克，柴胡10克，茵陈10克。",
            "【组成】当归10克，生白芍30克，生黄茂30克，党参15克，炒白术15克，白茯苓15克，鸡内金10克（捣碎），丹参15克，三棱10克，莪术10克，红花10克，生桃仁10克（捣碎），姜黄10克，生水蛭10克（轧细末冲服）。",
            "【组成】生桃仁10克（捣碎），红花10克，当归10克，赤芍10克，生地黄15克，枳壳15克，玄胡10克（捣碎），五灵脂10克，丹皮10克，乌药10克，炒香附子10克（捣碎），川楝子10克，川萼6克，甘草6克。",
            "【组成】生黄芷30克，当归15克，生白芍30克，板蓝根30克，柴胡10克，鸡内金10克（捣碎），三棱10克，莪术10克，姜黄10克，甘草10克。•",
            "【组成】生黄茂30克，当归10克，板蓝根30克，连翘10克，甘草10克，赤芍10克，鸡内金10克（捣碎）,大黄10克（后下），炙鳖甲10克（捣碎），垂盆草15克，平地木15克，土鳖虫10克（捣碎），丹皮10克。",
            "【组成】生甘草150克，连翘90克，生白芍90克，全蝎90克，黄柏90克，肉桂50克，生大黄90克，冰片12克，薄荷冰12克，朱砂90克。",
            "【组成】板蓝根30克，茵陈30克，大黄10克（后下），梔子10克（捣碎），车前子15克，生白芍15克，鸡内金15克（辑碎），滑石30克，白茯苓30克，甘草10克。",
            "【组成】生黄茂30克，党参10克，当归15克，生白芍15克，山茱萸10克，枸杞子10克，木瓜30克，炒白术10克，枳壳30克，柴胡6克，升麻6克。"
          ]
        },
        {
          "jie": "第四节心病方",
          "zucheng": [
            "【组成】丹参30克，当归20克，焦山楂30克，赤芍20克，生桃仁20克，红花15克，川萼15克，柴胡10克，降香10克。",
            "【组成】大红参30克，丹参30克，焦山楂30克，檀香15克，当归30克，生黄茯30克，三七参30克，冰片5克，朱砂30克。",
            "【组成】生桃仁10克（捣碎），红花10克，当归10克，川苓10克，’赤芍10克，生地黄15克，枳壳10克，柴胡10克,甘草10克，桔梗10克，怀牛膝10克，檀香10克，郁金10克。",
            "【组成】生黄茂30克，当归10克，大红参10克（切小块吞服），制附子6克，桂枝10克，炙甘草10克，干姜10克，生白芍30克。",
            "【组成】当归30克，炒枣仁15克（捣碎），丹参30克，降香10克，生龙骨30克（捣碎），生牡蛎30克（捣碎），茯神10克，焦山楂30克，枳壳15克，青皮10克。",
            "【组成】生白芍30克，百合30克，麦门冬15克，桂圆肉15克，生地黄30克，山茱萸10克，炒枣仁10克（捣碎），炙龟板10克（捣碎），炙甘草10克，当归10克。",
            "【组成】生地黄30克，梔子10克（捣碎），板蓝根30克,金银花30克，蒲公英30克，生石膏30克（捣碎），知母10克，生甘草10克，当归15克，党参15克，百合30克，生龙骨30克（捣碎），生牡蛎30克（捣碎）。",
            "【组成】西洋参15克（切小块吞服），生黄芷30克，当归10克，麦门冬15克，五味子10克（捣碎），生地黄30克，焦山楂30克，生甘草10克，玉竹10克，黄精10克。"
          ]
        },
        {
          "jie": "第五节肾病方",
          "zucheng": [
            "【组成】麻黄6克，生石膏30克（捣碎），白茯苓15克，泽泻15克，车前子15克，板蓝根30克，石苇6克，瞿麦6克，甘草10克，生姜6克，大枣6枚。",
            "【组成】熟地黄30克，生山药30克，泽泻10克，白茯苓",
            "【组成】金银花30克，板蓝根30克，蒲公英30克，木通10克，石苇10克，瞿麦10克，连翘10克，滑石30克，车前子10克，篇蓄10克，甘草10克。",
            "【组成】生黄茂30克，柴胡10克，升麻10克，金钱草30克，海金砂30克（包煎），泽泻10克，木通10克，鸡内金15克（捣碎），石苇10克，瞿麦10克，滑石30克。",
            "【组成】金钱草30克，海金砂30克，鸡内金30克，滑石30克，生山药30克，硼砂30克，核桃仁100克。"
          ]
        },
        {
          "jie": "第六节身痛方",
          "zucheng": [
            "【组成】熟地黄30克，炒白芥子10克（捣碎），鹿角胶10克（洋化兑服），甘草10克，麻黄3克，肉桂3克，怀牛膝15克，金银花30克，当归10克，生没药10克，生乳香10克，炮姜3克。",
            "【组成】制川乌10克，桂枝15克，生白芍30克，丹参30克，川牛膝15克，木瓜30克，生桃仁10克（捣碎），生乳香10克，生没药10克，甘草10克。",
            "【组成】制川乌10克，麻黄6克，生白芍30克，生黄英30克，甘草10克，当归10克，丹参15克，生乳香10克，生没药10克。耳",
            "【组成】炒杜仲30克，怀牛膝15克，川续断15克，生山药30克，益母草15克，生桃仁6克（捣碎），红花6克，当归10克，生乳香10克，生没药10克。",
            "【组成】当归10克，生桃仁10克（捣碎），土鳖虫10克（捣碎），红花10克，丹参30克，生乳香10克，生没药10克，怀牛膝15克，益母草15克，炒杜仲30克，川续断15克，生山药30克，炒破故纸10克（捣碎）。",
            "【组成】土鳖虫50克，生桃仁30克，红花30克，当归30克，丹参30克，生乳香30克，生没药30克，川续断30克，枸杞子30克，炒杜仲30克，桑寄生30克，怀牛膝30克。",
            "【组成】土鳖虫90克，生桃仁20克，红花20克，当归20克，生乳香30克，生没药30克，细辛20克，松香100克，冰片30克。"
          ]
        },
        {
          "jie": "第七节外感方",
          "zucheng": [
            "【组成】生石膏50克（捣碎），金银花30克，连翘10克，薄荷叶10克，荆芥穗10克，蝉蜕6克，甘草10克，党参15克，玄参30克。",
            "【组成】荆芥穗10克，防风10克，羌活10克，金银花30克，蝉蜕6克，甘草10克。",
            "【组成】金银花30克，蒲公英30克，生石膏30克（捣碎），生地黄15克，连翘10克，薄荷叶10克，甘草10克。",
            "【组成】生黄芷30克，党参15克，生白芍30克，玄参30克，甘草10克，麦门冬15克，焦山楂30克。"
          ]
        },
        {
          "jie": "第八节头痛方",
          "zucheng": [
            "【组成】代赭石50克（轧碎），生白芍30克，怀牛膝30克,珍珠母30克（轧碎），夏枯草10克，钩藤10克，茵陈10克,丹参15克，菊花10克。",
            "【组成】生黄英30克，大红参10克（切小块吞服），葛根30克，升麻6克，甘草10克，菊花10克。",
            "【组成】当归10克，川苓15克，赤芍10克，珍珠母30克（捣碎），红花10克，菊花10克，怀牛膝10克，蔓荆子10克（捣碎），葛根30克，细辛3克，僵蚕10克，地龙10克，白芷10克。",
            "【组成】制半夏10克，天麻10克（捣碎），白术10克，珍珠母30克（捣碎），泽泻30克，怀牛膝15克，生白芍15克，白茯苓30克。"
          ]
        },
        {
          "jie": "第九节精神病方",
          "zucheng": [
            "【组成】生白芍30克，百合30克，合欢皮30克，石决明30克，远志20克，炒柏子仁20克，茯神20克，甘草20克，知母20克，生地黄20克，麦门冬20克，郁金20克，天竹黄30克，大贝母30克，琥珀30克，石菖蒲30克，炒枣仁30克，朱砂50克（轧细）。",
            "【组成】百合30克，生白芍30克，生龙骨30克（捣碎），生牡蛎30克（捣碎），珍珠母30克（捣碎），石菖蒲10克，远志10克，钮母10克，郁金10克，甘草10克。",
            "【组成】制半夏60克，惹茵仁60克，合欢皮30克，百合30克，炒枣仁15克（捣碎），生白芍30克，生龙骨30克（捣碎），生牡蛎30克（捣碎），甘草10克。"
          ]
        },
        {
          "jie": "第十节虚劳方",
          "zucheng": [
            "【组成】白及30克，川贝母30克，女贞子30克，沙参30克，百部50克，百合50克，生山药50克，甘草30克，鸡内金30克。",
            "【组成】五味子6克（捣碎），细辛3克，干姜6克，炙麻黄3克，生白芍30克，炙甘草10克，制半夏10克，炙杏仁10克，地龙10克。",
            "【组成】炙麻黄6克，炙甘草10克，生石膏30克（捣碎），炙杏仁10克，黄苓10克，前胡10克，细辛3克，五味子6克",
            "【组成】生龙骨30克（捣碎）,生牡蛎30克（捣碎），生山药30克，五味子10克（捣碎），炒苏子10克（捣碎），地龙10克。"
          ]
        },
        {
          "jie": "第十一节甲状腺方",
          "zucheng": [
            "【组成】生牡蛎50克，玄参30克，大贝母30克，昆布30克，海藻30克，夏枯草30克，蒲公英30克。",
            "【组成】生牡蛎60克（捣碎），炙龟板30克（捣碎），炙鳖甲30克（捣碎），生龙骨30克（捣碎），生地黄30克，大贝母15克，玄参30克，西洋参15克（切小块吞服），玉竹10克，黄精10克，蒲公英30克，昆布10克。"
          ]
        },
        {
          "jie": "第十二节消渴方",
          "zucheng": [
            "【组成】瓜萎根30克，葛根30克，党参15克，生黄茂30克，炒苍术10克，生山药30克，玄参3Q克，麦门冬15克，石斛10克,白茯苓10克。",
            "【组成】生石膏30克（捣碎），知母10克，黄连10克（捣碎），玄参30克，生地黄30克，丹皮10克，麦门冬15克，瓜萎根30克，石斛10克。",
            "【组成】生山药30克，熟地黄30克，生牡蛎30克（捣碎）,生龙骨30克（捣碎），生黄茂30克，玄参30克，炒苍术15克,瓜萎根30克，石斛10克，桑寄生15克。"
          ]
        },
        {
          "jie": "第十三节鼻鈕方",
          "zucheng": [
            "【组成】代赭石30克（轧碎），怀牛膝30克，生牡蛎30克（捣碎），生龙骨30克（捣碎），生白芍30克，大黄10克（后下），生地黄15克，梔子10克（捣碎），丹皮10克，甘草10克。",
            "【组成】生地黄30克，梔子10克（捣碎），黄苓10克，代赭石20克（轧碎），怀牛膝15克，藕节10克，龙胆草10克,小蓟10克，白茅根30克，茜草10克，生山药30克。"
          ]
        },
        {
          "jie": "第十四节咽喉方",
          "zucheng": [
            "【组成】金银花30克，连翘10克，玄参30克，生地黄30克，炒牛莠子15克（捣碎），蒲公英30克，桔梗10克，生石膏30克（捣碎），甘草10克b",
            "【组成】净硼砂10克，琥珀1克，冰片0.5克（咽喉溃烂者，冰片用火烧过），乌贼骨1克（去硬壳）。",
            "【组成】金银花30克，蒲公英30克，桔梗30克，板蓝根30克，乌梅30克，麦门冬30克，甘草30克，木蝴蝶20克，青果30克。",
            "【组成】南沙参30克，麦门冬30克，金银花30克，桔梗30克，乌梅30克，玄参30克，石菖蒲30克，甘草30克，蝉蜕20克。"
          ]
        }
      ]
    },
    {
      "zhang": "第三章男科",
      "jies": []
    }
  ]
})

</script>
  
<style lang="less" scoped>
#main{
  .zhangs{
    padding: 20px 30px;
    .zhang{
      font-size: 30px;

    }
    .jies{
      padding: 10px 30px;
      .jie{
        font-size: 20px;
      }

      .zuchengs{
        padding: 10px 20px;
        .zucheng{
          font-size: 15px;
        }
      }
    }
  }
}
</style>
  